In [6574]:
import pandas as pd
import os, re
from pathlib import Path
from matplotlib import pyplot as plt
import seaborn as sns
import numpy as np
from sqlalchemy import create_engine, types
from sqlalchemy import text 
from openpyxl import load_workbook
from pathlib import Path

In [6575]:
from dotenv import dotenv_values

config = dotenv_values()

# define variables for the login
pg_user = config['POSTGRES_USER']  # align the key label with your .env file !
pg_host = config['POSTGRES_HOST']
pg_port = config['POSTGRES_PORT']
pg_db = config['POSTGRES_DB']
pg_schema = config['POSTGRES_SCHEMA']
pg_pass = config['POSTGRES_PASS']

In [6576]:
url = f'postgresql://{pg_user}:{pg_pass}@{pg_host}:{pg_port}/{pg_db}'
engine = create_engine(url, echo=False)

In [6577]:
my_schema = 'team_5' # update it to your schema

with engine.begin() as conn: 
    result = conn.execute(text(f'SET search_path TO {my_schema};'))

In [6578]:
df_1= pd.read_csv('../data/Raw/World_Marriage_Dataset.csv')

In [6579]:
df_1.drop(columns=["Sr.No."], inplace=True)

In [6580]:
df_1.columns = df_1.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6581]:
df_1.rename(columns={
    "agegroup": "age_group",
    "maritalstatus": "marital_status",
    "dataprocess": "data_process",
    "Data Collection (Start Year)": "data_collection_start_year",
    "Data Collection (End Year)": "data_collection_end_year",
    "Data Source": "data_source",
    "Country": "country",
    "Sex": "sex"
}, inplace=True)

In [6582]:
df_1.drop_duplicates(inplace=True)
df_1.dropna(inplace=True)

df_1['data_collection_start_year'] = df_1['data_collection_start_year'].astype(str).str.replace(',', '').astype(int)
df_1['data_collection_end_year'] = df_1['data_collection_end_year'].astype(str).str.replace(',', '').astype(int)

In [6583]:
df_info = pd.DataFrame({
    'datatypes': df_1.dtypes,
    'null_count': df_1.isnull().sum(),
    'unique_count': df_1.nunique()
})
print(df_info)

                           datatypes  null_count  unique_count
country                       object           0           235
age_group                     object           0            63
sex                           object           0             2
marital_status                object           0            35
data_process                  object           0             6
data_collection_start_year     int32           0            62
data_collection_end_year       int32           0            60
data_source                   object           0            15

In [6584]:
#df_1.to_csv("cleaned_world_marriage.csv", index=False)

In [6585]:
#df_1.to_sql('world_marriage', engine, if_exists='replace', index=False)

In [6586]:
s_1 = ('../data/Cleaned/cleaned_world_marriage.csv')

In [6587]:
AGE_COL = "age_group"

# 0) Ensure s_1 is a DataFrame
if isinstance(s_1, (str, Path)):
    s_1 = pd.read_csv(s_1)
elif isinstance(s_1, tuple) and len(s_1) == 1 and isinstance(s_1[0], (str, Path)):
    s_1 = pd.read_csv(s_1[0])

# 1) Normalize age labels; keep [+75]; map any 65+ to [65-69]

def norm_age(x):
    if pd.isna(x): return x
    x = str(x).replace("–","-").replace("—","-").replace("to","-").replace("_","-")
    x = re.sub(r"[()]", "", x)
    x = re.sub(r"\s+", "", x)
    if re.search(r"\[\+75\]|\[75\+\]|75\+|\+75", x):   # preserve 75+
        return "[+75]"
    if re.fullmatch(r"\+?65\+?|\[?\+65\]?|\[?65\+\]?", x, flags=re.I):  # merge 65+
        return "[65-69]"
    m = re.match(r"^\[?(\d{1,3})-(\d{1,3})\]?$", x)   # standard ranges
    if m:
        a, b = map(int, m.groups())
        return f"[{a}-{b}]"
    m = re.search(r"(\d{1,3})", x)                    # fallback: first number
    return f"[{m.group(1)}]" if m else x

s_1[AGE_COL] = s_1[AGE_COL].astype(str).map(norm_age)

# 2) Keep top-14 age buckets by frequency (delete all others)
top14 = s_1[AGE_COL].value_counts(dropna=False).nlargest(14).index.tolist()
s_1 = s_1[s_1[AGE_COL].isin(top14)].copy()

# 3) Natural ordering (put [+75] last)
def start_num(lbl):
    return 10**9 if lbl == "[+75]" else int(re.search(r"\d+", str(lbl)).group())
cats = sorted(top14, key=start_num)
s_1[AGE_COL] = pd.Categorical(s_1[AGE_COL], categories=cats, ordered=True)
s_1 = s_1.sort_values(AGE_COL).reset_index(drop=True)

print("Kept age buckets (14):", list(s_1[AGE_COL].cat.categories))

Kept age buckets (14): ['[10-14]', '[15-19]', '[20-24]', '[25-29]', '[30-34]', '[35-39]', '[40-44]', '[45-49]', '[50-54]', '[55-59]', '[60-64]', '[65-69]', '[70-74]', '[+75]']

In [6588]:
#s_1.to_csv('../data/Prep/prep_world_marriage.csv', index= False)

In [6589]:
#s_1.to_sql('prep_world_marriage', engine, if_exists='replace', index=False)

In [6590]:
df_2 = pd.read_csv('../data/Raw/age-at-marriage-women.csv')

In [6591]:
df_2.columns = df_2.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6592]:
df_2 = df_2.drop(columns=['1005564annotations'])

df_2.rename(columns={
    "entity": "country",   
}, inplace=True)

In [6593]:
df_2.drop_duplicates(inplace=True)
df_2.dropna(inplace=True)

In [6594]:
df_2['year'] = df_2['year'].astype(str).str.replace(',', '').astype(int)

In [6595]:
df_info = pd.DataFrame({
    'datatypes': df_2.dtypes,
    'null_count': df_2.isnull().sum(),
    'unique_count': df_2.nunique()
})
print(df_info)

                                    datatypes  null_count  unique_count
country                                object           0            41
code                                   object           0            41
year                                    int32           0            32
mean_age_of_women_at_first_marriage   float64           0           179

In [6596]:
#df_2.to_csv("cleaned_age_at_marriage_women.csv", index=False)

In [6597]:
#df_2.to_sql('age_at_marriage_women', engine, if_exists='replace', index=False)

In [6598]:
df_3= pd.read_csv('../data/Raw/marriage-rate-per-1000-inhabitants.csv')

In [6599]:
df_3.columns = df_3.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6600]:
df_3.rename(columns={
    "entity": "country",   
}, inplace=True)

In [6601]:
df_3['year'] = df_3['year'].astype(str).str.replace(',', '').astype(int)

In [6602]:
df_3.drop_duplicates(inplace=True)
df_3.dropna(inplace=True)

In [6603]:
df_info = pd.DataFrame({
    'datatypes': df_3.dtypes,
    'null_count': df_3.isnull().sum(),
    'unique_count': df_3.nunique()
})
print(df_info)

                                              datatypes  null_count  \
country                                          object           0
code                                             object           0
year                                              int32           0
crude_marriage_rate_marriages_per_1000_people   float64           0

                                               unique_count
country                                                  45
code                                                     45
year                                                    127
crude_marriage_rate_marriages_per_1000_people           109

In [6604]:
#df_3.to_csv("cleaned_marriage-rate-per-1000-inhabitants.csv", index=False)

In [6605]:
#df_3.to_sql('married_rate_per_1000', engine, if_exists='replace', index=False)

In [6606]:
df_4= pd.read_csv('../data/Raw/marriage-rates-in-1990-vs-2020.csv')

In [6607]:
df_4.columns = df_4.columns.str.lower() \
    .str.replace(' ', '') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6608]:
df_4 = df_4.drop(columns=['worldregionsaccordingtoowid'])

df_4.rename(columns={
    "crudemarriageratemarriagesper1000people": "crude_marriage_rate",
    "crudemarriageratemarriagesper1000people1": "crude_marriage_rate_people1",
    "year1": "year_1",
    "entity": "country"
}, inplace=True)

In [6609]:
df_4.drop_duplicates(inplace=True)
df_4.dropna(inplace=True)

In [6610]:
df_4['year_1'] = pd.to_numeric(df_4['year_1'], errors='coerce').astype('Int64')

In [6611]:
df_info = pd.DataFrame({
    'datatypes': df_4.dtypes,
    'null_count': df_4.isnull().sum(),
    'unique_count': df_4.nunique()
})
print(df_info)

                            datatypes  null_count  unique_count
country                        object           0            38
code                           object           0            38
year                            int64           0            61
crude_marriage_rate           float64           0           101
crude_marriage_rate_people1   float64           0            28
year_1                          Int64           0             1

In [6612]:
#df_4.to_csv("cleaned_marriage-rates-in-1990-vs-2020.csv", index=False)

In [6613]:
#df_4.to_sql('marriage_rates_in_1990_vs_2020', engine, if_exists='replace', index=False)

In [6614]:
df_5 = pd.read_csv('../data/Raw/share-of-births-outside-marriage.csv')

In [6615]:
df_5.columns = df_5.columns.str.lower() \
    .str.replace(' ', '') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6616]:

df_5.rename(columns={
    "shareofbirthsoutsideofmarriageofallbirths": "share_of_births_outside_of_marriage",
    "entity": "country"
}, inplace=True)

df_5.drop_duplicates(inplace=True)
df_5.dropna(inplace=True)

In [6617]:
df_info = pd.DataFrame({
    'datatypes': df_5.dtypes,
    'null_count': df_5.isnull().sum(),
    'unique_count': df_5.nunique()
})
print(df_info)

                                    datatypes  null_count  unique_count
country                                object           0            42
code                                   object           0            42
year                                    int64           0            62
share_of_births_outside_of_marriage   float64           0           610

In [6618]:
#df_5.to_csv("cleaned_share-of-births-outside-marriage.csv", index=False)

In [6619]:
#df_5.to_sql('share_of_births_outside_marriage', engine, if_exists='replace', index=False)

In [6620]:
df_6 = pd.read_csv('../data/Raw/share-of-men-in-england-and-wales-who-have-ever-married-by-age.csv')
df_6

,Entity,Code,Year,Proportions of men or women who had ever married by a certain age for 1900 birth cohort,Proportions of men or women who had ever married by a certain age for 1920 birth cohort,Proportions of men or women who had ever married by a certain age for 1940 birth cohort,Proportions of men or women who had ever married by a certain age for 1960 birth cohort,Proportions of men or women who had ever married by a certain age for 1970 birth cohort,Proportions of men or women who had ever married by a certain age for 1980 birth cohort,Proportions of men or women who had ever married by a certain age for 1990 birth cohort,Proportions of men or women who had ever married by a certain age for 2000 birth cohort
0,Men,NaN,17,0.0,0.0,0.0,0.1,0.0,0.0,0.0,0.0
1,Men,NaN,18,0.1,0.1,0.4,0.6,0.1,0.0,0.0,0.0
2,Men,NaN,19,0.8,0.6,2.0,2.5,0.7,0.3,0.1,0.0
3,Men,NaN,20,2.4,2.2,6.0,6.2,1.9,0.7,0.3,0.1
4,Men,NaN,21,6.1,7.4,13.6,11.9,3.9,1.4,0.6,0.2
...,...,...,...,...,...,...,...,...,...,...,...
63,Women,NaN,46,84.5,91.6,95.5,86.9,75.0,NaN,NaN,NaN
64,Women,NaN,47,84.8,91.7,95.6,87.0,75.4,NaN,NaN,NaN
65,Women,NaN,48,85.0,91.8,95.6,87.2,75.7,NaN,NaN,NaN
66,Women,NaN,49,85.2,91.9,95.7,87.3,76.0,NaN,NaN,NaN
67,Women,NaN,50,85.4,92.0,95.7,87.5,76.3,NaN,NaN,NaN

In [6621]:
df_6.columns = df_6.columns.str.lower() \
    .str.replace(' ', '') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

df_6.drop_duplicates(inplace=True)

df_6.head()

,entity,code,year,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1900birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1920birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1940birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1960birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1970birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1980birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1990birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor2000birthcohort
0,Men,NaN,17,0.0,0.0,0.0,0.1,0.0,0.0,0.0,0.0
1,Men,NaN,18,0.1,0.1,0.4,0.6,0.1,0.0,0.0,0.0
2,Men,NaN,19,0.8,0.6,2.0,2.5,0.7,0.3,0.1,0.0
3,Men,NaN,20,2.4,2.2,6.0,6.2,1.9,0.7,0.3,0.1
4,Men,NaN,21,6.1,7.4,13.6,11.9,3.9,1.4,0.6,0.2

In [6622]:
df_6 = df_6.drop(columns=['code','proportionsofmenorwomenwhohadevermarriedbyacertainagefor1980birthcohort',
    'proportionsofmenorwomenwhohadevermarriedbyacertainagefor1990birthcohort',
    'proportionsofmenorwomenwhohadevermarriedbyacertainagefor2000birthcohort'])

df_6.rename(columns={
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1900birthcohort": "1900_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1920birthcohort": "1920_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1940birthcohort": "1940_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1960birthcohort": "1960_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1970birthcohort": "1970_birthcohort",
    "entity": "sex"
}, inplace=True)
df_6

,sex,year,1900_birthcohort,1920_birthcohort,1940_birthcohort,1960_birthcohort,1970_birthcohort
0,Men,17,0.0,0.0,0.0,0.1,0.0
1,Men,18,0.1,0.1,0.4,0.6,0.1
2,Men,19,0.8,0.6,2.0,2.5,0.7
3,Men,20,2.4,2.2,6.0,6.2,1.9
4,Men,21,6.1,7.4,13.6,11.9,3.9
...,...,...,...,...,...,...,...
63,Women,46,84.5,91.6,95.5,86.9,75.0
64,Women,47,84.8,91.7,95.6,87.0,75.4
65,Women,48,85.0,91.8,95.6,87.2,75.7
66,Women,49,85.2,91.9,95.7,87.3,76.0
67,Women,50,85.4,92.0,95.7,87.5,76.3

In [6623]:
df_6.dropna(inplace=True)
df_6.describe

<bound method NDFrame.describe of       sex  year  1900_birthcohort  1920_birthcohort  1940_birthcohort  \
0     Men    17               0.0               0.0               0.0
1     Men    18               0.1               0.1               0.4
2     Men    19               0.8               0.6               2.0
3     Men    20               2.4               2.2               6.0
4     Men    21               6.1               7.4              13.6
..    ...   ...               ...               ...               ...
63  Women    46              84.5              91.6              95.5
64  Women    47              84.8              91.7              95.6
65  Women    48              85.0              91.8              95.6
66  Women    49              85.2              91.9              95.7
67  Women    50              85.4              92.0              95.7

    1960_birthcohort  1970_birthcohort
0                0.1               0.0
1                0.6               0.1
2                2.5               0.7
3                6.2               1.9
4               11.9               3.9
..               ...               ...
63              86.9              75.0
64              87.0              75.4
65              87.2              75.7
66              87.3              76.0
67              87.5              76.3

[68 rows x 7 columns]>

In [6624]:
df_info = pd.DataFrame({
    'datatypes': df_6.dtypes,
    'null_count': df_6.isnull().sum(),
    'unique_count': df_6.nunique()
})
print(df_info)

                 datatypes  null_count  unique_count
sex                 object           0             2
year                 int64           0            34
1900_birthcohort   float64           0            66
1920_birthcohort   float64           0            61
1940_birthcohort   float64           0            62
1960_birthcohort   float64           0            67
1970_birthcohort   float64           0            65

In [6625]:
df_6.sample(12)

,sex,year,1900_birthcohort,1920_birthcohort,1940_birthcohort,1960_birthcohort,1970_birthcohort
58,Women,41,82.9,90.7,95.1,85.7,72.7
24,Men,41,90.2,90.3,91.4,78.6,65.0
65,Women,48,85.0,91.8,95.6,87.2,75.7
7,Men,24,30.2,34.4,49.8,33.7,14.8
28,Men,45,91.8,91.3,92.0,80.5,68.2
10,Men,27,55.8,59.2,73.5,52.2,28.7
61,Women,44,84.0,91.3,95.4,86.5,74.1
15,Men,32,79.3,82.2,86.5,68.8,48.2
17,Men,34,83.2,85.5,88.5,72.4,53.7
39,Women,22,24.3,39.3,57.5,40.6,18.2
59,Women,42,83.3,90.9,95.2,85.9,73.2
11,Men,28,62.7,66.3,77.7,56.8,33.1

In [6626]:
#df_6.to_csv("cleaned_share-of-men-in-england-and-wales-who-have-ever-married-by-age.csv", index=False)

In [6627]:
#df_6.to_sql('men_in_england_and_wales_married_by_age', engine, if_exists='replace', index=False)

In [6628]:
df_7 = pd.read_csv('../data/Raw/share-of-births-outside-marriage.csv')

In [6629]:
df_7.columns = df_7.columns.str.lower() \
    .str.replace(' ', '') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6630]:
df_7.rename(columns={
    "shareofsingleparenthouseholds": "share_of_single_parent_households",
    "entity": "country"
}, inplace=True)

df_7.drop_duplicates(inplace=True)
df_7.dropna(inplace=True)
df_7.sample(5)

          country code  year  shareofbirthsoutsideofmarriageofallbirths
713       Germany  DEU  1992                                       14.9
583       Estonia  EST  2006                                       58.2
431        Cyprus  CYP  2007                                        8.7
1145       Latvia  LVA  2016                                       40.9
1996  Switzerland  CHE  2011                                       19.3

In [6631]:
df_info = pd.DataFrame({
    'datatypes': df_7.dtypes,
    'null_count': df_7.isnull().sum(),
    'unique_count': df_7.nunique()
})
print(df_info)

                                          datatypes  null_count  unique_count
country                                      object           0            42
code                                         object           0            42
year                                          int64           0            62
shareofbirthsoutsideofmarriageofallbirths   float64           0           610

In [6632]:
#df_7.to_csv("cleaned_share-of-single-parent-households.csv", index=False)

In [6633]:
#df_7.to_sql('single_parent_households', engine, if_exists='replace', index=False)

In [6634]:
df_8 = pd.read_csv('../data/Raw/share-of-women-in-england-and-wales-who-have-ever-married-by-age.csv')

In [6635]:
df_8.columns = df_8.columns.str.lower() \
    .str.replace(' ', '') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6636]:
df_8['code'] = df_8['code'].fillna('GBR')
df_8.sample(5)

,entity,code,year,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1900birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1920birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1940birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1960birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1970birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1980birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor1990birthcohort,proportionsofmenorwomenwhohadevermarriedbyacertainagefor2000birthcohort
6,Men,GBR,23,21.4,26.8,38.1,26.2,10.5,3.9,2.1,0.8
0,Men,GBR,17,0.0,0.0,0.0,0.1,0.0,0.0,0.0,0.0
24,Men,GBR,41,90.2,90.3,91.4,78.6,65.0,54.4,NaN,NaN
9,Men,GBR,26,48.3,51.0,67.7,46.8,24.1,11.2,7.1,NaN
63,Women,GBR,46,84.5,91.6,95.5,86.9,75.0,NaN,NaN,NaN

In [6637]:
df_8 = df_8.drop(columns=['code','proportionsofmenorwomenwhohadevermarriedbyacertainagefor1980birthcohort',
    'proportionsofmenorwomenwhohadevermarriedbyacertainagefor1990birthcohort',
    'proportionsofmenorwomenwhohadevermarriedbyacertainagefor2000birthcohort'])

df_8.rename(columns={
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1900birthcohort": "1900_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1920birthcohort": "1920_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1940birthcohort": "1940_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1960birthcohort": "1960_birthcohort",
    "proportionsofmenorwomenwhohadevermarriedbyacertainagefor1970birthcohort": "1970_birthcohort",
    "entity": "sex"
}, inplace=True)

df_8.drop_duplicates(inplace=True)
df_8.dropna(inplace=True)
df_8.sample(5)

,sex,year,1900_birthcohort,1920_birthcohort,1940_birthcohort,1960_birthcohort,1970_birthcohort
15,Men,32,79.3,82.2,86.5,68.8,48.2
19,Men,36,86.1,87.6,89.7,74.8,58.3
9,Men,26,48.3,51.0,67.7,46.8,24.1
43,Women,26,55.1,68.3,84.2,65.2,40.1
56,Women,39,81.8,90.2,94.8,85.0,71.3

In [6638]:
df_info = pd.DataFrame({
    'datatypes': df_8.dtypes,
    'null_count': df_8.isnull().sum(),
    'unique_count': df_8.nunique()
})
print(df_info)

                 datatypes  null_count  unique_count
sex                 object           0             2
year                 int64           0            34
1900_birthcohort   float64           0            66
1920_birthcohort   float64           0            61
1940_birthcohort   float64           0            62
1960_birthcohort   float64           0            67
1970_birthcohort   float64           0            65

In [6639]:
#df_8.to_csv("cleaned_share-of-women-in-england-and-wales-who-have-ever-married-by-age.csv", index=False)

In [6640]:
#df_8.to_sql('women_in_england_and_wales_married_by_age', engine, if_exists='replace', index=False)

In [6641]:
#pip install openpyxl pywin32

In [6642]:
df_excel_1 = pd.read_excel('../data/Raw/undesa_pd_2019_wmd_marital_status.xlsx')

In [6643]:
#all_sheets = pd.read_excel('../data/Raw/undesa_pd_2019_wmd_marital_status.xlsx', sheet_name=None)

In [6644]:
xls_1 = pd.ExcelFile('../data/Raw/undesa_pd_2019_wmd_marital_status.xlsx')
print(xls_1.sheet_names)

['INFORMATION NOTE', 'Database Field Descriptions', 'MARITAL_STATUS_BY_AGE', 'CURRENTLY MARRIED', 'EVER_MARRIED', 'SMAM']

In [6645]:
excel_1 = '../data/Raw/undesa_pd_2019_wmd_marital_status.xlsx'

# Output directory (make sure it exists)
output_dir = '../data/processed/'
os.makedirs(output_dir, exist_ok=True)

# List of sheets you want to extract
sheets_to_extract = ['MARITAL_STATUS_BY_AGE', 'CURRENTLY MARRIED', 'EVER_MARRIED', 'SMAM']

In [6646]:
"""for sheet in sheets_to_extract:
    # Read just this sheet into a DataFrame
    df_excel_1 = pd.read_excel(excel_1, sheet_name=sheet)
    
    # Optional: Clean the filename (replace spaces with underscores, etc.)
    csv_name = sheet.replace(' ', '_').lower() + '.csv'
    csv_path = os.path.join(output_dir, csv_name)
    
    # Save the DataFrame as CSV
    df_excel_1.to_csv(csv_path, index=False)
    print(f"Saved: {csv_path}")
"""

'for sheet in sheets_to_extract:\n    # Read just this sheet into a DataFrame\n    df_excel_1 = pd.read_excel(excel_1, sheet_name=sheet)\n    \n    # Optional: Clean the filename (replace spaces with underscores, etc.)\n    csv_name = sheet.replace(\' \', \'_\').lower() + \'.csv\'\n    csv_path = os.path.join(output_dir, csv_name)\n    \n    # Save the DataFrame as CSV\n    df_excel_1.to_csv(csv_path, index=False)\n    print(f"Saved: {csv_path}")\n'

In [6647]:
xls_2 = pd.ExcelFile('../data/Raw/undesa_pd_2019_world_fertility_dataset.xlsx')
print(xls_2.sheet_names)

['INFORMATION NOTE', 'Database Field Descriptions', 'FERTILITY INDICATORS']

In [6648]:
excel_2 = '../data/Raw/undesa_pd_2019_world_fertility_dataset.xlsx'
sheet_name = 'FERTILITY INDICATORS'
output_dir = '../data/processed/'
os.makedirs(output_dir, exist_ok=True)

df_excel_2 = pd.read_excel(excel_2, sheet_name=sheet_name)

In [6649]:
"""csv_name = sheet_name.replace(' ', '_').lower() + '.csv'
csv_path = os.path.join(output_dir, csv_name)
df_excel_2.to_csv(csv_path, index=False)
print(f"Saved: {csv_path}")
"""

'csv_name = sheet_name.replace(\' \', \'_\').lower() + \'.csv\'\ncsv_path = os.path.join(output_dir, csv_name)\ndf_excel_2.to_csv(csv_path, index=False)\nprint(f"Saved: {csv_path}")\n'

In [6650]:
xls_3 = pd.ExcelFile('../data/Raw/undesa_pd_ds_1970-2030_fp_rev-2024_rev.xlsx')
print(xls_3.sheet_names)

['INFORMATION NOTE', 'Database Field Descriptions', 'Countries', 'Regions']

In [6651]:
excel_3 = '../data/Raw/undesa_pd_ds_1970-2030_fp_rev-2024_rev.xlsx'
sheets_to_extract = ['Countries', 'Regions']
output_dir = '../data/processed/'
os.makedirs(output_dir, exist_ok=True)

In [6652]:
"""
for sheet in sheets_to_extract:
    df = pd.read_excel(excel_3, sheet_name=sheet)
    csv_name = sheet.replace(' ', '_').lower() + '.csv'
    csv_path = os.path.join(output_dir, csv_name)
    df.to_csv(csv_path, index=False)
    print(f"Saved: {csv_path}")

"""

'\nfor sheet in sheets_to_extract:\n    df = pd.read_excel(excel_3, sheet_name=sheet)\n    csv_name = sheet.replace(\' \', \'_\').lower() + \'.csv\'\n    csv_path = os.path.join(output_dir, csv_name)\n    df.to_csv(csv_path, index=False)\n    print(f"Saved: {csv_path}")\n\n'

In [6653]:
df_9 = pd.read_csv('../data/Raw/unpopulation_dataportal_20250728095844.csv')
df_9.sample(5)

,IndicatorId,IndicatorName,IndicatorShortName,Source,SourceYear,Author,LocationId,Location,Iso2,Iso3,...,AgeStart,AgeEnd,Age,CategoryId,Category,EstimateTypeId,EstimateType,EstimateMethodId,EstimateMethod,Value
19036,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,660,Anguilla,AI,AIA,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,3,Projection,40.80
12978,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,440,Lithuania,LT,LTU,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,53.53
14533,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,498,Republic of Moldova,MD,MDA,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,67.80
1876,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,60,Bermuda,BM,BMU,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,51.26
1558,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,51,Armenia,AM,ARM,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,61.99

In [6654]:
df_9.columns = df_9.columns.str.lower() \
    .str.replace(' ', '') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)
df_9.sample(5)

,indicatorid,indicatorname,indicatorshortname,source,sourceyear,author,locationid,location,iso2,iso3,...,agestart,ageend,age,categoryid,category,estimatetypeid,estimatetype,estimatemethodid,estimatemethod,value
17172,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,591,Panama,PA,PAN,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,57.51
11718,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,410,Republic of Korea,KR,KOR,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,57.95
19091,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,662,Saint Lucia,LC,LCA,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,2,Interpolation,52.94
1785,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,56,Belgium,BE,BEL,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,3,Projection,52.00
21328,42,Currently married (Percent),Currently married (Percent),Estimates and Projections of Women of Reproduc...,2024,United Nations Population Division,732,Western Sahara,EH,ESH,...,15,49,15-49,100,Married or in a union women,1,Model-based Estimates,3,Projection,75.39

In [6655]:
df_9 = df_9.drop(columns=['indicatorid','indicatorshortname',
    'source',
    'author', 'locationid', 'iso2','estimatetypeid','category','categoryid','agestart','ageend','author','ageid', 'estimatetype','variantid','sexid','timeid'])

df_9.rename(columns={
    "sourceyear": "year",
    "location": "country",
    "estimatemethodid": "estimate_method",
    "iso3": "code",
}, inplace=True)

In [6656]:
df_9.drop_duplicates(inplace=True)
df_9.dropna(inplace = True)

df_9

,indicatorname,year,country,code,time,variant,sex,age,estimate_method,estimatemethod,value
0,Currently married (Percent),2024,Afghanistan,AFG,1970,Median,Female,15-49,2,Interpolation,80.94
2,Currently married (Percent),2024,Afghanistan,AFG,1971,Median,Female,15-49,2,Interpolation,80.90
4,Currently married (Percent),2024,Afghanistan,AFG,1972,Median,Female,15-49,2,Interpolation,80.87
6,Currently married (Percent),2024,Afghanistan,AFG,1973,Median,Female,15-49,2,Interpolation,80.84
8,Currently married (Percent),2024,Afghanistan,AFG,1974,Median,Female,15-49,2,Interpolation,80.53
...,...,...,...,...,...,...,...,...,...,...,...
25078,Currently married (Percent),2024,Zambia,ZMB,2021,Median,Female,15-49,3,Projection,54.31
25080,Currently married (Percent),2024,Zambia,ZMB,2022,Median,Female,15-49,3,Projection,53.82
25082,Currently married (Percent),2024,Zambia,ZMB,2023,Median,Female,15-49,3,Projection,53.35
25084,Currently married (Percent),2024,Zambia,ZMB,2024,Median,Female,15-49,3,Projection,52.91
25086,Currently married (Percent),2024,Zambia,ZMB,2025,Median,Female,15-49,3,Projection,52.52

In [6657]:
df_info = pd.DataFrame({
    'datatypes': df_9.dtypes,
    'null_count': df_9.isnull().sum(),
    'unique_count': df_9.nunique()
})
print(df_info)

                datatypes  null_count  unique_count
indicatorname      object           0             1
year                int64           0             1
country            object           0           224
code               object           0           224
time                int64           0            56
variant            object           0             1
sex                object           0             1
age                object           0             1
estimate_method     int64           0             2
estimatemethod     object           0             2
value             float64           0          3867

In [6658]:
#df_9.to_csv("cleaned_unpopulation_dataportal.csv", index=False)

In [6659]:
#df_9.to_sql('unpopulation_dataportal', engine, if_exists='replace', index=False)

In [6660]:
df_10 = pd.read_csv('../data/processed/countries_un.csv',  header=5, low_memory=False)

In [6661]:
df_10.columns = (
    df_10.columns
    .str.lower()
    .str.strip()
    .str.replace(' ', '')
    .str.replace('(', '')
    .str.replace(')', '')
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)
)
df_10.sample(10)

,countryorarea,isocode,indicator,year,agegroup,percentage,number,dataprocess
131157,Trinidad and Tobago,780,Married or in-union women,2002,40-44,68.028571,36.361271,Estimate
59013,India,356,Married or in-union women,1975,40-44,85.099143,12090.912172,Estimate
74566,Liechtenstein,438,Married or in-union women,1975,45-49,75.532772,0.448287,Estimate
64144,Côte d'Ivoire,384,Married or in-union women,2050,15-19,6.625496,176.679076,Projection
38924,Eritrea,232,Married or in-union women,1975,35-39,80.100000,33.149385,Estimate
9832,Belgium,56,Married or in-union women,1984,15-19,5.907805,21.576308,Estimate
127902,Tajikistan,762,Married or in-union women,2000,45-49,84.436585,89.024447,Estimate
49479,Gibraltar,292,Married or in-union women,1998,15-49,55.115668,3.591613,Estimate
24676,Chile,152,Married or in-union women,1976,35-39,76.043278,227.016180,Estimate
42702,Finland,246,Married or in-union women,2042,45-49,70.744799,116.601931,Projection

In [6662]:
df_10.rename(columns={
    "dataprocess": "data_process",
    "countryorarea": "country"
}, inplace=True)

df_10.drop_duplicates(inplace=True)
df_10.sample(5)

,country,isocode,indicator,year,agegroup,percentage,number,data_process
42992,France,250,Married or in-union women,1998,15-19,4.147805,80.232524,Estimate
137134,The former Yugoslav Republic of Macedonia,807,Married or in-union women,2020,45-49,87.511786,57.042370,Estimate
44400,French Polynesia,258,Married or in-union women,2012,15-19,18.326982,2.106687,Estimate
2735,Angola,24,Married or in-union women,1987,15-49,65.350685,1577.934114,Estimate
135491,Uganda,800,Married or in-union women,1977,30-34,81.600000,236.818704,Estimate

In [6663]:
for col in ['percentage', 'number']:
    if col in df_10.columns:
        df_10[col] = (
            df_10[col]
            .astype(str)
            .str.replace(',', '.', regex=False)
            .str.extract(r'([-+]?[0-9]*\.?[0-9]+)', expand=False)
            .astype(float)
            .round(2)
        )

In [6664]:
unnamed_cols = [col for col in df_10.columns if 'unnamed' in col.lower()]
df_10.drop(columns=unnamed_cols, inplace=True)

In [6665]:
df_10.dropna(inplace=True)

In [6666]:
df_info = pd.DataFrame({
    'datatypes': df_10.dtypes,
    'null_count': df_10.isnull().sum(),
    'unique_count': df_10.nunique()
})
print(df_info)

             datatypes  null_count  unique_count
country         object           0           225
isocode          int64           0           225
indicator       object           0             1
year             int64           0            81
agegroup        object           0             8
percentage     float64           0          9667
number         float64           0         65394
data_process    object           0             2

In [6667]:
df_10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145800 entries, 0 to 145799
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   country       145800 non-null  object
 1   isocode       145800 non-null  int64
 2   indicator     145800 non-null  object
 3   year          145800 non-null  int64
 4   agegroup      145800 non-null  object
 5   percentage    145800 non-null  float64
 6   number        145800 non-null  float64
 7   data_process  145800 non-null  object
dtypes: float64(2), int64(2), object(4)
memory usage: 8.9+ MB

In [6668]:
#df_10.to_csv("../data/Cleaned/cleaned_countries_1970_2025_un.csv", index=False)

In [6669]:
#df_10.to_sql('countries_1970_2025_un', engine, if_exists='replace', index=False)

In [6670]:
df_11 = pd.read_csv('../data/processed/currently_married_un.csv',  header=2, low_memory=False)

In [6671]:
df_11.sample(8)

,Country or area,ISO code,YearStart,YearEnd,Sex,AgeGroup,AgeStart,AgeEnd,DataValue,DataProcess,DataCatalog ShortName,DataCatalog ID,DataCatalog LongName,Data Source,Including_consensual_unions,Note on Data,Note on Country and Population
28332,Liechtenstein,438,1981,1981,Men,[15-19],15,19,0.27,Estimate,1981 Estimate,2145,Liechtenstein 1981 Estimate,UNSD,NaN,Unrevised data.,NaN
13157,El Salvador,222,1992,1992,Men,[20-24],20,24,33.50,Census,1992 Census,895,El Salvador 1992 Census,UNSD,1.0,NaN,NaN
20636,Hungary,348,2000,2000,Women,[40-44],40,44,71.73,Estimate,2000 Estimate,2120,Hungary 2000 Estimate,UNSD,NaN,NaN,NaN
49030,Timor-Leste,626,2016,2016,Men,[50-54],50,54,93.11,Survey,2016 DHS,6097,Timor-Leste 2016 Demographic and Health Survey,DHS_HH,NaN,NaN,NaN
18003,Greenland,304,1974,1974,Men,[70-74],70,74,65.52,Estimate,1974 Estimate,2109,Greenland 1974 Estimate,UNSD,NaN,NaN,NaN
43107,Seychelles,690,1981,1982,Women,[75+],75,999,14.27,Census,1981-1982 Census Update,5671,Seychelles 1981-1982 Census Update,INED,NaN,NaN,NaN
42209,Sao Tome and Principe,678,2008,2009,Women,[20-24],20,24,62.00,Survey,2008-2009 DHS,2556,Sao Tome and Principe 2008-2009 Demographic an...,DHS_STATcompiler,1.0,NaN,NaN
34337,Netherlands,528,2017,2017,Women,[40-44],40,44,57.14,Estimate,2017 Estimate,2170,Netherlands 2017 Estimate,UNSD,1.0,NaN,NaN

In [6672]:
df_11.columns = (
    df_11.columns
    .str.lower()
    .str.strip()
    .str.replace(' ', '')
    .str.replace('(', '')
    .str.replace(')', '')
    .str.replace('[^0-9a-zA-Z_]','' ,regex= True)
    )
df_11.sample(8)

,countryorarea,isocode,yearstart,yearend,sex,agegroup,agestart,ageend,datavalue,dataprocess,datacatalogshortname,datacatalogid,datacataloglongname,datasource,including_consensual_unions,noteondata,noteoncountryandpopulation
1679,Austria,40,1973,1973,Women,[70-74],70,74,29.99,Estimate,1973 Estimate,2038,Austria 1973 Estimate,UNSD,NaN,NaN,NaN
25219,Italy,380,2018,2018,Women,[70-74],70,74,62.68,Estimate,2018 Estimate,2128,Italy 2018 Estimate,UNSD,1.0,NaN,NaN
18783,Guatemala,320,2014,2015,Men,[20-24],20,24,39.90,Survey,2014-2015 DHS,5790,Guatemala 2014-2015 Demographic and Health Survey,DHS_STATcompiler,1.0,NaN,NaN
53445,Zimbabwe,716,1994,1994,Women,[45-49],45,49,76.40,Survey,1994 DHS,1701,Zimbabwe 1994 Demographic and Health Survey,DHS_STATcompiler,NaN,NaN,NaN
28686,Liechtenstein,438,2007,2007,Men,[70-74],70,74,79.91,Estimate,2007 Estimate,2145,Liechtenstein 2007 Estimate,UNSD,NaN,NaN,NaN
43454,Singapore,702,1970,1970,Men,[50-54],50,54,90.08,Census,1970 Census,1235,Singapore 1970 Census,UNSD,1.0,NaN,NaN
13685,Ethiopia,231,2007,2007,Women,[15-19],15,19,28.66,Census,2007 Census,1011,Ethiopia 2007 Census,UNSD,1.0,NaN,NaN
34739,Nicaragua,558,1995,1995,Women,[35-39],35,39,74.35,Census,1995 Census,1252,Nicaragua 1995 Census,National statistics,1.0,NaN,NaN

In [6673]:
df_11 = df_11.drop(columns = ['datacataloglongname', 'datacatalogid', 'yearstart' , 'yearend', 'noteondata', 'noteoncountryandpopulation', 'including_consensual_unions'])

df_11.rename(columns={
    "agestart": "age_start",
    "countryorarea": "country",
    "datasource": "data_source",
    "datavalue" : "data_value"
}, inplace=True)

df_11.sample(10)

,country,isocode,sex,agegroup,age_start,ageend,data_value,dataprocess,datacatalogshortname,data_source
7547,Chile,152,Women,[65+],65,999,29.22,Estimate,1978 Estimate,UNSD
43801,Slovakia,703,Men,[55-59],55,59,79.81,Estimate,2008 Estimate,UNSD
3770,Bermuda,60,Women,[20-24],20,24,24.83,Census,1980 Census,UNSD
39289,Republic of Korea,410,Women,[70-74],70,74,46.26,Census,2010 Census,UNSD
48160,Switzerland,756,Men,[55-59],55,59,74.45,Estimate,2009 Estimate,UNSD
846,Armenia,51,Men,[50+],50,999,87.94,Census,2001 Census,UNSD
35850,Norway,578,Women,[55-59],55,59,75.61,Estimate,1983 Estimate,UNSD
36936,Pakistan,586,Men,[60+],60,999,80.91,Estimate,1997 Estimate,UNSD
23226,Iraq,368,Women,[75+],75,999,27.85,Census,1977 Census,UNSD
2960,Barbados,52,Men,[70-74],70,74,60.29,Census,2010 Census,UNSD

In [6674]:
df_11.drop_duplicates(inplace=True)
df_11.dropna(inplace=True)

In [6675]:
df_info = pd.DataFrame({
    'datatypes': df_11.dtypes,
    'null_count': df_11.isnull().sum(),
    'unique_count': df_11.nunique()
})
print(df_info)

                     datatypes  null_count  unique_count
country                 object           0           233
isocode                  int64           0           230
sex                     object           0             2
agegroup                object           0            23
age_start                int64           0            17
ageend                   int64           0            15
data_value             float64           0          9213
dataprocess             object           0             6
datacatalogshortname    object           0           412
data_source             object           0            15

In [6676]:
#df_11.to_csv("cleaned_currently_married_un.csv", index=False)

In [6677]:
#df_11.to_sql('currently_married_un', engine, if_exists='replace', index=False)

In [6678]:
df_12 = pd.read_csv('../data/processed/ever_married_un.csv', header= 2, low_memory = False)
df_12.head()

,Country or area,ISO code,YearStart,YearEnd,Sex,AgeGroup,AgeStart,AgeEnd,DataValue,DataProcess,DataCatalog ShortName,DataCatalog ID,DataCatalog LongName,Data Source,Including_consensual_unions,Note on Data,Note on Country and Population
0,Afghanistan,4,1972,1974,Men,[15-19],15,19,7.7,Survey,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN
1,Afghanistan,4,1972,1974,Men,[20-24],20,24,32.6,Survey,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN
2,Afghanistan,4,1972,1974,Men,[25-29],25,29,61.4,Survey,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN
3,Afghanistan,4,1972,1974,Men,[30-34],30,34,83.0,Survey,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN
4,Afghanistan,4,1972,1974,Men,[35-39],35,39,91.2,Survey,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN

In [6679]:
df_12.columns = (
    df_12.columns
    .str.lower()
    .str.strip()
    .str.replace(' ', '')
    .str.replace('(', '')
    .str.replace(')', '')
    .str.replace('[^0-9a-zA-Z_]','' ,regex= True)
    )
df_12.sample(8)

,countryorarea,isocode,yearstart,yearend,sex,agegroup,agestart,ageend,datavalue,dataprocess,datacatalogshortname,datacatalogid,datacataloglongname,datasource,including_consensual_unions,noteondata,noteoncountryandpopulation
4948,Bulgaria,100,2007,2007,Women,[30-34],30,34,83.69,Survey,2007 GGS,5429,Bulgaria 2007 Generations and Gender Survey Wa...,GGS,1.0,NaN,NaN
43950,San Marino,674,1997,1997,Women,[45-49],45,49,94.92,Estimate,1997 Estimate,2208,San Marino 1997 Estimate,UNSD,NaN,NaN,NaN
23506,Iceland,352,2016,2016,Women,[35-39],35,39,80.18,Estimate,2016 Estimate,2121,Iceland 2016 Estimate,UNSD,1.0,NaN,NaN
21116,Hungary,348,1972,1972,Men,[25-29],25,29,78.23,Estimate,1972 Estimate,2120,Hungary 1972 Estimate,UNSD,NaN,NaN,NaN
29469,Lesotho,426,2009,2010,Men,[55-59],55,59,95.30,Survey,2009 DHS,4947,Lesotho 2009 Demographic and Health Survey,DHS_STATcompiler,1.0,NaN,NaN
37602,Norway,578,1974,1974,Women,[45-49],45,49,93.29,Estimate,1974 Estimate,2180,Norway 1974 Estimate,UNSD,NaN,NaN,NaN
19242,Greenland,304,1984,1984,Men,[20-24],20,24,3.34,Estimate,1984 Estimate,2109,Greenland 1984 Estimate,UNSD,NaN,NaN,NaN
13979,Egypt,818,2008,2008,Men,[75+],75,999,99.50,Survey,2008 DHS,4685,Egypt 2008 Demographic and Health Survey,DHS_HH,NaN,NaN,NaN

In [6680]:
df_12 = df_12.drop(columns = ['yearstart', 'yearend', 'datacatalogshortname', 'datacatalogid', 'datacataloglongname', 'including_consensual_unions', 'noteondata', 'noteoncountryandpopulation'])

df_12.rename(columns={
    "agestart": "age_start",
    "ageend": "age_end",
    "countryorarea": "country"
}, inplace=True)
df_12.sample(8)

,country,isocode,sex,agegroup,age_start,age_end,datavalue,dataprocess,datasource
28655,Latvia,428,Men,[45-49],45,49,93.34,Census,UNSD
34654,Namibia,516,Women,[30-34],30,34,54.20,Survey,DHS_HH
33103,Mexico,484,Men,[30-34],30,34,79.55,Census,UNSD
22190,Hungary,348,Men,[75+],75,999,96.24,Estimate,UNSD
3159,Belgium,56,Women,[65-69],65,69,91.91,Census,UNSD
7332,Canada,124,Men,[30-34],30,34,63.44,Estimate,UNSD
2797,Bangladesh,50,Women,[60-64],60,64,100.00,Survey,DHS_HH
47276,South Sudan,728,Women,[20-24],20,24,70.34,Census,US Census Bureau

In [6681]:
df_12.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_12.dtypes,
    'null_count': df_12.isnull().sum(),
    'unique_count': df_12.nunique()
})
print(df_info)

            datatypes  null_count  unique_count
country        object           0           233
isocode         int64           0           230
sex            object           0             2
agegroup       object           0            23
age_start       int64           0            17
age_end         int64           0            15
datavalue     float64           0          8396
dataprocess    object           0             6
datasource     object           0            15

In [6682]:
#df_12.to_csv("cleaned_ever_married_un.csv", index=False)

In [6683]:
#df_12.to_sql('ever_married_un', engine, if_exists= 'replace', index= False)

In [6684]:
df_13 = pd.read_csv('../data/processed/fertility_indicators_un.csv', header=6, low_memory=False)
df_13.head()

,Country or Area,Country or Area Code,Age Group,Indicator,Date,Value,Series,DataType,Data Source Type,Survey Programme,Data Source Inventory ID,Data Source Name,Data Source Name (short),Data Source Start Year,Data Source End Year,Reference,Reference Year
0,Afghanistan,4,[Total],TFR,1964.977051,7.966653,"1979 Census,Reverse survival methods,Computed",Reverse survival method,Census,Census,280,Afghanistan 1979 Census,1979 Census,1979,1979,United Nations Population Division,2012
1,Afghanistan,4,[Total],TFR,1965.977051,8.212275,"1979 Census,Reverse survival methods,Computed",Reverse survival method,Census,Census,280,Afghanistan 1979 Census,1979 Census,1979,1979,United Nations Population Division,2012
2,Afghanistan,4,[Total],TFR,1966.977051,8.317603,"1979 Census,Reverse survival methods,Computed",Reverse survival method,Census,Census,280,Afghanistan 1979 Census,1979 Census,1979,1979,United Nations Population Division,2012
3,Afghanistan,4,[Total],TFR,1967.977051,8.225812,"1979 Census,Reverse survival methods,Computed",Reverse survival method,Census,Census,280,Afghanistan 1979 Census,1979 Census,1979,1979,United Nations Population Division,2012
4,Afghanistan,4,[Total],TFR,1968.977051,8.068459,"1979 Census,Reverse survival methods,Computed",Reverse survival method,Census,Census,280,Afghanistan 1979 Census,1979 Census,1979,1979,United Nations Population Division,2012

In [6685]:
df_13.columns = (df_13.columns
        .str.lower()
        .str.strip()
        .str.replace(' ', '')
        .str.replace('(', '')
        .str.replace(')', '')
        .str.replace('[^0-9a-zA-Z_]','' ,regex= True)
        )

df_13.sample(6)

,countryorarea,countryorareacode,agegroup,indicator,date,value,series,datatype,datasourcetype,surveyprogramme,datasourceinventoryid,datasourcename,datasourcenameshort,datasourcestartyear,datasourceendyear,reference,referenceyear
1964,Argentina,32,[Total],TFR,2000.500000,2.35000,"Estimates,Direct,DYB,2036-16-58",Direct,Estimate,Estimate,2036,All sources of estimates,Estimates,2000,2000,Demographic Yearbook,2005
66327,Sri Lanka,144,[40-44],ASFR4044,1984.500000,23.09000,"Register,Computed rate from reported ASFR,Report",Computed rate from reported ASFR,Register,VR,444,Vital Registration,Register,1984,1984,Sri Lanka NSO (Escap country monograph),
71267,Trinidad and Tobago,780,[Total],MAC,1989.500000,27.25932,"Register,Computed rate from DYB,DYB,567-135-43",Computed rate from DYB,Register,VR,567,Vital Registration,Register,1989,1989,Demographic Yearbook,1990
17283,Costa Rica,188,[45-49],ASFR4549,1975.501370,8.00000,"Estimates, Fertility data (adjusted), Rosero-B...",Fertility data (adjusted),Estimate,Estimate,2075,All sources of estimates,Estimates,1975,1975,"La situación demográfica en Costa Rica, Poblac...",2033
35241,Iran (Islamic Republic of),364,[35-39],ASFR3539,1985.500000,182.40000,"1996 Census,Own-children estimate,Article",Own-children method,Census,Census,1197,Iran (Islamic Republic of) 1996 Census,1996 Census,1996,1996,Islamic Republic of Iran Management and Plann...,2001
48847,Mozambique,508,[35-39],ASFR3539,1991.250171,172.79770,"2008 MICS,Birth Histories (Extrapolated),FBH a...",Extrapolated from Truncated Birth Histories,Survey,MICS,4871,Mozambique 2008 Multiple Indicator Cluster Survey,2008 MICS,2008,2008,Fertility rates from full birth histories anal...,2018

In [6686]:
df_13 = df_13.drop(columns=['countryorareacode','indicator','datasourceinventoryid','surveyprogramme','series','datasourcename','reference','referenceyear'])

df_13 = df_13.rename(columns={
    "agegroup": "age_group",
    "countryorarea": "country",
    "datatype": "data_type"
})

In [6687]:
df_13.head()

,country,age_group,date,value,data_type,datasourcetype,datasourcenameshort,datasourcestartyear,datasourceendyear
0,Afghanistan,[Total],1964.977051,7.966653,Reverse survival method,Census,1979 Census,1979,1979
1,Afghanistan,[Total],1965.977051,8.212275,Reverse survival method,Census,1979 Census,1979,1979
2,Afghanistan,[Total],1966.977051,8.317603,Reverse survival method,Census,1979 Census,1979,1979
3,Afghanistan,[Total],1967.977051,8.225812,Reverse survival method,Census,1979 Census,1979,1979
4,Afghanistan,[Total],1968.977051,8.068459,Reverse survival method,Census,1979 Census,1979,1979

In [6688]:
df_13['date'] = df_13['date'].astype(int)
df_13['value'] = df_13['value'].round(2)
df_13.sample(12)

,country,age_group,date,value,data_type,datasourcetype,datasourcenameshort,datasourcestartyear,datasourceendyear
44600,Malaysia,[Total],1969,5.10,Direct,Register,Register,1969,1969
37671,Jamaica,[15-19],1992,107.00,Recent births,Survey,1993 CPS,1993,1993
38914,Jordan,[20-24],2016,109.00,Birth histories,Survey,2017-2018 DHS,2017,2018
59001,Romania,[Total],1984,2.19,Official estimates,Estimate,Estimates,1984,1984
68462,Syrian Arab Republic,[Total],1970,7.68,Recent births,Census,1970 Census,1970,1970
66219,Sri Lanka,[25-29],1974,215.00,Direct,Survey,1987 DHS,1987,1987
68076,Switzerland,[35-39],1977,21.37,Official estimates,Estimate,Estimates,1977,1977
71631,Tunisia,[35-39],1987,129.76,Birth histories,Survey,1994-1995 MCHS,1994,1995
46260,Mauritania,[30-34],1964,218.30,Recent births,Survey,1964-1965 PS,1964,1965
74731,United Republic of Tanzania,[25-29],2013,235.00,Direct,Survey,2015-2016 DHS,2015,2016
38732,Jordan,[45-49],1992,4.26,Extrapolated from Truncated Birth Histories,Survey,2009 DHS Interim,2009,2009
30172,Guam,[Total],1973,3.38,Fertility data (adjusted),Census,1980 Census,1980,1980

In [6689]:
df_13.drop_duplicates(inplace=True)
df_13.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_13.dtypes,
    'null_count': df_13.isnull().sum(),
    'unique_count': df_13.nunique()
})
print(df_info)

                    datatypes  null_count  unique_count
country                object           0           201
age_group              object           0             8
date                    int32           0            69
value                 float64           0         18752
data_type              object           0            30
datasourcetype         object           0             7
datasourcenameshort    object           0           539
datasourcestartyear     int64           0            69
datasourceendyear      object           0            70

In [6690]:
#df_13.to_csv("../data/Cleaned/cleaned_fertility_indicators_un.csv", index=False)

In [6691]:
#df_13.to_sql('fertility_indicators_un',engine, if_exists='replace', index=False)

In [6692]:
df_14 = pd.read_csv('../data/processed/marital_status_by_age_un.csv', header= 2, low_memory=False)
df_14.head()

,Country or area,ISO code,YearStart,YearEnd,Sex,MaritalStatus,Non-standard_AgeGroups,Series_contains_Non-standard_AgeGroups,AgeGroup,AgeStart,...,DataCatalog ShortName,DataCatalog ID,DataCatalog LongName,Data Source,Including_consensual_unions,Note on Age groups,Note on Marital Status,Note on Data,Note on Country and Population,Note Other
0,Afghanistan,4,1972,1974,Men,Divorced,NaN,NaN,[15-19],15,...,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,4,1972,1974,Men,Divorced,NaN,NaN,[20-24],20,...,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,4,1972,1974,Men,Divorced,NaN,NaN,[25-29],25,...,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,4,1972,1974,Men,Divorced,NaN,NaN,[30-34],30,...,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN,NaN,NaN,NaN
4,Afghanistan,4,1972,1974,Men,Divorced,NaN,NaN,[35-39],35,...,1972-1974 NDFGS,160,Afghanistan 1972-1974 National Demographic and...,National statistics,NaN,NaN,NaN,NaN,NaN,NaN

In [6693]:
df_14.columns= (df_14.columns
    .str.lower()
    .str.strip()
    .str.replace(' ', '')
    .str.replace('(', '')
    .str.replace(')', '')
    .str.replace('[^0-9a-zA-Z_]', '' , regex=True)  
    )
df_14.sample(5)

,countryorarea,isocode,yearstart,yearend,sex,maritalstatus,nonstandard_agegroups,series_contains_nonstandard_agegroups,agegroup,agestart,...,datacatalogshortname,datacatalogid,datacataloglongname,datasource,including_consensual_unions,noteonagegroups,noteonmaritalstatus,noteondata,noteoncountryandpopulation,noteother
94222,Greenland,304,1983,1983,Men,Married or married but separated,NaN,NaN,[70-74],70,...,1983 Estimate,2109,Greenland 1983 Estimate,UNSD,NaN,NaN,NaN,NaN,NaN,NaN
197493,Portugal,620,1991,1991,Women,Single,NaN,NaN,[70-74],70,...,1991 Census,1067,Portugal 1991 Census,UNSD,NaN,NaN,NaN,NaN,NaN,NaN
124112,Israel,376,1993,1993,Women,Single,NaN,NaN,[40-44],40,...,1993 Estimate,2127,Israel 1993 Estimate,UNSD,NaN,Totals may not add up to the sum of the respec...,NaN,NaN,Including data for East Jerusalem and Israeli ...,NaN
223974,Slovenia,705,2011,2011,Women,Divorced,NaN,NaN,[75+],75,...,2011 Estimate,2218,Slovenia 2011 Estimate,UNSD,NaN,NaN,Including same sex marriages.,NaN,NaN,NaN
118406,Indonesia,360,2012,2012,Women,Widowed,NaN,NaN,[60-64],60,...,2012 DHS Special,5458,Indonesia 2012 Demographic and Health Survey (...,DHS_HH,NaN,NaN,NaN,NaN,NaN,NaN

In [6694]:
df_14 = df_14.drop(columns=['datacataloglongname', 'noteondata', 'noteoncountryandpopulation','noteonagegroups', 'noteother',
                             'including_consensual_unions','isocode', 'datacatalogid', 'noteonmaritalstatus', 'series_contains_nonstandard_agegroups','nonstandard_agegroups'])

df_14.rename(columns={
    "countryorarea": "country",
    "agegroup": "age_group",
    "maritalstatus": "marital_status",
    "yearstart": "year_start",
    "yearend": "year_end",
    }, inplace =True
    )

df_14.sample(10)

,country,year_start,year_end,sex,marital_status,age_group,agestart,ageend,datavalue,dataprocess,datacatalogshortname,datasource
221345,Slovakia,2009,2009,Women,Divorced,[30-34],30,34,8.27,Estimate,2009 Estimate,UNSD
21437,Botswana,1971,1971,Women,Married,[15-19],15,19,8.45,Census,1971 Census,UNSD
157561,Mauritius,1990,1990,Women,Married,[55-59],55,59,58.79,Census,1990 Census,UNSD
167689,Nepal,1976,1976,Women,Widowed,[30-34],30,34,3.80,Survey,1976 WFS,National statistics
95924,Greenland,2011,2011,Women,Divorced,[75+],75,999,5.08,Estimate,2011 Estimate,UNSD
267796,Yemen,1991,1992,Men,Never married,[65-69],65,69,0.60,Survey,1991-1992 DHS,DHS_HH
123429,Israel,1979,1979,Men,Ever married,[55-64],55,64,97.31,Estimate,1979 Estimate,UNSD
98322,Guatemala,2014,2015,Women,Divorced,[70-74],70,74,8.03,Survey,2014-2015 DHS,DHS_HH
35244,Canada,2001,2001,Women,Single,[40-44],40,44,12.98,Estimate,2001 Estimate,UNSD
85253,French Guiana,1990,1990,Men,Single,[60-74],60,74,46.99,Census,1990 Census,UNSD

In [6695]:
df_14.drop_duplicates(inplace=True)
df_14.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_14.dtypes,
    'null_count': df_14.isnull().sum(),
    'unique_count': df_14.nunique()
})
print(df_info)

                     datatypes  null_count  unique_count
country                 object           0           235
year_start               int64           0            62
year_end                 int64           0            60
sex                     object           0             2
marital_status          object           0            35
age_group               object           0            63
agestart                 int64           0            21
ageend                   int64           0            20
datavalue              float64           0          9994
dataprocess             object           0             6
datacatalogshortname    object           0           443
datasource              object           0            15

In [6696]:
#df_14.to_csv("cleaned_marital_status_by_age_un.csv", index=False)

In [6697]:
#df_14.to_sql('marital_status_by_age_un', engine, if_exists='replace', index=False)

In [6698]:
df_15 = pd.read_csv('../data/processed/regions_un.csv', header=5, low_memory= False)
df_15.head(10)

,Region and subregion,ISO code,Regional Classification,Indicator,Year,AgeGroup,Percentage,Number,DataProcess
0,World,900,M49,Married or in-union women,1970,15-19,22.576683,7.186782e+04,Estimate
1,World,900,M49,Married or in-union women,1970,20-24,63.802057,1.628604e+05,Estimate
2,World,900,M49,Married or in-union women,1970,25-29,87.174827,1.826811e+05,Estimate
3,World,900,M49,Married or in-union women,1970,30-34,90.825027,1.791214e+05,Estimate
4,World,900,M49,Married or in-union women,1970,35-39,90.284386,1.615263e+05,Estimate
5,World,900,M49,Married or in-union women,1970,40-44,86.483531,1.393344e+05,Estimate
6,World,900,M49,Married or in-union women,1970,45-49,82.680237,1.160884e+05,Estimate
7,World,900,M49,Married or in-union women,1970,15-49,69.379111,1.013480e+06,Estimate
8,World,900,M49,Married or in-union women,1971,15-19,22.630416,7.412762e+04,Estimate
9,World,900,M49,Married or in-union women,1971,20-24,63.613178,1.700873e+05,Estimate

In [6699]:
df_15.columns = (df_15.columns
    .str.lower()
    .str.strip()
    .str.replace(' ', '')
    .str.replace('(','')
    .str.replace(')', '')
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)
    )
df_15.sample(6)

,regionandsubregion,isocode,regionalclassification,indicator,year,agegroup,percentage,number,dataprocess
7707,Southern Africa,913,M49,Married or in-union women,2042,30-34,36.024677,2412.380252,Projection
16314,Caribbean,915,SDG-M49,Married or in-union women,1984,25-29,70.777275,1771.109297,Estimate
3490,Oceania excluding Australia and New Zealand,543,SDG,Married or in-union women,2001,25-29,80.114093,571.925695,Estimate
1023,Sub-Saharan Africa,202,SDG,Married or in-union women,2016,15-49,60.831095,307304.309907,Estimate
14074,Northern Europe,924,SDG-M49,Married or in-union women,2028,25-29,44.752899,1460.344814,Projection
27169,Upper-middle-income countries,1502,Income group,Married or in-union women,2045,20-24,17.879021,20299.785110,Projection

In [6700]:
df_15 = df_15.drop(columns=['regionalclassification'])

df_15.rename(columns={
    "regionandsubregion": "region",
    "isocode": "iso_code",
    "agegroup": "age_group",
    "dataprocess": "process"
}, inplace=True)

df_15.sample(10)

,region,iso_code,indicator,year,age_group,percentage,number,process
19703,Australia and New Zealand,1834,Married or in-union women,1986,30-34,78.437735,599.508626,Estimate
1645,Northern Africa and Western Asia,747,Married or in-union women,2013,40-44,83.468610,22099.351920,Estimate
3007,Eastern and South-Eastern Asia,753,Married or in-union women,2021,15-49,66.557902,724696.769833,Estimate
22028,Micronesia,954,Married or in-union women,2050,35-39,63.687391,27.265846,Projection
11413,Western Asia,922,Married or in-union women,2019,40-44,83.014566,14075.210114,Estimate
16442,Caribbean,915,Married or in-union women,2000,25-29,66.751272,2112.987484,Estimate
3716,Oceania excluding Australia and New Zealand,543,Married or in-union women,2029,35-39,80.481909,833.279909,Projection
15719,Latin America and the Caribbean,904,Married or in-union women,1990,15-49,57.715166,129474.507994,Estimate
1337,Northern Africa and Western Asia,747,Married or in-union women,1975,20-24,66.959612,10891.801810,Estimate
22160,Polynesia,957,Married or in-union women,1986,15-19,10.544355,6.533071,Estimate

In [6701]:
print(df_15['number'] % 1 != 0)

0        True
1        True
2        True
3        True
4        True
         ...
28507    True
28508    True
28509    True
28510    True
28511    True
Name: number, Length: 28512, dtype: bool

In [6702]:
df_15['percentage'] = df_15['percentage'].round(2)
df_15['number'] = df_15['number'].astype(int)
df_15.head(10)

,region,iso_code,indicator,year,age_group,percentage,number,process
0,World,900,Married or in-union women,1970,15-19,22.58,71867,Estimate
1,World,900,Married or in-union women,1970,20-24,63.80,162860,Estimate
2,World,900,Married or in-union women,1970,25-29,87.17,182681,Estimate
3,World,900,Married or in-union women,1970,30-34,90.83,179121,Estimate
4,World,900,Married or in-union women,1970,35-39,90.28,161526,Estimate
5,World,900,Married or in-union women,1970,40-44,86.48,139334,Estimate
6,World,900,Married or in-union women,1970,45-49,82.68,116088,Estimate
7,World,900,Married or in-union women,1970,15-49,69.38,1013479,Estimate
8,World,900,Married or in-union women,1971,15-19,22.63,74127,Estimate
9,World,900,Married or in-union women,1971,20-24,63.61,170087,Estimate

In [6703]:
df_15.dropna(inplace=True)
df_15.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_15.dtypes,
    'null_count': df_15.isnull().sum(),
    'unique_count': df_15.nunique()
})
print(df_info)

           datatypes  null_count  unique_count
region        object           0            43
iso_code       int64           0            44
indicator     object           0             1
year           int64           0            81
age_group     object           0             8
percentage   float64           0          7796
number         int32           0         20311
process       object           0             2

In [6704]:
#df_15.to_csv('cleaned_regions_un.csv', index=False)

In [6705]:
#df_15.to_sql('regions_un', engine, if_exists='replace',index=False)

In [6706]:
df_16_1 = pd.read_csv('../data/Raw/OECD/SF_1_1_Family_size_and_composition_S1.csv')
df_16_1
#Data for Chart SF1.1.A. Average size of households by household type, 2024a
# avg_size_all	avg_size_couple_with_children	avg_size_single_parent_with_children

,Country,All households,Couple households with children,Single parent households with children
0,Mexico,"3,56","4,08","2,76"
1,Costa Rica,"3,46","4,37","3,44"
2,Türkiye,"3,20","4,10","2,80"
3,Israel,"3,19","4,65","2,86"
4,Columbia,"3,10",NaN,NaN
5,Slovak Republic,"3,10","3,80","2,50"
6,Chile,"2,80",NaN,NaN
7,Iceland,"2,70","4,12","2,61"
8,New Zealand,"2,61","3,88","2,67"
9,Greece,"2,60","3,80","2,50"
10,Croatia,"2,60","3,90","2,60"
11,Australia,"2,53","3,93","2,78"
12,United States,"2,51",NaN,NaN
13,Spain,"2,50","3,70","2,40"
14,Cyprus,"2,50","3,70","2,40"
15,Malta,"2,50","3,70","2,50"
16,Romania,"2,50","3,80","2,40"
17,Canada,"2,43",NaN,NaN
18,Ireland,"2,40","4,00","2,70"
19,Portugal,"2,40","3,50","2,40"
20,Slovenia,"2,40","3,90","2,50"
21,OECD average,"2,39",NaN,NaN
22,Czechia,"2,30","3,70","2,40"
23,Hungary,"2,30","3,70","2,40"
24,Luxembourg,"2,30","3,70","2,50"
25,Poland,"2,30","3,70","2,50"
26,United Kingdom,"2,30","3,90","2,80"
27,EU average,"2,26",NaN,NaN
28,Switzerland,"2,21","4,02","2,58"
29,Korea,"2,21","3,55","2,34"
30,Japan,"2,21","3,85","2,73"
31,Austria,"2,20","3,80","2,50"
32,Belgium,"2,20","3,90","2,60"
33,Italy,"2,20","3,60","2,40"
34,Bulgaria,"2,20","3,50","2,30"
35,France,"2,10","3,90","2,60"
36,Latvia,"2,10","3,70","2,50"
37,Sweden,"2,10","3,90","2,60"
38,Germany,"2,00","3,80","2,50"
39,Netherlands,"2,00","3,90","2,60"
40,Norway,"2,00","3,90","2,40"
41,Denmark,"1,90","3,90","2,50"
42,Finland,"1,90","4,00","2,60"
43,Estonia,"1,80","3,80","2,60"
44,Lithuania,"1,70","3,70","2,40"

In [6707]:
df_16_1.columns = df_16_1.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6708]:
df_16_1.rename(columns={
        "All households": "avg_size_all",
        "Couple with children": "avg_size_couple_with_children",
        "Single parent with children": "avg_size_single_parent_with_children"
}, inplace=True)

In [6709]:
df_16_1.drop_duplicates(inplace=True)
df_16_1.dropna(inplace=True)

In [6710]:
for col in df_16_1.columns:
    if col != 'country':
        # Replace commas with dots if necessary, remove non-numeric chars, convert to float
        df_16_1[col] = (
            df_16_1[col]
            .astype(str)  # ensure string for replace
            .str.replace(',', '.', regex=False)  # decimal commas to dots
            .str.replace(r'[^\d\.\-]', '', regex=True)  # remove non-numeric chars except dot and minus
            .replace('', None)  # empty to NaN
            .astype(float)  # convert to float
        )

# Check updated dtypes
print(df_16_1.dtypes)

country                                    object
all_households                            float64
couple_households_with_children           float64
single_parent_households_with_children    float64
dtype: object

In [6711]:
info_16_1 = pd.DataFrame({
    'dtype': df_16_1.dtypes,
    'null_count': df_16_1.isnull().sum(),
    'unique_count': df_16_1.nunique()
})
print(info_16_1)

                                          dtype  null_count  unique_count
country                                  object           0            39
all_households                          float64           0            19
couple_households_with_children         float64           0            16
single_parent_households_with_children  float64           0            15

In [6712]:
if "year" not in df_16_1.columns:
    df_16_1["year"] = 2024
df_16_1['source'] = 'OECD'
df_16_1.sample(10)

,country,all_households,couple_households_with_children,single_parent_households_with_children,year,source
36,Latvia,2.10,3.70,2.50,2024,OECD
44,Lithuania,1.70,3.70,2.40,2024,OECD
24,Luxembourg,2.30,3.70,2.50,2024,OECD
35,France,2.10,3.90,2.60,2024,OECD
25,Poland,2.30,3.70,2.50,2024,OECD
37,Sweden,2.10,3.90,2.60,2024,OECD
30,Japan,2.21,3.85,2.73,2024,OECD
42,Finland,1.90,4.00,2.60,2024,OECD
38,Germany,2.00,3.80,2.50,2024,OECD
1,Costa Rica,3.46,4.37,3.44,2024,OECD

In [6713]:
df_16_1.to_csv('../data/Cleaned/cleaned_average_size_of_households_type_2024_oecd.csv', index=False)

In [6714]:
df_16_1.to_sql('average_size_of_households_type_2024_oecd', engine, if_exists = 'replace', index= False)

39

In [6715]:
df_16_2 = pd.read_csv('../data/Raw/OECD/SF_1_1_Family_size_and_composition_S2.csv', header=1)
df_16_2.head(10)
#Table SF1.1.A. Types of household, 2021a
# share_couple_total	share_couple_with_children	share_couple_without_children	share_single_parent_total	share_single_mother	share_single_father	share_single_person	share_other_types

,Country,Total,With children,Without children,Total.1,Single mother households,Single father households,Single person households,Other households types
0,Australia,"55,93","29,90","26,02","10,37",NaN,NaN,"25,12","8,58"
1,Austria,"48,93","21,13","27,80","5,63","4,78","0,85","38,34","7,11"
2,Belgium,"52,22","23,98","28,24","7,42","6,08","1,35","35,50","4,86"
3,Canada,"50,92","25,30","25,62","8,72",NaN,NaN,"29,35","11,02"
4,Chile,..,..,..,..,..,..,..,..
5,Columbia,..,..,..,..,..,..,..,..
6,Costa Rica,"52,44","38,15","14,29","10,55","9,49","1,06","11,27","25,74"
7,Czechia,"47,03","21,70","25,32","7,15","6,11","1,04","39,15","6,67"
8,Denmark,"48,60","20,41","28,19","6,31","5,11","1,19","37,57","7,52"
9,Estonia,"46,20","25,46","20,73","6,83","6,09","0,74","36,99","9,98"

In [6716]:
# Normalize column names (lowercase, underscores, remove () and non-ascii)
df_16_2.columns = (
    df_16_2.columns.str.strip().str.lower()
    .str.replace(' ', '_')
    .str.replace('[()%]', '', regex=True)
    .str.replace('[^0-9a-z_]', '', regex=True)
)

In [6717]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_16_2.columns if c != "country"]

df_16_2[num_cols] = (
    df_16_2[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)
df_16_2.sample(10)

,country,total,with_children,without_children,total1,single_mother_households,single_father_households,single_person_households,other_households_types
17,Israel,64.50,45.80,18.70,9.10,NaN,NaN,26.40,NaN
43,Romania,45.66,20.73,24.93,6.50,4.56,1.94,33.63,14.21
44,EU average,47.97,22.09,25.88,6.71,5.53,1.18,34.00,11.32
6,Costa Rica,52.44,38.15,14.29,10.55,9.49,1.06,11.27,25.74
19,Japan,45.07,15.67,29.40,2.50,2.26,0.25,37.97,14.45
20,Korea,43.48,26.25,17.23,9.13,6.85,2.28,35.47,11.93
0,Australia,55.93,29.90,26.02,10.37,NaN,NaN,25.12,8.58
41,Cyprus,56.92,27.42,29.50,6.17,4.94,1.23,24.49,12.43
28,Poland,48.32,23.92,24.40,5.97,5.15,0.82,23.44,22.27
38,OECD-36 average,49.05,NaN,NaN,7.38,NaN,NaN,32.11,11.46

In [6718]:
df_16_2.drop(columns=["total", "total1"], errors="ignore", inplace=True)

In [6719]:
df_16_2.drop_duplicates(inplace=True)
df_16_2.dropna(inplace=True)

In [6720]:
df_16_2['unit'] = '%'
df_16_2['source'] = 'OECD'

In [6721]:
if "year" not in df_16_2.columns:
    df_16_2["year"] = 2021
df_16_2.sample(10)

,country,with_children,without_children,single_mother_households,single_father_households,single_person_households,other_households_types,unit,source,year
16,Ireland,29.45,23.58,6.12,0.80,23.14,16.91,%,OECD,2021
42,Malta,21.11,25.81,4.56,1.12,32.51,14.89,%,OECD,2021
7,Czechia,21.70,25.32,6.11,1.04,39.15,6.67,%,OECD,2021
25,Netherlands,23.01,30.59,5.00,1.09,38.50,1.80,%,OECD,2021
34,Switzerland,24.05,29.72,3.88,0.82,36.88,4.65,%,OECD,2021
41,Cyprus,27.42,29.50,4.94,1.23,24.49,12.43,%,OECD,2021
8,Denmark,20.41,28.19,5.11,1.19,37.57,7.52,%,OECD,2021
33,Sweden,22.49,26.78,4.91,1.76,39.24,4.82,%,OECD,2021
21,Latvia,12.21,15.60,11.21,2.23,41.08,17.68,%,OECD,2021
28,Poland,23.92,24.40,5.15,0.82,23.44,22.27,%,OECD,2021

In [6722]:
info_16_2 = pd.DataFrame({
    "dtype": df_16_2.dtypes,
    "null_count": df_16_2.isna().sum(),
    "unique_count": df_16_2.nunique()
})
print(info_16_2)
print(df_16_2.dtypes)

                            dtype  null_count  unique_count
country                    object           0            36
with_children             float64           0            35
without_children          float64           0            36
single_mother_households  float64           0            32
single_father_households  float64           0            31
single_person_households  float64           0            35
other_households_types    float64           0            36
unit                       object           0             1
source                     object           0             1
year                        int64           0             1
country                      object
with_children               float64
without_children            float64
single_mother_households    float64
single_father_households    float64
single_person_households    float64
other_households_types      float64
unit                         object
source                       object
year                          int64
dtype: object

In [6723]:
#df_16_2.to_csv('../data/Cleaned/cleaned_types_of_household_2021_oecd.csv', index = False)

In [6724]:
#df_16_2.to_sql('types_of_household_2021_oecd', engine, if_exists = 'replace', index= False)

In [6725]:
df_16_3 = pd.read_csv('../data/Raw/OECD/SF_1_1_Family_size_and_composition_S3.csv', header=1)
df_16_3
#Table SF1.1.B. Households by number of children, 2024
# share_hh_0_children	share_hh_1_child	share_hh_2_children	share_hh_3plus_children

,country,0 children,1 child,2 children,3 or more children,Children under 6
0,Australia,..,..,..,..,..
1,Austria,"77,78","10,52","8,57","3,12","9,44"
2,Belgium,"73,97","11,76","10,15","4,11","10,40"
3,Canada,..,..,..,..,..
4,Chile,..,..,..,..,..
5,Columbia,..,..,..,..,..
6,Costa Rica,"30,29","23,08","24,61","22,02","26,30"
7,Czechia,"71,95","13,85","11,56","2,64","12,29"
8,Denmark,"77,78","10,54","8,94","2,74","8,15"
9,Estonia,"75,76","12,53","8,73","2,98","9,85"
10,Finland,"81,98","7,89","6,99","3,14","7,14"
11,France,"75,36","11,43","9,23","3,99","9,86"
12,Germany,"79,86","9,91","7,72","2,51","8,57"
13,Greece,"74,31","11,83","9,97","3,89","9,37"
14,Hungary,"74,98","13,16","8,71","3,16","10,41"
15,Iceland,..,..,..,..,..
16,Ireland,"69,02","12,42","12,18","6,38","11,81"
17,Israel,..,..,..,..,..
18,Italy,"77,79","12,26","8,28","1,66","8,05"
19,Japan,"81,94","8,78","7,17","2,11","7,58"
20,Korea,"78,52","9,00","9,82","2,66",..
21,Latvia,"74,80","14,05","8,32","2,83","10,07"
22,Lithuania,"80,44","11,06","7,00","1,51","8,12"
23,Luxembourg,"73,00","12,49","12,07","2,41","11,54"
24,Mexico,"50,23","22,83","17,40","9,53",..
25,Netherlands,"78,65","8,78","9,27","3,30","8,79"
26,New Zealand,"67,37","13,69","12,75","6,19",..
27,Norway,"76,87","10,53","9,14","3,47","8,88"
28,Poland,"74,39","12,91","9,84","2,86","9,97"
29,Portugal,"74,35","15,87","8,18","1,60","9,85"
30,Slovak Republic,"64,41","17,09","14,49","4,02","15,56"
31,Slovenia,"75,00","11,25","10,20","3,56","9,93"
32,Spain,"74,61","13,54","8,95","2,90","8,79"
33,Sweden,"74,84","10,77","9,83","4,56","9,95"
34,Switzerland,..,..,..,..,..
35,Türkiye,"57,62","17,42","14,50","10,45","19,65"
36,United Kingdom,"72,06","12,10","11,31","4,53","12,73"
37,United States,..,..,..,..,..
38,OECD-30 average,"72,33","12,78","10,53","4,36",NaN
39,Bulgaria,"78,21","12,93","7,48","1,38","6,90"
40,Croatia,"74,18","11,96","10,10","3,76","10,44"
41,Cyprus,"71,36","13,88","11,67","3,10","12,71"
42,Malta,"76,49","12,68","7,81","2,98","9,61"
43,Romania,"72,46","14,29","9,24","4,02","9,64"
44,EU average,"75,10","12,28","9,46","3,15","9,90"

In [6726]:
# Normalize column names (lowercase, underscores, remove () and non-ascii)
df_16_3.columns = (
    df_16_3.columns.str.strip().str.lower()
    .str.replace(' ', '_')
    .str.replace('[^0-9a-z_]', '', regex=True)
)

In [6727]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_16_3.columns if c != "country"]

df_16_3[num_cols] = (
    df_16_3[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6728]:
df_16_3.drop_duplicates(inplace=True)
df_16_3.dropna(inplace=True)

In [6729]:
if "year" not in df_16_3.columns:
    df_16_3["year"] = 2024
df_16_3.sample(10)

,country,0_children,1_child,2_children,3_or_more_children,children_under_6,year
43,Romania,72.46,14.29,9.24,4.02,9.64,2024
8,Denmark,77.78,10.54,8.94,2.74,8.15,2024
6,Costa Rica,30.29,23.08,24.61,22.02,26.30,2024
33,Sweden,74.84,10.77,9.83,4.56,9.95,2024
23,Luxembourg,73.00,12.49,12.07,2.41,11.54,2024
28,Poland,74.39,12.91,9.84,2.86,9.97,2024
12,Germany,79.86,9.91,7.72,2.51,8.57,2024
29,Portugal,74.35,15.87,8.18,1.60,9.85,2024
32,Spain,74.61,13.54,8.95,2.90,8.79,2024
31,Slovenia,75.00,11.25,10.20,3.56,9.93,2024

In [6730]:
df_16_3.rename(columns={
    "0_children": "households_0_children",
    "1_child": "households_1_child",
    "2_children": "households_2_children",
    "3_or_more_children": "households_3_or_more_children"
}, inplace=True)

In [6731]:
df_16_3["unit"] = "%"
df_16_3["source"] = "OECD"
df_16_3.sample(10)

,country,households_0_children,households_1_child,households_2_children,households_3_or_more_children,children_under_6,year,unit,source
33,Sweden,74.84,10.77,9.83,4.56,9.95,2024,%,OECD
1,Austria,77.78,10.52,8.57,3.12,9.44,2024,%,OECD
31,Slovenia,75.00,11.25,10.20,3.56,9.93,2024,%,OECD
7,Czechia,71.95,13.85,11.56,2.64,12.29,2024,%,OECD
36,United Kingdom,72.06,12.10,11.31,4.53,12.73,2024,%,OECD
27,Norway,76.87,10.53,9.14,3.47,8.88,2024,%,OECD
29,Portugal,74.35,15.87,8.18,1.60,9.85,2024,%,OECD
22,Lithuania,80.44,11.06,7.00,1.51,8.12,2024,%,OECD
42,Malta,76.49,12.68,7.81,2.98,9.61,2024,%,OECD
32,Spain,74.61,13.54,8.95,2.90,8.79,2024,%,OECD

In [6732]:
info_16_3 = pd.DataFrame({
    "dtype": df_16_3.dtypes,
    "null_count": df_16_3.isna().sum(),
    "unique_count": df_16_3.nunique()
})
print(info_16_3)
print(df_16_3.dtypes)

                                 dtype  null_count  unique_count
country                         object           0            33
households_0_children          float64           0            32
households_1_child             float64           0            32
households_2_children          float64           0            33
households_3_or_more_children  float64           0            31
children_under_6               float64           0            31
year                             int64           0             1
unit                            object           0             1
source                          object           0             1
country                           object
households_0_children            float64
households_1_child               float64
households_2_children            float64
households_3_or_more_children    float64
children_under_6                 float64
year                               int64
unit                              object
source                            object
dtype: object

In [6733]:
#df_16_3.to_csv('../data/Cleaned/cleaned_households_by_number_of_children_2024_oecd.csv', index=False)

In [6734]:
#df_16_3.to_sql('households_by_number_of_children_2024_oecd', engine, index= False)

In [6735]:
df_17_1 = pd.read_csv('../data/Raw/OECD/SF_2_1_Total_Fertility_rates_S1.csv')
#total_fertility_rates_from_1960_oecd
df_17_1.head()

,Country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Australia,"3,45","3,55","3,43","3,34","3,15","2,97","2,89","2,85","2,89",...,"1,79","1,79","1,79","1,74","1,74","1,67","1,59","1,70","1,63","1,50"
1,Austria,"2,69","2,78","2,80","2,82","2,79","2,70","2,66","2,62","2,58",...,"1,46","1,49","1,53","1,52","1,48","1,46","1,44","1,48","1,41","1,32"
2,Belgium,"2,54","2,63","2,59","2,68","2,71","2,61","2,52","2,41","2,31",...,"1,74","1,70","1,68","1,65","1,62","1,60","1,55","1,60","1,53","1,47"
3,Canada,"3,90","3,84","3,76","3,67","3,50","3,15","2,81","2,60","2,45",...,"1,61","1,60","1,59","1,55","1,51","1,47","1,41","1,44","1,33","1,26"
4,Chile,"4,70","4,66","4,60","4,54","4,46","4,36","4,26","4,14","4,03",...,"1,77","1,74","1,69","1,56","1,54","1,43","1,31","1,18","1,26","1,17"

In [6736]:
df_info = pd.DataFrame({
    'dtype': df_17_1.dtypes,
    'null_count': df_17_1.isnull().sum(),
    'unique_count': df_17_1.nunique()
})
print(df_info)

          dtype  null_count  unique_count
Country  object           0            49
1960     object           0            47
1961     object           0            47
1962     object           0            47
1963     object           0            46
...         ...         ...           ...
2019     object           0            37
2020     object           0            39
2021     object           0            40
2022     object           0            34
2023     object           0            35

[65 rows x 3 columns]

In [6737]:
df_17_1.columns = df_17_1.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6738]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_17_1.columns if c != "country"]

df_17_1[num_cols] = (
    df_17_1[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6739]:
df_17_1.drop_duplicates(inplace=True)
df_17_1.dropna(inplace=True)

In [6740]:
# Identify id and year columns
id_cols = ["country"]
year_cols = [c for c in df_17_1.columns if re.fullmatch(r"\d{4}", str(c))]

# Wide → Long
df_17_1 = df_17_1.melt(
    id_vars=id_cols,
    value_vars=year_cols,
    var_name="year",
    value_name="value"
)

# Fix types
df_17_1["year"] = df_17_1["year"].astype(int)
df_17_1["value"] = pd.to_numeric(df_17_1["value"], errors="coerce")
df_17_1 = df_17_1.dropna(subset=["value"])

# Add metadata
df_17_1["indicator"] = "total_fertility_rate"
df_17_1["source"] = "OECD"

# Final column order
df_17_1 = df_17_1[["country","year","indicator","value","source"]]

df_17_1.sample(10)

              country  year             indicator  value source
2574           Norway  2012  total_fertility_rate   1.85   OECD
359           Ireland  1967  total_fertility_rate   3.84   OECD
1772          Denmark  1996  total_fertility_rate   1.75   OECD
36            OECD-38  1960  total_fertility_rate   3.34   OECD
2554       Costa Rica  2012  total_fertility_rate   1.85   OECD
1386          Hungary  1988  total_fertility_rate   1.79   OECD
3124           Brazil  2023  total_fertility_rate   1.62   OECD
813   Slovak Republic  1976  total_fertility_rate   2.52   OECD
242          Bulgaria  1964  total_fertility_rate   2.19   OECD
1938           Poland  1999  total_fertility_rate   1.37   OECD

In [6741]:
df_info = pd.DataFrame({
    'dtype': df_17_1.dtypes,
    'null_count': df_17_1.isnull().sum(),
    'unique_count': df_17_1.nunique()
})
print(df_info)

             dtype  null_count  unique_count
country     object           0            49
year         int32           0            64
indicator   object           0             1
value      float64           0           490
source      object           0             1

In [ ]:
#df_17_1.to_csv('../data/Cleaned/cleaned_total_fertility_rates_oecd.csv', index=False)

In [ ]:
#df_17_1.to_sql('total_fertility_rates_oecd', engine, if_exists='replace', index=False)

136

In [6744]:
df_17_2 = pd.read_csv('../data/Raw/OECD/SF_2_1_Fertility_rates_Births_by_birth_order_S2.csv')
df_17_2

,Country,Birth order,1987,1988,1989,1990,1991,1992,1993,1994,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Austria,First birth,"47,6","47,8","46,7","46,2","46,5","46,1","45,2","44,5",...,"48,0","48,3","47,3","47,5","47,1","47,2","47,7","47,6","48,4","48,1"
1,Austria,Second birth,"33,7","33,7","34,3","34,9","34,5","34,8","35,8","36,4",...,"35,5","35,3","35,6","35,3","35,3","35,1","35,3","35,5","34,9","35,1"
2,Austria,Third birth or higher,"18,8","18,5","19,0","18,9","19,0","19,1","18,9","19,1",...,"16,5","16,4","17,1","17,2","17,6","17,7","17,0","16,9","16,7","16,8"
3,Belgium,First birth,"46,8","46,9","47,3","47,3","48,1","47,2","46,9","47,2",...,"42,3","43,5","44,1","43,6","42,9","42,6","45,0","44,0","44,7","45,5"
4,Belgium,Second birth,"33,0","32,9","32,7","32,8","32,3","32,8","33,5","33,0",...,"35,1","34,8","34,5","34,6","34,5","34,7","34,2","35,1","34,3","34,1"
5,Belgium,Third birth or higher,"20,2","20,2","19,9","19,9","19,6","20,0","19,6","19,8",...,"22,6","21,8","21,4","21,9","22,6","22,6","20,8","20,9","20,9","20,4"
6,Czechia,First birth,"46,7","46,6","47,4","47,8","50,1","49,8","48,5","47,7",...,"47,4","48,1","48,7","48,7","48,0","47,8","47,6","46,4","46,3","46,3"
7,Czechia,Second birth,"37,7","37,6","37,4","37,2","35,5","35,8","36,8","36,9",...,"37,5","37,3","36,7","36,6","37,2","37,6","37,6","39,0","38,6","39,1"
8,Czechia,Third birth or higher,"15,6","15,8","15,2","15,0","14,4","14,4","14,8","15,4",...,"15,1","14,7","14,6","14,7","14,7","14,6","14,8","14,6",15,"14,6"
9,Estonia,First birth,"43,5","43,5","44,0","46,2","49,5","50,3","49,6","49,6",...,"41,9","42,3","40,8","40,2","36,7","38,8","38,0","37,2","39,8","39,7"
10,Estonia,Second birth,"38,0","36,2","34,7","32,8","31,2","30,8","31,2","31,3",...,"37,2","37,0","37,3","36,8","37,3","34,6","34,9","35,9","33,8","33,9"
11,Estonia,Third birth or higher,"18,5","20,4","21,3","21,0","19,3","18,9","19,2","19,1",...,"21,0","20,7","21,9","23,0","26,0","26,6","27,1","26,9","26,4","26,4"
12,Finland,First birth,"39,7","39,6","39,8","40,0","40,7","39,6","39,5","38,2",...,"40,8","41,3","41,4","40,6","40,7","42,1","42,1","42,3","43,4","43,4"
13,Finland,Second birth,"35,7","35,2","34,6","33,6","33,5","34,0","34,4","35,0",...,"34,3","34,4","34,0","34,0","34,2","33,7","34,1","33,9","33,2","33,9"
14,Finland,Third birth or higher,"24,6","25,2","25,6","26,5","25,8","26,3","26,1","26,8",...,"25,0","24,3","24,6","25,3","25,1","24,2","23,9","23,8","23,5","22,6"
15,Greece,First birth,"45,4","45,4","44,4","44,6","45,4","46,6","45,5","45,3",...,"49,8","48,1","48,7","47,7","47,0","46,6","46,3","45,8","47,2","47,5"
16,Greece,Second birth,"38,3","38,5","39,2","39,0","37,6","36,5","37,1","37,1",...,"37,8","39,0","38,2","38,4","38,6","38,5","38,3","38,7","37,6","37,3"
17,Greece,Third birth or higher,"16,3","16,2","16,5","16,4","17,0","17,0","17,4","17,6",...,"12,4","12,9","13,1","13,9","14,4","14,8","15,4","15,6","15,2","15,2"
18,Iceland,First birth,"35,5","35,5","35,6","36,1","35,9","36,5","35,0","35,9",...,"39,9","39,4","38,6","41,3","44,7","45,7","47,1","40,0","41,5","41,9"
19,Iceland,Second birth,"32,9","32,7","32,3","30,9","30,7","31,0","32,9","31,6",...,"36,1","35,4","35,1","34,6","33,2","33,4","33,6","36,2","36,","38,3"
20,Iceland,Third birth or higher,"31,7","31,7","32,1","33,0","33,4","32,5","32,2","32,5",...,"24,0","25,2","26,3","24,1","22,1","20,8","19,2","23,8","22,4","19,8"
21,Latvia,First birth,"44,3","45,3","46,8","47,6","49,0","49,5","50,6","50,9",...,"44,2","42,6","41,1","40,1","39,5","39,0","38,7","38,2","37,9","39,2"
22,Latvia,Second birth,"37,1","36,0","34,4","32,8","31,8","31,8","30,5","30,9",...,"37,5","37,5","38,3","37,9","37,8","37,7","37,3","37,6","36,6","35,3"
23,Latvia,Third birth or higher,"18,6","18,7","18,8","19,6","19,2","18,7","18,9","18,2",...,"18,3","19,9","20,6","22,0","22,6","23,3","24,1","24,2","25,5","25,5"
24,Lithuania,First birth,"47,2","47,7","48,3","47,9","49,6","49,8","49,7","50,4",...,"47,7","47,4","47,0","46,4","44,4","45,7","44,4","43,7","45,4","46,4"
25,Lithuania,Second birth,"36,8","37,0","36,5","36,2","34,8","34,3","34,7","34,3",...,"37,0","37,7","37,8","38,2","40,0","38,9","39,2","39,7","38,4","37,6"
26,Lithuania,Third birth or higher,"16,0","15,2","15,2","15,9","15,6","15,8","15,6","15,3",...,"15,3","14,9","15,2","15,4","15,6","15,4","16,5","16,6","16,2",16
27,Luxembourg,First birth,"41,0","40,2","40,1","39,4","39,7","39,7","39,5","37,8",...,"54,3","54,5","54,6","53,4","52,3","52,6","53,4","53,2","54,4","54,5"
28,Luxembourg,Second birth,"33,0","32,7","33,1","32,8","33,7","32,6","32,4","33,7",...,"32,7","32,9","32,8","33,9","35,7","34,8","33,8","34,1","32,8","31,8"
29,Luxembourg,Third birth or higher,"15,0","15,0","14,9","15,0","14,5","14,9","15,2","15,6",...,"13,1","12,6","12,6","12,6","12,0","12,6","12,8","12,7","12,8","13,7"
30,Netherlands,First birth,"43,8","44,6","44,3","45,1","45,3","44,3","44,4","44,5",...,"46,1","45,5","45,3","45,0","44,8","45,5","45,5","45,4","46,7","46,0"
31,Netherlands,Second birth,"35,7","34,9","35,1","34,4","34,7","35,4","35,9","35,7",...,"36,5","36,8","36,7","36,7","36,6","36,1","36,4","36,3","35,3","36,5"
32,Netherlands,Third birth or higher,"20,6","20,5","20,6","20,5","20,0","20,3","19,7","19,8",...,"17,4","17,6","18,1","18,2","18,5","18,4","18,1","18,2",18,"17,6"
33,Norway,First birth,"43,3","44,0","43,5","42,9","42,9","42,0","41,2","40,6",...,"43,1","43,2","43,3","42,7","43,0","43,2","43,5","42,8","43,7","44,1"
34,Norway,Second birth,"35,5","34,6","34,8","34,8","34,4","35,3","35,8","36,3",...,"37,5","37,4","37,6","37,9","38,2","38,2","38,0","38,4","37,8","38,3"
35,Norway,Third birth or higher,"21,2","21,4","21,7","22,2","22,7","22,7","23,0","23,1",...,"19,4","19,4","19,1","19,4","18,9","18,5","18,4","18,8","18,5","17,7"
36,Poland,First birth,"37,3","37,3","37,8","39,5","39,7","39,5","38,8","39,3",...,"47,4","47,3","46,0","43,1","42,7","42,9","44,3","44,2","44,5","44,8"
37,Poland,Second birth,"34,0","33,8","33,5","32,1","31,2","31,1","30,7","30,3",...,"37,5","37,8","38,5","40,3","38,0","35,9","35,1","34,3","33,3","33,5"
38,Poland,Third birth or higher,"28,7","28,9","28,7","28,4","29,1","29,4","30,5","30,5",...,"15,1","14,9","15,5","16,6","19,4","21,3","20,6","21,5","22,2","21,7"
39,Slovenia,First birth,"47,4","47,6","47,9","47,7","47,3","49,3","47,4","46,8",...,"48,0","47,9","47,4","45,8","45,5","46,0","46,6","45,1","46,8","46,4"
40,Slovenia,Second birth,"39,8","39,4","38,9","39,5","39,4","37,9","39,1","39,6",...,"38,2","38,0","38,3","39,5","39,2","38,5","38,2","39,4","37,7","37,6"
41,Slovenia,Third birth or higher,"12,8","13,0","13,2","12,8","13,3","12,8","13,4","13,6",...,"13,8","14,1","14,3","14,7","15,4","15,5","15,2","15,5","15,5","15,9"
42,Spain,First birth,"48,1","49,3","50,0","50,3","51,3","51,9","52,1","51,8",...,"52,0","51,2","50,3","49,7","49,1","49,5","50,8","49,9","50,5","50,3"
43,Spain,Second birth,"33,2","33,4","34,0","34,6","34,7","34,8","35,1","35,7",...,"37,3","37,9","38,2","38,1","38,0","37,0","35,7","36,2","35,4","36,1"
44,Spain,Third birth or higher,"18,7","17,3","16,1","15,2","14,0","13,3","12,8","12,6",...,"10,7","10,9","11,6","12,2","12,9","13,4","13,5","13,9","14,1","13,6"
45,Switzerland,First birth,"42,1","42,4","42,6","42,2","42,6","42,1","42,2","41,2",...,"48,7","48,7","49,1","48,5","47,9","48,5","48,3","47,6","48,2","48,5"
46,Switzerland,Second birth,"35,4","35,0","34,6","34,4","34,1","34,7","34,6","35,6",...,"36,8","36,7","36,4","36,9","37,3","36,8","36,6","37,4","37,1","37,1"
47,Switzerland,Third birth or higher,"16,6","16,5","16,9","17,3","16,8","17,0","16,9","16,7",...,"14,5","14,7","14,5","14,5","14,8","14,7","15,0","15,0","14,7","14,4"
48,Romania,First birth,"36,4","37,8","39,2","43,5","51,8","53,9","56,0","54,5",...,"53,5","54,6","53,7","54,4","53,6","54,1","53,9","52,4","51,6","49,9"
49,Romania,Second birth,"28,4","28,8","28,8","29,0","27,3","26,3","26,0","27,2",...,"29,6","29,2","30,0","29,6","30,4","30,1","29,5","30,3","30,5","30,8"
50,Romania,Third birth or higher,"35,2","33,4","32,0","27,5","20,9","19,8","18,1","18,3",...,"16,9","16,2","16,3","16,0","16,0","15,8","16,6","17,3","17,9","19,3"

In [6745]:
df_info = pd.DataFrame({
    'dtype': df_17_2.dtypes,
    'null_count': df_17_2.isnull().sum(),
    'unique_count': df_17_2.nunique()
})
print(df_info)

              dtype  null_count  unique_count
Country      object           0            17
Birth order  object           0             3
1987         object           0            48
1988         object           0            49
1989         object           0            48
1990         object           0            44
1991         object           0            48
1992         object           0            46
1993         object           0            47
1994         object           0            47
1995         object           0            48
1996         object           0            47
1997         object           0            49
1998         object           0            50
1999         object           0            49
2000         object           0            48
2001         object           0            50
2002         object           0            47
2003         object           0            50
2004         object           0            49
2005         object           0            49
2006         object           0            49
2007         object           0            45
2008         object           0            46
2009         object           0            47
2010         object           0            49
2011         object           0            49
2012         object           0            48
2013         object           0            47
2014         object           0            45
2015         object           0            48
2016         object           0            47
2017         object           0            48
2018         object           0            48
2019         object           0            49
2020         object           0            50
2021         object           0            48
2022         object           0            51
2023         object           0            47

In [6746]:
df_17_2.columns = df_17_2.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)
df_17_2.head()

,country,birth_order,1987,1988,1989,1990,1991,1992,1993,1994,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,Austria,First birth,"47,6","47,8","46,7","46,2","46,5","46,1","45,2","44,5",...,"48,0","48,3","47,3","47,5","47,1","47,2","47,7","47,6","48,4","48,1"
1,Austria,Second birth,"33,7","33,7","34,3","34,9","34,5","34,8","35,8","36,4",...,"35,5","35,3","35,6","35,3","35,3","35,1","35,3","35,5","34,9","35,1"
2,Austria,Third birth or higher,"18,8","18,5","19,0","18,9","19,0","19,1","18,9","19,1",...,"16,5","16,4","17,1","17,2","17,6","17,7","17,0","16,9","16,7","16,8"
3,Belgium,First birth,"46,8","46,9","47,3","47,3","48,1","47,2","46,9","47,2",...,"42,3","43,5","44,1","43,6","42,9","42,6","45,0","44,0","44,7","45,5"
4,Belgium,Second birth,"33,0","32,9","32,7","32,8","32,3","32,8","33,5","33,0",...,"35,1","34,8","34,5","34,6","34,5","34,7","34,2","35,1","34,3","34,1"

In [6747]:
# 0) Detect year columns first (keep as-is)
year_cols = [c for c in df_17_2.columns.astype(str) if re.fullmatch(r"\d{4}", c)]

# 1) Normalize only non-year columns
df_17_2.columns = [
    c.strip().lower().replace(" ", "_").replace("(", "").replace(")", "")
    if c not in year_cols else c
    for c in df_17_2.columns.astype(str)
]

# 2) Wide → Long
df_17_2 = df_17_2.melt(
    id_vars=[c for c in ["country", "birth_order"] if c in df_17_2.columns],
    value_vars=year_cols,
    var_name="year",
    value_name="value"
)

# 3) Types
df_17_2["year"] = df_17_2["year"].astype(int)
df_17_2["value"] = pd.to_numeric(df_17_2["value"].astype(str).str.replace(",", ".", regex=False),
                                 errors="coerce")
df_17_2 = df_17_2.dropna(subset=["value"]).drop_duplicates()

# 4) Mart fields + order
df_17_2["indicator"] = "births_by_birth_order"
df_17_2["unit"] = "%"
df_17_2["source"] = "OECD"
df_17_2 = df_17_2[["country", "year", "indicator", "birth_order", "unit", "value", "source"]]

In [6748]:
df_17_2

,country,year,indicator,birth_order,unit,value,source
0,Austria,1987,births_by_birth_order,First birth,%,47.6,OECD
1,Austria,1987,births_by_birth_order,Second birth,%,33.7,OECD
2,Austria,1987,births_by_birth_order,Third birth or higher,%,18.8,OECD
3,Belgium,1987,births_by_birth_order,First birth,%,46.8,OECD
4,Belgium,1987,births_by_birth_order,Second birth,%,33.0,OECD
...,...,...,...,...,...,...,...
1882,Switzerland,2023,births_by_birth_order,Second birth,%,37.1,OECD
1883,Switzerland,2023,births_by_birth_order,Third birth or higher,%,14.4,OECD
1884,Romania,2023,births_by_birth_order,First birth,%,49.9,OECD
1885,Romania,2023,births_by_birth_order,Second birth,%,30.8,OECD
1886,Romania,2023,births_by_birth_order,Third birth or higher,%,19.3,OECD

In [6749]:
df_info = pd.DataFrame({
    'dtype': df_17_2.dtypes,
    'null_count': df_17_2.isnull().sum(),
    'unique_count': df_17_2.nunique()
})
print(df_info)

               dtype  null_count  unique_count
country       object           0            17
year           int32           0            37
indicator     object           0             1
birth_order   object           0             3
unit          object           0             1
value        float64           0           422
source        object           0             1

In [6750]:
#df_17_2.to_csv('../data/Cleaned/cleaned_births_by_birth_order_oecd.csv', index=False)

In [6751]:
#df_17_2.to_sql('births_by_birth_order_oecd', engine, if_exists='replace', index=False)

In [6752]:
df_18 = pd.read_csv('../data/Raw/OECD/sf1_2_wide_from_df18.csv')
df_18

,country,year,Living with two parents,Living with a single parent,Other
0,Australia,2003,80.1,19.5,0.5
1,Australia,2006,81.5,18.0,0.5
2,Australia,2009,82.0,17.6,0.4
3,Australia,2012,81.3,18.0,0.6
4,Austria,2003,81.2,16.8,2.0
...,...,...,...,...,...
470,United States,2014,68.7,27.5,3.8
471,United States,2015,69.2,26.8,3.9
472,United States,2016,68.7,27.4,3.8
473,United States,2017,68.9,27.1,4.0
474,United States,2018,69.1,26.6,4.3

In [6753]:
for col in df_18.select_dtypes(include=['object']).columns:
    df_18[col] = df_18[col].astype(str).str.strip()

# 2) Define placeholders representing missing data in OECD exports
placeholders = ['..', '...', '.', ' .', '…', 'Na', 'nan', 'None']

# 3) Replace placeholders with NaN directly in df_18
df_18.replace(placeholders, pd.NA, inplace=True)

In [6754]:
# 1) Ensure 'year' is integer
df_18["year"] = pd.to_numeric(df_18["year"], errors="coerce").astype("Int64")

# 2) Convert all non-key columns to numeric and round(2)
for col in df_18.columns:
    if col not in ["country", "year"]:
        df_18[col] = pd.to_numeric(df_18[col], errors="coerce").round(2)

In [6755]:
# 1) Drop rows with missing key fields
df_18.dropna(subset=["country", "year"], inplace=True)

# 2) Drop duplicate country-year rows, keep the first
df_18.drop_duplicates(subset=["country", "year"], keep="first", inplace=True)

# 3) Drop rows where all value columns are NaN
value_cols = [c for c in df_18.columns if c not in ["country", "year"]]
df_18.dropna(subset=value_cols, how="all", inplace=True)

# 4) Sort and reset index
df_18.sort_values(["country", "year"], inplace=True)
df_18.reset_index(drop=True, inplace=True)

In [6756]:
df_18

,country,year,Living with two parents,Living with a single parent,Other
0,Australia,2003,80.1,19.5,0.5
1,Australia,2006,81.5,18.0,0.5
2,Australia,2009,82.0,17.6,0.4
3,Australia,2012,81.3,18.0,0.6
4,Austria,2003,81.2,16.8,2.0
...,...,...,...,...,...
470,United States,2014,68.7,27.5,3.8
471,United States,2015,69.2,26.8,3.9
472,United States,2016,68.7,27.4,3.8
473,United States,2017,68.9,27.1,4.0
474,United States,2018,69.1,26.6,4.3

In [6757]:
df_18['Other'] = pd.to_numeric(df_18['Other'], errors='coerce')

In [6758]:
print(repr(df_18.loc[df_18['Other'].notnull(), 'Other'].unique()))

array([0.5, 0.4, 0.6, 2. , 1. , 1.9, 0.3, 0.1, 0.8, 0.7, 8.7, 3.5, 2.5,
       2.1, 2.4, 2.6, 6.7, 5.1, 1.4, 1.2, 1.7, 1.5, 3.4, 2.9, 2.3, 3. ,
       4.2, 2.8, 1.3, 9. , 0.2, 0.9, 1.1, 4.5, 4.7, 1.6, 3.8, 3.6, 3.3,
       2.2, 0. , 1.8, 2.7, 3.2, 3.9, 4.1, 4.4, 3.7, 4. , 4.3])

In [6759]:
df_18['Other'] = pd.to_numeric(df_18['Other'], errors='coerce')

df_18.dropna(inplace=True, subset=['Other'])

df_18.isnull().sum()

country                        0
year                           0
Living with two parents        0
Living with a single parent    0
Other                          0
dtype: int64

In [6760]:
df_18['unit'] = '%'
df_18['source'] = 'OECD'

df_18.sample(10)

,country,year,Living with two parents,Living with a single parent,Other,unit,source
320,Norway,2009,79.5,19.5,1.0,%,OECD
32,Belgium,2015,73.8,25.0,1.2,%,OECD
435,Switzerland,2014,87.5,12.3,0.2,%,OECD
75,Cyprus,2016,86.9,12.5,0.6,%,OECD
197,Iceland,2006,80.6,17.8,1.5,%,OECD
280,Luxembourg,2014,84.4,15.6,0.0,%,OECD
222,Ireland,2017,78.1,21.2,0.7,%,OECD
149,France,2015,77.1,22.3,0.5,%,OECD
198,Iceland,2007,81.8,17.4,0.8,%,OECD
412,Spain,2018,82.8,15.6,1.5,%,OECD

In [6761]:

df_info = pd.DataFrame({
    'dtype': df_18.dtypes,
    'null_count': df_18.isnull().sum(),
    'unique_count': df_18.nunique()
})
print(df_info)

                               dtype  null_count  unique_count
country                       object           0            38
year                           Int64           0            18
Living with two parents      float64           0           211
Living with a single parent  float64           0           203
Other                        float64           0            50
unit                          object           0             1
source                        object           0             1

In [6762]:
#df_18.to_csv('../data/Cleaned/cleaned_household_children_oecd.csv', index=False)

In [6763]:
#df_18.to_sql('household_children_oecd', engine, if_exists= 'replace', index= False)

In [6764]:
df_19_1 =pd.read_csv('../data/Raw/OECD/SF_2_3_Age_mothers_childbirth_mean_age_birth_S1.csv')
#age_of_mothers_at_childbirth
df_19_1

,Country,1963,1964,1965,1966,1967,1968,1969,1970,1971,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Australia,"27,5","27,5","27,4","27,3","27,3","27,2","27,2","27,1","26,9",...,"30,1","30,1","30,2","30,3","30,5","30,6","30,7","30,8","30,9","31,1"
1,Austria,"27,4","27,4","27,3","27,1","27,0","26,8","26,8","26,7","26,7",...,"30,2","30,3","30,4","30,6","30,6","30,7","30,9","31,0","31,0","31,2"
2,Belgium,"27,8","27,7","27,6","27,5","27,4","27,3","27,2","27,2","27,0",...,"30,0","30,2","30,3","30,4","30,5","30,6","30,7","30,8","30,8","31,0"
3,Canada,"27,8","27,9","27,8","27,7","27,5","27,3","27,3","27,2","27,0",...,"30,3","30,4","30,5","30,6","30,7","30,9","31,0","31,2","31,3","31,4"
4,Chile,"29,2","29,1","29,1","29,0","28,8","28,7","28,6","28,4","28,2",...,"28,1","28,3","28,5","28,8","29,1","29,4","29,6","29,9","30,1",..
5,Czech Republic,"25,7","25,8","25,5","25,2","25,0","24,9","24,8","24,8","24,9",...,"29,8","29,9","29,9","30,0","30,0","30,0","30,1","30,2","30,2","30,4"
6,Costa Rica,"29,3","29,3","29,3","29,3","29,2","29,1","28,9","28,7","28,5",...,"26,5","26,7","26,8","27,1","27,2","27,4","27,6","27,9","28,4","28,7"
7,Denmark,"27,3","26,8","26,8","26,6","26,5","26,5","26,6","26,7","26,7",...,"30,7","30,8","30,9","31,0","31,0","31,1","31,2","31,3","31,4","31,6"
8,Estonia,"27,6","27,4","27,3","27,3","27,1","26,9","26,9","26,7","26,7",...,"29,6","29,5","29,6","29,9","30,2","30,4","30,5","30,6","30,7","31,0"
9,Finland,"28,1","28,0","28,0","27,8","27,7","27,5","27,4","27,1","26,9",...,"30,4","30,5","30,5","30,6","30,8","30,9","31,0","31,1","31,2","31,4"
10,Greece,"28,4","28,2","28,1","27,9","27,8","27,7","27,7","27,4","27,4",...,"30,7","30,9","31,1","31,3","31,3","31,4","31,5","31,7","31,7","32,1"
11,Hungary,"25,8","25,7","25,6","25,6","25,6","25,5","25,5","25,4","25,4",...,"29,4","29,5","29,5","29,6","29,6","29,8","29,8","29,9","29,9","30,0"
12,Iceland,"27,6","27,7","27,7","27,5","27,5","27,4","27,3","27,2","27,0",...,"30,1","30,4","30,2","30,3","30,6","30,6","30,6","30,9","30,7","30,9"
13,Ireland,"31,1","31,1","31,0","30,9","30,8","30,6","30,5","30,4","30,2",...,"31,5","31,7","31,8","31,9","32,1","32,1","32,2","32,4","32,6","32,7"
14,Israel,"28,1","28,1","28,2","28,2","28,2","28,5","28,4","28,2","28,5",...,"30,1","30,2","30,3","30,3","30,4","30,4","30,4","30,5","30,5","30,6"
15,Italy,"28,9","28,8","28,7","28,7","28,6","28,5","28,5","28,3","28,2",...,"31,4","31,5","31,5","31,7","31,8","31,9","32,0","32,1","32,2","32,4"
16,Mexico,"29,4","29,6","29,9","30,0","30,0","29,8","30,1","30,2","30,1",...,"26,5","26,5","26,6","26,7","26,8","26,9","26,6","26,8","27,1","27,1"
17,Netherlands,"29,3","29,2","29,0","28,8","28,5","28,4","28,3","28,2","28,0",...,"30,9","31,0","31,1","31,2","31,3","31,4","31,5","31,6","31,7","31,8"
18,New Zealand,"27,5","27,4","27,2","27,0","26,9","26,8","26,8","26,7","26,5",...,"29,8","29,9","30,1","30,2","30,4","30,4","30,6","30,7","30,8","31,0"
19,Norway,"27,8","27,8","27,7","27,6","27,5","27,3","27,2","27,0","26,8",...,"30,3","30,5","30,6","30,7","30,8","31,0","31,1","31,3","31,4","31,5"
20,Portugal,"29,6","29,5","29,5","29,4","29,3","29,2","29,1","29,0","29,0",...,"30,2","30,4","30,7","30,9","31,1","31,2","31,4","31,4","31,6","31,8"
21,Slovak Republic,"26,8","26,9","26,8","26,6","26,5","26,4","26,3","26,2","26,2",...,"28,7","28,8","28,8","28,8","28,8","28,8","28,8","28,8","28,9","28,9"
22,Switzerland,"27,8","27,8","27,7","27,7","27,5","27,5","27,9","27,8","27,7",...,"31,5","31,6","31,8","31,8","31,9","31,9","32,0","32,1","32,2","32,3"
23,United States,"26,5","26,6","26,6","26,4","26,3","26,3","26,2","26,1","26,0",...,"28,0","28,2","28,3","28,5","28,7","28,8","29,0","29,1","29,2","29,4"
24,China,"29,5","29,8","29,7","29,8","29,9","29,8","29,8","29,8","29,7",...,"27,6","27,9","28,0","27,4","28,4",..,..,..,..,..
25,Bulgaria,"25,0","24,9","24,8","24,7","24,7","24,7","24,8","24,7","24,5",...,"27,1","27,1","27,3","27,4","27,6","27,6","27,7","27,8","27,8","27,9"

In [6765]:
df_info = pd.DataFrame({
    'dtype': df_19_1.dtypes,
    'null_count': df_19_1.isnull().sum(),
    'unique_count': df_19_1.nunique()
})
print(df_info)

          dtype  null_count  unique_count
Country  object           0            26
1963     object           0            19
1964     object           0            22
1965     object           0            22
1966     object           0            22
1967     object           0            22
1968     object           0            20
1969     object           0            21
1970     object           0            19
1971     object           0            19
1972     object           0            20
1973     object           0            20
1974     object           0            24
1975     object           0            21
1976     object           0            22
1977     object           0            20
1978     object           0            22
1979     object           0            23
1980     object           0            22
1981     object           0            20
1982     object           0            18
1983     object           0            20
1984     object           0            22
1985     object           0            18
1986     object           0            19
1987     object           0            22
1988     object           0            22
1989     object           0            21
1990     object           0            17
1991     object           0            22
1992     object           0            22
1993     object           0            20
1994     object           0            19
1995     object           0            23
1996     object           0            21
1997     object           0            21
1998     object           0            19
1999     object           0            21
2000     object           0            22
2001     object           0            21
2002     object           0            19
2003     object           0            21
2004     object           0            24
2005     object           0            21
2006     object           0            21
2007     object           0            22
2008     object           0            23
2009     object           0            21
2010     object           0            20
2011     object           0            19
2012     object           0            18
2013     object           0            20
2014     object           0            21
2015     object           0            20
2016     object           0            21
2017     object           0            18
2018     object           0            21
2019     object           0            22
2020     object           0            21
2021     object           0            21

In [6766]:
df_19_1.columns = df_19_1.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6767]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_19_1.columns if c != "country"]

df_19_1[num_cols] = (
    df_19_1[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6768]:
df_19_1.drop_duplicates(inplace=True)
df_19_1.dropna(inplace=True)

In [6769]:
# --- Identify id columns and year columns
id_cols = [c for c in ['country','age','age_group','indicator'] if c in df_19_1.columns]
year_cols = [c for c in df_19_1.columns if re.fullmatch(r'\d{4}', c)]

# --- Wide → Long
df_19_1 = df_19_1.melt(
    id_vars=id_cols,
    value_vars=year_cols,
    var_name='year',
    value_name='value'
)

# --- Fix types
df_19_1['year'] = df_19_1['year'].astype(int)
df_19_1['age'] = pd.to_numeric(df_19_1['value'], errors='coerce')
df_19_1 = df_19_1.dropna(subset=['value'])

# --- Add unit & indicator if missing
if 'indicator' not in df_19_3.columns:
    df_19_1['indicator'] = 'fertility_by_age'
df_19_1['unit'] = 'age'
df_19_1['source'] = 'OECD'
df_19_1.sample(10)

             country  year  value   age unit source
88         Australia  1967   27.3  27.3  age   OECD
174    United States  1970   26.1  26.1  age   OECD
912          Iceland  2004   29.5  29.5  age   OECD
318          Iceland  1977   27.0  27.0  age   OECD
932           Greece  2005   29.9  29.9  age   OECD
289           Canada  1976   26.7  26.7  age   OECD
893            Italy  2003   30.8  30.8  age   OECD
390           Norway  1980   26.9  26.9  age   OECD
1126  Czech Republic  2014   29.9  29.9  age   OECD
843          Finland  2001   29.6  29.6  age   OECD

In [6770]:
df_info = pd.DataFrame({
    'dtype': df_19_1.dtypes,
    'null_count': df_19_1.isnull().sum(),
    'unique_count': df_19_1.nunique()
})
print(df_info)

           dtype  null_count  unique_count
country   object           0            22
year       int32           0            59
value    float64           0            90
age      float64           0            90
unit      object           0             1
source    object           0             1

In [6771]:
#df_19_1.to_csv('../data/Cleaned/age_of_mothers_at_childbirth_oecd.csv', index=False)

In [6772]:
#df_19_1.to_sql('age_of_mothers_at_childbirth_oecd', engine, if_exists='replace', index=False)

In [6773]:
df_19_2 = pd.read_csv('../data/Raw/OECD/SF_2_3_Age_mothers_childbirth_fertility_by_age_1960_S2.csv')
#fertility_per_1000_from 1960
df_19_2.head()

,Country,Age group,1960,1961,1962,1963,1964,1965,1966,1967,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Australia,15-19,"44,3","47,4","44,7","45,9","47,0","47,5","48,9","48,4",...,"16,1","14,6","12,9","12,0","10,5","10,3","9,5","8,8","7,9","7,1"
1,Australia,20-24,"220,1","225,8","216,0","208,2","190,5","179,3","173,1","170,8",...,"53,2","51,3","47,4","47,3","44,7","43,1","42,8","40,1","37,7","38,8"
2,Australia,25-29,"216,3","221,2","216,7","211,2","198,1","188,5","183,9","185,0",...,"102,6","99,1","94,8","93,4","92,2","89,7","89,3","84,3","80,3","86,7"
3,Australia,30-34,"127,5","131,1","127,7","123,9","119,1","110,1","105,1","102,8",...,"126,9","124,8","120,4","121,7","123,6","119,1","120,1","115,6","111,4","120,6"
4,Australia,35-39,"62,3","63,4","61,4","59,7","58,4","53,0","50,6","47,8",...,"71,5","70,9","69,2","69,8","72,0","71,3","71,6","69,3","66,3","70,9"

In [6774]:
df_info = pd.DataFrame({
    'dtype': df_19_2.dtypes,
    'null_count': df_19_2.isnull().sum(),
    'unique_count': df_19_2.nunique()
})
print(df_info)

            dtype  null_count  unique_count
Country    object           0            21
Age group  object           0             7
1960       object           0           136
1961       object           0           140
1962       object           0           140
...           ...         ...           ...
2017       object           0           124
2018       object           0           128
2019       object           0           126
2020       object           0           121
2021       object           7           119

[64 rows x 3 columns]

In [6775]:
df_19_2.columns = df_19_2.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)
df_19_2.head()

,country,age_group,1960,1961,1962,1963,1964,1965,1966,1967,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Australia,15-19,"44,3","47,4","44,7","45,9","47,0","47,5","48,9","48,4",...,"16,1","14,6","12,9","12,0","10,5","10,3","9,5","8,8","7,9","7,1"
1,Australia,20-24,"220,1","225,8","216,0","208,2","190,5","179,3","173,1","170,8",...,"53,2","51,3","47,4","47,3","44,7","43,1","42,8","40,1","37,7","38,8"
2,Australia,25-29,"216,3","221,2","216,7","211,2","198,1","188,5","183,9","185,0",...,"102,6","99,1","94,8","93,4","92,2","89,7","89,3","84,3","80,3","86,7"
3,Australia,30-34,"127,5","131,1","127,7","123,9","119,1","110,1","105,1","102,8",...,"126,9","124,8","120,4","121,7","123,6","119,1","120,1","115,6","111,4","120,6"
4,Australia,35-39,"62,3","63,4","61,4","59,7","58,4","53,0","50,6","47,8",...,"71,5","70,9","69,2","69,8","72,0","71,3","71,6","69,3","66,3","70,9"

In [6776]:
# --- Ensure "country" and "age_group" are strings
df_19_2["country"] = df_19_2["country"].astype(str).str.strip().str.title()
df_19_2["age_group"] = df_19_2["age_group"].astype(str).str.strip()

# --- Identify numeric columns: everything except country and birth order ---
num_cols = [c for c in df_19_2.columns if c not in ["country", "age_group"]]
# --- Robust cleaning -> convert to float ---
df_19_2[num_cols] = (
    df_19_2[num_cols].astype(str)
    .replace({"\xa0": "", "\u202f": "", ",": "."}, regex=True)
    .replace(r"[^\d\.\-]", "", regex=True)
    .replace(r"\.\.+", ".", regex=True)
    .replace(r"^\.$|^\s*$", np.nan, regex=True)
    .apply(pd.to_numeric, errors="coerce")
)
df_19_2[num_cols] = df_19_2[num_cols].round(2)

In [6777]:
df_19_2.drop_duplicates(inplace=True)
df_19_2.dropna(inplace = True)

In [6778]:
df_info = pd.DataFrame({
    'dtype': df_19_2.dtypes,
    'null_count': df_19_2.isnull().sum(),
    'unique_count': df_19_2.nunique()
})
print(df_info)

             dtype  null_count  unique_count
country     object           0            19
age_group   object           0             7
1960       float64           0           124
1961       float64           0           126
1962       float64           0           126
...            ...         ...           ...
2017       float64           0           118
2018       float64           0           121
2019       float64           0           120
2020       float64           0           115
2021       float64           0           118

[64 rows x 3 columns]

In [6779]:
# --- Identify id columns and year columns
id_cols = [c for c in ['country','age','age_group','indicator'] if c in df_19_2.columns]
year_cols = [c for c in df_19_2.columns if re.fullmatch(r'\d{4}', c)]

# --- Wide → Long
df_19_2 = df_19_2.melt(
    id_vars=id_cols,
    value_vars=year_cols,
    var_name='year',
    value_name='value'
)

# --- Fix types
df_19_2['year'] = df_19_2['year'].astype(int)
df_19_2['value'] = pd.to_numeric(df_19_2['value'], errors='coerce')
df_19_2 = df_19_2.dropna(subset=['value'])

# --- Add unit & indicator if missing
if 'indicator' not in df_19_2.columns:
    df_19_2['indicator'] = 'fertility_by_age'
df_19_2['unit'] = '‰'
df_19_2['source'] = 'OECD'

In [6780]:
df_19_2

        country age_group  year  value         indicator unit source
0     Australia     15-19  1960   44.3  fertility_by_age    ‰   OECD
1     Australia     20-24  1960  220.1  fertility_by_age    ‰   OECD
2     Australia     25-29  1960  216.3  fertility_by_age    ‰   OECD
3     Australia     30-34  1960  127.5  fertility_by_age    ‰   OECD
4     Australia     35-39  1960   62.3  fertility_by_age    ‰   OECD
...         ...       ...   ...    ...               ...  ...    ...
8241   Bulgaria     25-29  2021   91.7  fertility_by_age    ‰   OECD
8242   Bulgaria     30-34  2021   73.6  fertility_by_age    ‰   OECD
8243   Bulgaria     35-39  2021   34.8  fertility_by_age    ‰   OECD
8244   Bulgaria     40-44  2021    7.8  fertility_by_age    ‰   OECD
8245   Bulgaria     45-49  2021    1.0  fertility_by_age    ‰   OECD

[8246 rows x 7 columns]

In [6781]:
df_19_2.to_csv('../data/Cleaned/cleaned_fertility_per_1000_from_1960_oecd.csv', index=False)

In [6782]:
df_19_2.to_sql('fertility_per_1000_from_1960_oecd', engine, if_exists='replace', index=False)

246

In [6783]:
df_19_3 = pd.read_csv('../data/Raw/OECD/SF_2_3_Age_mothers_childbirth_fertility_by_age_2000_S3.csv')
#fertility_per_1000_from_2000
df_19_3

,Country,Age group,2000,2001,2002,2003,2004,2005,2006,2007,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,OECD-Average,15-19,"22,6","22,0","21,1","20,5","20,3","20,1","20,0","20,5",...,"17,9","16,8","16,2","15,2","14,4","13,5","12,6","11,7","10,2","9,5"
1,OECD-Average,20-24,"71,7","69,3","66,8","65,5","64,7","63,2","62,9","63,0",...,"56,4","53,8","53,3","51,9","50,4","48,8","47,0","45,0","42,0","40,5"
2,OECD-Average,25-29,"107,9","105,0","103,1","103,5","103,4","102,3","102,6","103,4",...,"99,4","96,5","96,9","96,1","94,9","92,8","90,7","88,4","85,5","86,9"
3,OECD-Average,30-34,"88,1","87,2","88,6","91,1","93,4","94,6","97,6","100,0",...,"103,6","101,9","104,0","104,9","105,3","104,1","103,3","101,7","99,6","103,6"
4,OECD-Average,35-39,"38,1","38,6","39,5","40,6","42,2","43,5","45,6","47,7",...,"53,1","53,4","55,1","56,3","57,1","57,0","57,4","57,5","55,9","58,7"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
296,Romania,25-29,"78,2","77,0","78,6","82,0","84,8","90,8","92,3","93,0",...,"91,8","88,3","94,4","98,9","100,1","109,0","108,3","109,1","109,4","110,9"
297,Romania,30-34,"38,8","38,1","38,8","38,8","41,6","47,5","51,1","54,2",...,"66,6","64,8","71,5","75,4","78,5","86,6","85,9","86,4","87,1","87,5"
298,Romania,35-39,"13,4","13,8","15,2","19,4","23,2","25,1","25,7","24,9",...,"27,3","27,4","29,9","32,1","33,0","36,8","36,7","38,3","40,6","41,1"
299,Romania,40-44,"3,1","3,1","3,0","2,9","3,1","3,1","2,8","3,1",...,"4,9","4,8","5,6","6,1","6,8","7,3","7,8","8,0","8,5","8,2"
300,Romania,45-49,"0,2","0,2","0,2","0,2","0,2","0,2","0,2","0,2",...,"0,3","0,3","0,3","0,3","0,3","0,4","0,4","0,5","0,6","0,5"

In [6784]:
df_info = pd.DataFrame({
    'dtype': df_19_3.dtypes,
    'null_count': df_19_3.isnull().sum(),
    'unique_count': df_19_3.nunique()
})
print(df_info)

            dtype  null_count  unique_count
Country    object           0            43
Age group  object           0             7
2000       object           0           233
2001       object           0           248
2002       object           0           240
2003       object           0           239
2004       object           0           245
2005       object           0           240
2006       object           0           239
2007       object           0           242
2008       object           0           252
2009       object           0           251
2010       object           0           239
2011       object           0           235
2012       object           0           242
2013       object           0           234
2014       object           0           238
2015       object           0           237
2016       object           0           248
2017       object           0           236
2018       object           0           245
2019       object           0           247
2020       object           0           244
2021       object           0           241

In [6785]:
df_19_3.columns = df_19_3.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)
df_19_3.head()

,country,age_group,2000,2001,2002,2003,2004,2005,2006,2007,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,OECD-Average,15-19,"22,6","22,0","21,1","20,5","20,3","20,1","20,0","20,5",...,"17,9","16,8","16,2","15,2","14,4","13,5","12,6","11,7","10,2","9,5"
1,OECD-Average,20-24,"71,7","69,3","66,8","65,5","64,7","63,2","62,9","63,0",...,"56,4","53,8","53,3","51,9","50,4","48,8","47,0","45,0","42,0","40,5"
2,OECD-Average,25-29,"107,9","105,0","103,1","103,5","103,4","102,3","102,6","103,4",...,"99,4","96,5","96,9","96,1","94,9","92,8","90,7","88,4","85,5","86,9"
3,OECD-Average,30-34,"88,1","87,2","88,6","91,1","93,4","94,6","97,6","100,0",...,"103,6","101,9","104,0","104,9","105,3","104,1","103,3","101,7","99,6","103,6"
4,OECD-Average,35-39,"38,1","38,6","39,5","40,6","42,2","43,5","45,6","47,7",...,"53,1","53,4","55,1","56,3","57,1","57,0","57,4","57,5","55,9","58,7"

In [6786]:
# --- Ensure "country" and "age_group" are strings
df_19_3["country"] = df_19_3["country"].astype(str).str.strip().str.title()
df_19_3["age_group"] = df_19_3["age_group"].astype(str).str.strip()

# --- Identify numeric columns: everything except country and birth order ---
num_cols = [c for c in df_19_3.columns if c not in ["country", "age_group"]]
# --- Robust cleaning -> convert to float ---
df_19_3[num_cols] = (
    df_19_3[num_cols].astype(str)
    .replace({"\xa0": "", "\u202f": "", ",": "."}, regex=True)
    .replace(r"[^\d\.\-]", "", regex=True)
    .replace(r"\.\.+", ".", regex=True)
    .replace(r"^\.$|^\s*$", np.nan, regex=True)
    .apply(pd.to_numeric, errors="coerce")
)
df_19_3[num_cols] = df_19_3[num_cols].round(2)

In [6787]:
df_19_3.drop_duplicates(inplace=True)
df_19_3.dropna(inplace=True)

In [6788]:
# --- Identify id columns and year columns
id_cols = [c for c in ['country','age','age_group','indicator'] if c in df_19_3.columns]
year_cols = [c for c in df_19_3.columns if re.fullmatch(r'\d{4}', c)]

# --- Wide → Long
df_19_3 = df_19_3.melt(
    id_vars=id_cols,
    value_vars=year_cols,
    var_name='year',
    value_name='value'
)

# --- Fix types
df_19_3['year'] = df_19_3['year'].astype(int)
df_19_3['value'] = pd.to_numeric(df_19_3['value'], errors='coerce')
df_19_3 = df_19_3.dropna(subset=['value'])

# --- Add unit & indicator if missing
if 'indicator' not in df_19_3.columns:
    df_19_3['indicator'] = 'fertility_by_age'
df_19_3['unit'] = '‰'
df_19_3['source'] = 'OECD'

In [6789]:
df_19_3

           country age_group  year  value         indicator unit source
0     Oecd-Average     15-19  2000   22.6  fertility_by_age    ‰   OECD
1     Oecd-Average     20-24  2000   71.7  fertility_by_age    ‰   OECD
2     Oecd-Average     25-29  2000  107.9  fertility_by_age    ‰   OECD
3     Oecd-Average     30-34  2000   88.1  fertility_by_age    ‰   OECD
4     Oecd-Average     35-39  2000   38.1  fertility_by_age    ‰   OECD
...            ...       ...   ...    ...               ...  ...    ...
6287       Romania     25-29  2021  110.9  fertility_by_age    ‰   OECD
6288       Romania     30-34  2021   87.5  fertility_by_age    ‰   OECD
6289       Romania     35-39  2021   41.1  fertility_by_age    ‰   OECD
6290       Romania     40-44  2021    8.2  fertility_by_age    ‰   OECD
6291       Romania     45-49  2021    0.5  fertility_by_age    ‰   OECD

[6292 rows x 7 columns]

In [6790]:
#Check again
df_info = pd.DataFrame({
    'dtype': df_19_3.dtypes,
    'null_count': df_19_3.isnull().sum(),
    'unique_count': df_19_3.nunique()
})
print(df_info)

             dtype  null_count  unique_count
country     object           0            41
age_group   object           0             7
year         int32           0            22
value      float64           0          1337
indicator   object           0             1
unit        object           0             1
source      object           0             1

In [6791]:
df_19_3.to_csv('../data/Cleaned/cleaned_fertility_per_1000_from_2000_oecd.csv',index=False)

In [6792]:
df_19_3.to_sql('fertility_per_1000_from_2000_oecd',engine, if_exists='replace', index=False)

292

In [6793]:
df_20= pd.read_csv('../data/Raw/OECD/SF_2_4_Share_births_outside_marriage_1960.csv')
#(%)share_of_births_outside_of_marriage
df_20

,Country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Austria,"13,0","12,6","12,0","11,6","11,3","11,2","11,4","11,5","12,0",...,"40,4","41,5","41,4","41,7","42,1","42,2","42,0","41,3","40,6","41,2"
1,Belgium,"2,1","2,0","2,1","2,2","2,3","2,4","2,5","2,5","2,7",...,"47,0","47,7","49,5","49,4","48,0","49,0","52,8","52,4",..,..
2,Czech Republic,"4,9","4,6","4,5","4,7","4,8","5,0","5,3","5,3","5,4",...,"41,8","43,4","45,0","46,7","47,8","48,6","49,0","48,5","48,2","48,5"
3,Denmark,"7,8","8,0","8,3","8,9","9,3","9,5","10,2","11,1","11,1",...,"49,0","50,6","51,5","52,5","53,8","54,0","54,2","54,2","54,1","54,2"
4,Finland,"4,0","4,1","4,0","4,2","4,4","4,6","4,8","5,1","5,3",...,"40,9","41,5","42,1","42,8","44,3","44,9","44,8","44,6","45,4","46,1"
5,Germany,"7,6","7,1","6,6","6,1","5,9","5,8","5,7","5,8","6,1",...,"33,9","34,5","34,8","35,0","35,0","35,5","34,7","33,9","33,3","33,1"
6,Greece,"1,2","1,2","1,2","1,2","1,1","1,1","1,0","1,0","1,1",...,"7,4","7,6","7,0","8,2","8,8","9,4","10,3","11,1","12,4","13,8"
7,Hungary,"5,5","5,5","5,4","5,3","5,2","5,2","5,1","5,0","5,0",...,"42,3","44,5","45,6","47,3","47,9","46,7","44,7","43,9","38,7","30,4"
8,Iceland,"25,3","25,3","24,5","25,1","26,7","26,9","28,4","30,0","30,5",...,"65,0","66,9",..,..,..,"69,6","71,2","70,5","69,4",..
9,Ireland,"1,6","1,6","1,8","1,8","2,0","2,2","2,3","2,5","2,6",...,"33,9","35,1","35,3","36,3","36,6","36,7","37,6","37,9","38,4",..
10,Italy,"2,4","2,4","2,2","2,2","2,0","2,0","2,0","2,0","2,0",...,"23,7","25,0","26,9","28,8","30,0","31,5","32,8","34,0","35,4","33,8"
11,Latvia,"11,9","12,3","12,4","12,3","12,8","13,3","12,6","12,3","12,1",...,"44,6","45,0","44,6","44,0","41,5","40,9","40,4","39,5","38,4","39,5"
12,Luxembourg,"3,2","3,4","3,1","3,1","3,2","3,7","3,2","3,5","3,2",...,"34,1","37,1","37,8","39,1","38,8","40,7","40,8","39,5","40,4","41,6"
13,Netherlands,"1,4","1,4","1,5","1,6","1,7","1,8","2,0","2,1","2,0",...,"45,3","46,6","47,4","48,7","49,8","50,4","51,0","51,9","52,4","53,5"
14,New Zealand,"4,6","5,1","8,0","8,8","9,9","10,9","11,6","12,7","13,0",...,"47,6","47,7","47,3","46,7","46,7","45,9","46,9","48,2","47,6","48,3"
15,Norway,"3,7","3,7","3,8","3,9","4,2","4,6","4,9","5,1","5,6",...,"55,0","54,9","55,2","55,5","55,9","56,2","55,7","56,4","57,6","58,5"
16,Portugal,"9,5","8,8","8,5","8,2","8,0","7,8","7,5","7,5","7,4",...,"42,8","45,6","47,6","49,3","50,7","52,8","54,9","55,9","56,8","57,9"
17,Slovak Republic,"4,7","4,4","4,6","4,7","5,0","5,3","5,3","5,7","5,9",...,"34,0","35,4","37,0","38,9","39,2","40,2","40,1","40,0","40,1","40,7"
18,Slovenia,"9,1","10,0","10,1","9,8","9,2","9,2","8,7","8,7","8,8",...,"56,8","57,6","58,0","58,3","57,9","58,6","57,5","57,7","57,7","56,5"
19,Spain,"2,3","2,2","2,1","1,9","1,8","1,7","1,6","1,5","1,4",...,"37,4","39,0","40,9","42,5","44,5","45,9","46,8","47,3","48,4","47,6"
20,Sweden,"11,3","11,7","12,4","12,6","13,1","13,8","14,5","15,1","16,0",...,"54,3","54,5","54,4","54,6","54,7","54,9","54,5","54,5","54,5","55,2"
21,Switzerland,"3,8","4,0","4,2","4,1","4,2","3,9","3,8","3,9","3,8",...,"19,3","20,2","21,1","21,7","22,9","24,2","25,2","25,7","26,5","27,7"
22,United Kingdom,"5,2","5,7","6,3","6,6","6,9","7,3","7,6","8,1","8,2",...,"47,3","47,6","47,5","47,6","47,9","47,7","48,2","48,4","48,5","49,0"
23,United States,"5,3","5,6","5,9","6,3","6,9","7,7","8,4","9,0","9,7",...,"40,7","40,7","40,6","40,2","40,3","39,8","39,8","39,6","40,0","40,5"
24,Bulgaria,"8,0","8,0","8,1","8,4","8,8","9,4","9,6","9,7","9,6",...,"56,1","57,4","59,1","58,8","58,6","58,6","58,9","58,5","58,4","59,6"
25,Croatia,"7,4","7,1","6,5","6,9","6,8","6,0","5,7","5,4","5,5",...,"14,0","15,4","16,1","17,4","18,1","18,9","19,9","20,7","21,5","22,8"

In [6794]:
df_info = pd.DataFrame({
    'dtype': df_20.dtypes,
    'null_count': df_20.isnull().sum(),
    'unique_count': df_20.nunique()
})
print(df_info)

          dtype  null_count  unique_count
Country  object           0            26
1960     object           0            26
1961     object           0            24
1962     object           0            24
1963     object           0            24
...         ...         ...           ...
2016     object           0            24
2017     object           0            26
2018     object           0            25
2019     object           0            25
2020     object           0            24

[62 rows x 3 columns]

In [6795]:
df_20.columns = df_20.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6796]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_20.columns if c != "country"]

df_20[num_cols] = (
    df_20[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6797]:
df_20.drop_duplicates(inplace=True)
df_20.dropna(inplace=True)

In [6798]:

# Identify columns
id_cols = [c for c in ['country','category','sex'] if c in df_20.columns]
year_cols = [c for c in df_20.columns if re.fullmatch(r'\d{4}', c)]

# Melt wide → long
df_20 = df_20.melt(id_vars=id_cols, value_vars=year_cols,
                       var_name='year', value_name='value')

# Fix dtypes
df_20['year'] = df_20['year'].astype(int)
df_20['value'] = pd.to_numeric(df_20['value'], errors='coerce')
df_20 = df_20.dropna(subset=['value'])

# Add required columns
if 'category' not in df_20.columns: df_20['category'] = 'total'
if 'sex' not in df_20.columns:      df_20['sex'] = 'all'
df_20['indicator'] = 'mean_age_first_marriage'
df_20['unit'] = '%'
df_20['source'] = 'OECD'

df_20.sample(10)

,country,year,value,category,sex,indicator,unit,source
727,Czech Republic,1993,12.7,total,all,mean_age_first_marriage,%,OECD
279,Slovenia,1972,9.7,total,all,mean_age_first_marriage,%,OECD
492,Latvia,1982,13.2,total,all,mean_age_first_marriage,%,OECD
784,Slovak Republic,1995,12.6,total,all,mean_age_first_marriage,%,OECD
314,Hungary,1974,5.7,total,all,mean_age_first_marriage,%,OECD
856,Bulgaria,1998,31.5,total,all,mean_age_first_marriage,%,OECD
284,Bulgaria,1972,9.9,total,all,mean_age_first_marriage,%,OECD
822,Latvia,1997,34.8,total,all,mean_age_first_marriage,%,OECD
82,Spain,1963,1.9,total,all,mean_age_first_marriage,%,OECD
574,Denmark,1986,43.9,total,all,mean_age_first_marriage,%,OECD

In [6799]:


df_info = pd.DataFrame({
    'dtype': df_20.dtypes,
    'null_count': df_20.isnull().sum(),
    'unique_count': df_20.nunique()
})
print(df_info)

             dtype  null_count  unique_count
country     object           0            22
year         int32           0            61
value      float64           0           488
category    object           0             1
sex         object           0             1
indicator   object           0             1
unit        object           0             1
source      object           0             1

In [6800]:
#df_20.to_csv('../data/Cleaned/cleaned_share_of_births_outside_of_marriage_oecd.csv', index=False)

In [6801]:
#df_20.to_sql('share_of_births_outside_of_marriage_oecd',engine, if_exists='replace', index=False)

In [6802]:
df_21_1= pd.read_csv('../data/Raw/OECD/SF_3_1_Marriage_divorce_rate_mean_age_first_marriage_S1.csv')
#mean_age_first_marriage
df_21_1

,Country,Gender,1990,1991,1992,1993,1994,1995,1996,1997,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Australia,Male,"26,5","26,7","26,9","27,0","27,2","27,3","27,6","27,8",...,"29,7","29,8","29,9","30,0","30,1","30,3","30,4","30,7","30,7","30,6"
1,Australia,Female,"24,3","24,5","24,7","24,8","25,1","25,3","25,7","25,9",...,"28,0","28,1","28,3","28,4","28,5","28,7","28,8","29,2","29,3","29,2"
2,Czechia,Male,"24,3","24,3","24,5","24,7","25,1","25,5","25,9","26,5",...,"31,0","31,2","31,3","31,4","31,6","31,7","31,8","31,9","32,0","32,4"
3,Czechia,Female,"21,6","21,6","21,9","22,1","22,4","22,8","23,1","23,6",...,"28,1","28,3","28,5","28,7","28,8","29,0","29,1","29,2","29,4","29,7"
4,Denmark,Male,"30,5","30,6","31,0","31,4","31,8","31,9","32,5","32,2",...,"33,8","34,3","34,4","34,4","34,3","34,7","34,8","34,9","35,1","35,3"
5,Denmark,Female,"27,8","28,0","28,3","28,8","29,2","29,2","29,9","30,1",...,"31,4","31,8","31,9","31,9","31,9","32,2","32,4","32,5","32,8","33,0"
6,Greece,Male,"29,0","29,3","29,6","29,7","29,9","30,1","30,2","30,6",...,"32,7","32,8","32,9","33,0","33,2","33,2","33,3","33,4","33,7","33,8"
7,Greece,Female,"24,9","25,2","25,5","25,5","25,8","26,0","26,3","26,6",...,"29,4","29,5","29,7","29,9","30,1","30,1","30,3","30,3","30,7","30,7"
8,Japan,Male,"28,4","28,4","28,4","28,4","28,5","28,5","28,5","28,5",...,"30,7","30,8","30,9","31,1","31,1","31,1","31,1","31,1","31,2","31,0"
9,Japan,Female,"25,9","25,9","26,0","26,1","26,2","26,3","26,4","26,6",...,"29,0","29,2","29,3","29,4","29,4","29,4","29,4","29,4","29,6","29,4"
10,Korea,Male,"27,8","27,9","28,0","28,1","28,2","28,4","28,4","28,6",...,"31,9","32,1","32,2","32,4","32,6","32,8","32,9","33,2","33,4","33,2"
11,Korea,Female,"24,8","24,8","24,9","25,0","25,1","25,3","25,5","25,7",...,"29,1","29,4","29,6","29,8","30,0","30,1","30,2","30,4","30,6","30,8"
12,New Zealand,Male,"26,8","26,9","27,0","27,3","27,5","27,8","28,1","28,3",...,"29,9","30,0","30,1","30,2","30,2","30,3","30,2","30,4","30,6","30,6"
13,New Zealand,Female,"24,5","24,6","24,9","25,2","25,5","25,8","26,1","26,5",...,"28,4","28,5","28,6","28,7","28,8","29,0","29,0","29,2","29,4","29,5"
14,Slovenia,Male,"26,9","26,9","27,4","27,8","28,0","28,1","28,4","28,8",...,"32,0","32,1","32,3","32,2","32,3","32,6","32,9","33,7","33,9","33,6"
15,Slovenia,Female,"23,9","24,1","24,4","24,8","25,1","25,3","25,6","25,9",...,"29,4","29,4","29,6","29,7","30,0","30,3","30,4","31,2","31,2","31,1"
16,United Kingdom,Male,"27,2","27,5","27,9","28,2","28,5","28,9","29,3","29,6",...,"32,2","32,4","32,5","32,7","33,2","33,4","33,6","33,7","33,9",..
17,United Kingdom,Female,"25,2","25,5","25,9","26,2","26,5","26,8","27,2","27,5",...,"30,2","30,3","30,6","30,8","31,2","31,5","31,7","31,8","32,1",..
18,United States,Male,"26,1","26,3","26,5","26,5","26,7","26,9","27,1","26,8",...,"28,4","28,6","29,0","29,3","29,2","29,5","29,5","29,8","29,8","30,5"
19,United States,Female,"23,9","24,1","24,4","24,5","24,5","24,5","24,8","25,0",...,"26,4","26,6","26,6","27,0","27,1","27,4","27,4","27,8","28,0","28,1"

In [6803]:
df_info = pd.DataFrame({
    'datatypes': df_21_1.dtypes,
    'null_count': df_21_1.isnull().sum(),
    'unique_count': df_21_1.nunique()
})
print(df_info)

        datatypes  null_count  unique_count
Country    object           0            10
Gender     object           0             2
1990       object           0            17
1991       object           0            18
1992       object           0            18
1993       object           0            19
1994       object           0            16
1995       object           0            18
1996       object           0            19
1997       object           0            17
1998       object           0            14
1999       object           0            19
2000       object           0            18
2001       object           0            18
2002       object           0            19
2003       object           0            19
2004       object           0            16
2005       object           0            18
2006       object           0            18
2007       object           0            19
2008       object           0            18
2009       object           0            20
2010       object           0            18
2011       object           0            18
2012       object           0            18
2013       object           0            19
2014       object           0            19
2015       object           0            16
2016       object           0            16
2017       object           0            17
2018       object           0            16
2019       object           0            15
2020       object           0            18

In [6804]:
df_21_1.columns = df_21_1.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6805]:
# --- Ensure "country" and "gender" are strings
df_21_1["country"] = df_21_1["country"].astype(str).str.strip().str.title()
df_21_1["gender"] = df_21_1["gender"].astype(str).str.strip()

# --- Identify numeric columns: everything except country and birth order ---
num_cols = [c for c in df_21_1.columns if c not in ["country", "gender"]]
# --- Robust cleaning -> convert to float ---
df_21_1[num_cols] = (
    df_21_1[num_cols].astype(str)
    .replace({"\xa0": "", "\u202f": "", ",": "."}, regex=True)
    .replace(r"[^\d\.\-]", "", regex=True)
    .replace(r"\.\.+", ".", regex=True)
    .replace(r"^\.$|^\s*$", np.nan, regex=True)
    .apply(pd.to_numeric, errors="coerce")
)
df_21_1[num_cols] = df_21_1[num_cols].round(2)

In [6806]:
df_21_1.drop_duplicates(inplace=True)
df_21_1.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_21_1.dtypes,
    'null_count': df_21_1.isnull().sum(),
    'unique_count': df_21_1.nunique()
})
print(df_info)

        datatypes  null_count  unique_count
country    object           0             9
gender     object           0             2
1990      float64           0            15
1991      float64           0            16
1992      float64           0            16
1993      float64           0            17
1994      float64           0            15
1995      float64           0            16
1996      float64           0            17
1997      float64           0            15
1998      float64           0            13
1999      float64           0            17
2000      float64           0            16
2001      float64           0            16
2002      float64           0            17
2003      float64           0            17
2004      float64           0            15
2005      float64           0            17
2006      float64           0            17
2007      float64           0            17
2008      float64           0            16
2009      float64           0            18
2010      float64           0            16
2011      float64           0            16
2012      float64           0            16
2013      float64           0            17
2014      float64           0            17
2015      float64           0            15
2016      float64           0            14
2017      float64           0            15
2018      float64           0            15
2019      float64           0            14
2020      float64           0            17

In [6807]:
# Identify columns
id_cols = [c for c in ['country','category','sex'] if c in df_21_1.columns]
year_cols = [c for c in df_21_1.columns if re.fullmatch(r'\d{4}', c)]

# Melt wide → long
df_21_1 = df_21_1.melt(id_vars=id_cols, value_vars=year_cols,
                       var_name='year', value_name='value')

# Fix dtypes
df_21_1['year'] = df_21_1['year'].astype(int)
df_21_1['value'] = pd.to_numeric(df_21_1['value'], errors='coerce')
df_21_1 = df_21_1.dropna(subset=['value'])

# Add required columns
df_21_1['indicator'] = 'divorce_rates_per_1000'
df_21_1['unit'] = '‰'
df_21_1['source'] = 'OECD'

df_21_1

           country  year  value               indicator unit source
0        Australia  1990   26.5  divorce_rates_per_1000    ‰   OECD
1        Australia  1990   24.3  divorce_rates_per_1000    ‰   OECD
2          Czechia  1990   24.3  divorce_rates_per_1000    ‰   OECD
3          Czechia  1990   21.6  divorce_rates_per_1000    ‰   OECD
4          Denmark  1990   30.5  divorce_rates_per_1000    ‰   OECD
..             ...   ...    ...                     ...  ...    ...
553    New Zealand  2020   29.5  divorce_rates_per_1000    ‰   OECD
554       Slovenia  2020   33.6  divorce_rates_per_1000    ‰   OECD
555       Slovenia  2020   31.1  divorce_rates_per_1000    ‰   OECD
556  United States  2020   30.5  divorce_rates_per_1000    ‰   OECD
557  United States  2020   28.1  divorce_rates_per_1000    ‰   OECD

[558 rows x 6 columns]

In [6808]:
#df_21_1.to_csv('../data/Cleaned/cleaned_mean_age_first_marriage_oecd.csv',index=False)

In [6809]:
#df_21_1.to_sql('mean_age_first_marriage_oecd', engine, if_exists='replace', index= False)

In [6810]:
df_21_2 = pd.read_csv('../data/Raw/OECD/SF_3_1_Marriage_divorce_rates_S2.csv')
#divorce_rates_per_1000_oecd
df_21_2

,Country,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,Austria,"1,4","1,3","1,3","1,3","1,4","1,4","1,5","1,5","1,6",...,"1,9","1,9","1,9","1,8","1,8","1,8","1,8","1,7","1,6","1,5"
1,Belgium,"0,7","0,7","0,8","0,9","1,0","1,1","1,3","1,3","1,4",...,"2,2","2,2","2,2","2,1","2,0","2,0","2,0","1,8","1,9","1,7"
2,Czechia,"2,2","2,4","2,3","2,5","2,5","2,6","2,5","2,5","2,6",...,"2,7","2,5","2,5","2,4","2,4","2,3","2,3","2,0","2,0","1,9"
3,Denmark,"1,9","2,7","2,6","2,5","2,6","2,6","2,6","2,6","2,6",...,"3,4","3,4","2,9","3,0","2,6","2,6","1,8","2,7","2,2","2,1"
4,Estonia,"3,2","3,2","3,3","3,2","3,3","3,4","3,6","3,9","3,8",...,"2,5","2,4","2,6","2,5","2,5","2,4","2,1","1,9",NaN,"1,9"
5,Finland,"1,3","1,6","1,8","1,9","2,1","2,0","2,1","2,1","2,2",...,"2,5","2,5","2,5","2,5","2,4","2,4","2,4","2,4","2,2","2,0"
6,Germany,"1,3","1,4","1,5","1,6","1,8","1,9","2,0","1,5","1,0",...,"2,1","2,1","2,0","2,0","1,9","1,8","1,8","1,7","1,7","1,6"
7,Greece,"0,4","0,4","0,4","0,5","0,4","0,4","0,4","0,5","0,5",...,"1,5","1,3","1,4","1,0","1,8",NaN,NaN,NaN,NaN,NaN
8,Hungary,"2,2","2,3","2,3","2,4","2,3","2,5","2,6","2,6","2,7",...,"2,0","2,0","2,1","2,0","1,9","1,7","1,8","1,5","1,9","1,8"
9,Italy,..,"0,3","0,6","0,3","0,3","0,2","0,2","0,2","0,2",...,"0,9","0,9","1,4","1,6","1,5","1,5","1,4","1,1","1,4","1,4"
10,Japan,"0,9","1,0","1,0","1,0","1,0","1,1","1,1","1,1","1,2",...,"1,8","1,8","1,8","1,7","1,7","1,7","1,7","1,6","1,47","1,52"
11,Korea,"0,4","0,3","0,4","0,4","0,4","0,5","0,5","0,6","0,5",...,"2,3","2,3","2,1","2,1","2,1","2,1","2,2","2,1","2,0","1,8"
12,Latvia,"4,6","4,6","4,5","4,8","4,9","4,8","5,0","5,1","5,1",...,"3,5","3,1","2,6","3,1","3,1","3,1","3,1","2,7","2,5","2,9"
13,Lithuania,"2,2","2,2","2,3","2,5","2,5","2,7","2,9","3,1","3,0",...,"3,4","3,3","3,2","3,1","3,0","3,1","3,1","2,7","2,8","2,6"
14,Luxembourg,"0,6","0,7","0,8","0,8","0,8","0,6","1,0","1,1","1,5",...,"2,1","2,6","2,4","2,1","2,0","2,0","3,1","2,3","2,2","1,9"
15,Netherlands,"0,8","0,9","1,1","1,3","1,4","1,5","1,5","1,6","1,6",...,"2,0","2,1","2,0","2,0","1,9","1,8","1,7","1,7","1,5","1,3"
16,Norway,"0,9","1,0","1,0","1,2","1,3","1,4","1,4","1,5","1,5",...,"2,0","1,9","1,9","1,9","2,0","1,9","1,9","1,8","1,6","1,5"
17,Poland,"1,1","1,1","1,1","1,2","1,2","1,2","1,1","1,2","1,0",...,"1,7","1,7","1,8","1,7","1,7","1,7","1,7","1,4","1,7","1,6"
18,Portugal,"0,1","0,1","0,1","0,1","0,1","0,2","0,5","0,8","0,7",...,"2,2","2,1","2,3","2,2","2,1","2,0","2,0","1,7","1,7","1,8"
19,Slovakia,"0,8","1,0","0,9","0,9","1,2","1,3","1,3","1,2","1,3",...,"2,0","1,9","1,8","1,7","1,8","1,8","1,7","1,5","1,5","1,5"
20,Slovenia,"1,1","1,1","1,1","1,2","1,2","1,2","1,2","1,3","1,4",...,"1,1","1,2","1,2","1,2","1,2","1,1","1,2","0,8","1,1","1,0"
21,Sweden,"1,6","1,7","1,9","2,0","3,3","3,1","2,6","2,5","2,5",...,"2,8","2,7","2,5","2,4","2,4","2,5","2,5","2,5","2,3","2,1"
22,Switzerland,"1,0","1,1","1,2","1,3","1,3","1,4","1,5","1,7","1,7",...,"2,1","2,0","2,1","2,0","1,9","1,9","2,0","1,9","2,0","1,8"
23,United Kingdom,"1,0","1,3","2,1","1,9","2,0","2,1","2,3","2,3","2,6",...,"2,0","1,9","1,7","1,8","1,7","1,5","1,8","1,7",NaN,NaN
24,Bulgaria,"1,2","1,1","1,2","1,3","1,3","1,3","1,3","1,5","1,4",...,"1,5","1,5","1,5","1,5","1,5","1,5","1,6","1,3","1,5","1,4"
25,Croatia,"1,2","1,2","1,3","1,3","1,4","1,3","1,3","1,2","1,3",...,"1,4","1,4","1,4","1,7","1,5","1,5","1,5","1,3","1,3","1,2"
26,Cyprus,"0,2","0,3","0,2","0,2","0,2","0,2","0,2","0,3","0,3",...,"2,2","2,2","2,1","2,3","2,2","2,4","2,6",..,..,:
27,Romania,"0,4","0,5","0,5","0,7","0,9","1,6","1,7","1,2","1,5",...,"1,4","1,4","1,6","1,5","1,6","1,6","1,6","1,2","1,4","1,2"

In [6811]:
df_info = pd.DataFrame({
    'datatypes': df_21_2.dtypes,
    'null_count': df_21_2.isnull().sum(),
    'unique_count': df_21_2.nunique()
})
print(df_info)

        datatypes  null_count  unique_count
Country    object           0            28
1970       object           0            18
1971       object           0            19
1972       object           0            19
1973       object           0            18
1974       object           0            18
1975       object           0            19
1976       object           0            18
1977       object           0            18
1978       object           0            18
1979       object           0            15
1980       object           0            18
1981       object           0            20
1982       object           0            22
1983       object           0            24
1984       object           0            20
1985       object           0            19
1986       object           0            20
1987       object           0            20
1988       object           0            20
1989       object           0            19
1990       object           0            18
1991       object           0            21
1992       object           0            21
1993       object           0            18
1994       object           0            19
1995       object           0            23
1996       object           0            21
1997       object           0            18
1998       object           0            20
1999       object           0            19
2000       object           0            18
2001       object           0            17
2002       object           0            17
2003       object           0            19
2004       object           0            18
2005       object           0            18
2006       object           0            15
2007       object           0            16
2008       object           0            17
2009       object           0            16
2010       object           0            15
2011       object           0            16
2012       object           0            15
2013       object           0            16
2014       object           0            19
2015       object           0            16
2016       object           0            15
2017       object           0            14
2018       object           1            13
2019       object           1            15
2020       object           1            17
2021       object           3            14
2022       object           2            15

In [6812]:
df_21_2.columns = df_21_2.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [6813]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_21_2.columns if c != "country"]

df_21_2[num_cols] = (
    df_21_2[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6814]:
df_21_2.drop_duplicates(inplace=True)
df_21_2.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_21_2.dtypes,
    'null_count': df_21_2.isnull().sum(),
    'unique_count': df_21_2.nunique()
})
print(df_info)

        datatypes  null_count  unique_count
country    object           0            23
1970      float64           0            15
1971      float64           0            17
1972      float64           0            15
1973      float64           0            14
1974      float64           0            15
1975      float64           0            16
1976      float64           0            14
1977      float64           0            13
1978      float64           0            15
1979      float64           0            12
1980      float64           0            14
1981      float64           0            17
1982      float64           0            17
1983      float64           0            19
1984      float64           0            16
1985      float64           0            15
1986      float64           0            16
1987      float64           0            16
1988      float64           0            15
1989      float64           0            15
1990      float64           0            15
1991      float64           0            18
1992      float64           0            17
1993      float64           0            15
1994      float64           0            16
1995      float64           0            20
1996      float64           0            16
1997      float64           0            14
1998      float64           0            17
1999      float64           0            16
2000      float64           0            16
2001      float64           0            14
2002      float64           0            15
2003      float64           0            17
2004      float64           0            14
2005      float64           0            15
2006      float64           0            14
2007      float64           0            13
2008      float64           0            15
2009      float64           0            14
2010      float64           0            14
2011      float64           0            15
2012      float64           0            14
2013      float64           0            15
2014      float64           0            16
2015      float64           0            15
2016      float64           0            12
2017      float64           0            12
2018      float64           0            13
2019      float64           0            12
2020      float64           0            15
2021      float64           0            13
2022      float64           0            14

In [6815]:
# Identify columns
id_cols = [c for c in ['country','category','sex'] if c in df_21_2.columns]
year_cols = [c for c in df_21_2.columns if re.fullmatch(r'\d{4}', c)]

# Melt wide → long
df_21_2 = df_21_2.melt(id_vars=id_cols, value_vars=year_cols,
                       var_name='year', value_name='value')

# Fix dtypes
df_21_2['year'] = df_21_2['year'].astype(int)
df_21_2['value'] = pd.to_numeric(df_21_2['value'], errors='coerce')
df_21_2 = df_21_2.dropna(subset=['value'])

# Add required columns
if 'category' not in df_21_2.columns: df_21_2['category'] = 'total'
if 'sex' not in df_21_2.columns:      df_21_2['sex'] = 'all'
df_21_2['indicator'] = 'mean_age_first_marriage'
df_21_2['unit'] = '‰'
df_21_2['source'] = 'OECD'
df_21_2

,country,year,value,category,sex,indicator,unit,source
0,Austria,1970,1.4,total,all,mean_age_first_marriage,‰,OECD
1,Belgium,1970,0.7,total,all,mean_age_first_marriage,‰,OECD
2,Czechia,1970,2.2,total,all,mean_age_first_marriage,‰,OECD
3,Denmark,1970,1.9,total,all,mean_age_first_marriage,‰,OECD
4,Finland,1970,1.3,total,all,mean_age_first_marriage,‰,OECD
...,...,...,...,...,...,...,...,...
1214,Sweden,2022,2.1,total,all,mean_age_first_marriage,‰,OECD
1215,Switzerland,2022,1.8,total,all,mean_age_first_marriage,‰,OECD
1216,Bulgaria,2022,1.4,total,all,mean_age_first_marriage,‰,OECD
1217,Croatia,2022,1.2,total,all,mean_age_first_marriage,‰,OECD
1218,Romania,2022,1.2,total,all,mean_age_first_marriage,‰,OECD

In [6816]:
#df_21_2.to_csv('../data/Cleaned/cleaned_divorce_rates_per_1000_oecd.csv', index=False)

In [6817]:
#df_21_2.to_sql('divorce_rates_per_1000_oecd',engine, if_exists= 'replace' , index=False)

In [6818]:
df_21_3= pd.read_csv('../data/Raw/OECD/SF_3_1_Marriage_divorce_rates_prev_marital_status_S3.csv')
#share_of_previous_marital_status
df_21_3.sample

<bound method NDFrame.sample of             Country Previous marital status  2000  2001  2002  2003  2004  \
0         Australia    Single never married  75,9  76,1  75,5  75,6  76,2
1         Australia                Divorced  22,0  21,8  22,4  22,3  21,8
2         Australia                 Widowed   2,1   2,1   2,1   2,1   1,9
3           Austria    Single never married  76,6  74,7  74,1  73,7  72,9
4           Austria                Divorced  22,2  24,2  24,7  25,2  25,9
5           Austria                 Widowed   1,2   1,1   1,2   1,1   1,2
6           Czechia    Single never married  74,9  74,5  74,3  74,0  73,9
7           Czechia                Divorced  23,7  24,2  24,4  24,7  24,7
8           Czechia                 Widowed   1,4   1,3   1,3   1,3   1,4
9           Denmark    Single never married  75,9  76,0  76,2  76,4  76,0
10          Denmark                Divorced  22,0  21,9  21,8  21,7  22,1
11          Denmark                 Widowed   2,1   2,1   2,0   2,0   1,9
12          Finland    Single never married  77,8  77,0  77,2  77,4  76,8
13          Finland                Divorced  20,7  21,4  21,4  21,1  21,8
14          Finland                 Widowed   1,5   1,6   1,4   1,4   1,4
15           Greece    Single never married  88,4  88,9  88,5  88,4  88,1
16           Greece                Divorced  10,2  10,0   5,9  10,6  11,0
17           Greece                 Widowed   1,4   1,1   5,6   1,0   0,9
18          Hungary    Single never married  79,3  77,3  78,1  78,4  78,0
19          Hungary                Divorced  19,2  21,0  20,3  20,1  20,4
20          Hungary                 Widowed   1,6   1,7   1,6   1,5   1,5
21        Lithuania    Single never married  79,1  78,8  78,9  79,3  78,1
22        Lithuania                Divorced  18,6  19,1  19,2  18,7  20,0
23        Lithuania                 Widowed   2,4   2,1   1,8   2,0   1,8
24       Luxembourg    Single never married  76,3  75,3  76,1  74,0  75,6
25       Luxembourg                Divorced  22,5  23,4  22,5  24,5  23,2
26       Luxembourg                 Widowed   1,2   1,2   1,4   1,5   1,2
27      New Zealand    Single never married  73,6  73,5  73,8  73,9  73,9
28      New Zealand                Divorced  23,9  23,5  23,5  23,5  23,4
29      New Zealand                 Widowed   2,5   2,9   2,7   2,5   2,7
30           Poland    Single never married  90,2  90,4  90,4  90,4  90,7
31           Poland                Divorced   7,3   7,1   7,2   7,3   7,1
32           Poland                 Widowed   2,5   2,5   2,3   2,2   2,1
33         Portugal    Single never married  91,2  90,3  90,5  88,9  88,0
34         Portugal                Divorced   7,6   8,4   8,4   9,9  10,7
35         Portugal                 Widowed   1,3   1,4   1,1   1,2   1,2
36  Slovak Republic    Single never married  88,8  88,1  87,7  87,7  89,2
37  Slovak Republic                Divorced  10,3  11,0  11,4  11,4  10,0
38  Slovak Republic                 Widowed   0,9   0,9   0,9   0,9   0,8
39         Slovenia    Single never married  90,2  90,8  89,7  90,4  90,1
40         Slovenia                Divorced   8,4   7,9   8,9   8,4   8,7
41         Slovenia                 Widowed   1,4   1,3   1,4   1,2   1,2
42            Spain    Single never married  94,0  93,6  93,1  92,5  91,6
43            Spain                Divorced   5,3   5,8   6,2   6,7   7,7
44            Spain                 Widowed   0,7   0,7   0,7   0,8   0,7
45           Sweden    Single never married  78,4  76,9  77,1  77,8  77,1
46           Sweden                Divorced  20,6  22,0  21,9  21,4  21,9
47           Sweden                 Widowed   0,9   1,1   1,0   0,8   0,9
48      Switzerland    Single never married  78,0  77,9  77,9  77,4  77,2
49      Switzerland                Divorced  20,7  20,9  20,9  21,3  21,6
50      Switzerland                 Widowed   1,3   1,3   1,2   1,3   1,2
51         Bulgaria    Single never married  87,5  88,1  88,9  88,1  87,8
52         Bulgaria                Divorced  11,4  10,9  10,2  10,9  11,2
53         Bulgaria                 Widowed   1,1   1,0   0,9   1,0   1,0
54          Croatia    Single never married  90,8  90,6  90,9  91,0  91,0
55          Croatia                Divorced   7,6   7,6   7,6   7,6   7,6
56          Croatia                 Widowed   1,6   1,8   1,5   1,5   1,4
57          Romania    Single never married  85,4  85,1  85,2  85,3  85,3
58          Romania                Divorced  12,9   7,8  13,1  13,0  13,2
59          Romania                 Widowed   1,8   7,1   1,7   1,6   1,6

    2005  2006  2008  ...  2010  2011  2012  2013  2014  2015  2016  2017  \
0   76,9  77,3  78,2  ...  79,6  79,7  80,0  80,5  80,5  80,1  80,3  80,1
1   21,3  20,9  20,2  ...  19,0  18,8  18,6  18,2  18,1  18,5  18,3  18,5
2    1,8   1,8   1,7  ...   1,5   1,5   1,4   1,3   1,4   1,4   1,4   1,4
3   73,1  73,9  74,8  ...  75,5  75,7  76,7  77,1  77,5  77,7  78,1  78,1
4   25,7  24,9  24,2  ...  23,5  23,4  22,3  22,0  21,5  21,5  20,9  21,0
5    1,2   1,1   1,0  ...   1,0   0,9   1,0   0,9   1,0   0,8   0,9   0,9
6   74,2  74,5  72,6  ...  74,0  74,0  75,2  75,6  76,6  76,7  76,4  76,4
7   24,5  24,4  26,1  ...  24,9  24,9  23,8  23,4  22,4  22,3  22,6  22,6
8    1,2   1,1   1,3  ...   1,2   1,1   1,0   1,0   1,0   1,0   1,0   1,0
9   75,6  75,6  76,3  ...  77,2  76,0  75,0  76,2  76,1  76,9  76,4  77,1
10  22,2  22,4  21,8  ...  21,0  22,1  23,0  22,0  22,3  21,4  21,9  21,3
11   2,2   1,9   1,9  ...   1,8   1,9   1,9   1,8   1,6   1,7   1,7   1,6
12  77,2  77,0  77,0  ...  77,3  76,3  75,9  76,5  76,6  75,3  74,9  73,7
13  21,5  21,6  21,7  ...  21,4  22,4  22,7  22,3  22,1  23,4  23,8  25,0
14   1,3   1,4   1,3  ...   1,3   1,3   1,4   1,3   1,3   1,3   1,3   1,3
15  88,3  87,6  87,9  ...  88,2  88,6  88,5  87,9  87,7  87,4  87,8  88,3
16  10,9  11,6  11,2  ...  11,1  10,8   5,7  11,4  11,5  11,9  11,5  11,3
17   0,8   0,9   0,8  ...   0,7   0,7   5,8   0,7   0,7   0,7   0,7   0,4
18  78,8  78,3  77,6  ...  76,6  75,8  76,4  76,3  76,3  77,9  78,5  78,1
19  19,8  20,4  21,0  ...  21,9  22,7  22,2  22,3  22,2  20,8  20,2  20,5
20   1,4   1,3   1,4  ...   1,4   1,5   1,4   1,3   1,5   1,3   1,3   1,4
21  77,9  77,5  77,3  ...  79,3  78,2  78,8  78,4  77,8  78,1  76,8  76,4
22  20,2  20,5  21,0  ...  19,1  20,2  19,6  20,0  20,7  20,5  21,6  22,0
23   1,9   2,0   1,7  ...   1,6   1,6   1,6   1,6   1,6   1,4   1,6   1,6
24  74,8  74,5  75,9  ...  76,2  77,9  76,8  74,9  75,6  75,3  74,3  75,5
25  24,2  24,4  23,1  ...  22,6  20,9  21,7  23,4  23,4  23,7  24,8  23,4
26   1,1   1,0   1,0  ...   1,3   1,2   1,5   1,7   1,0   1,0   0,9   1,2
27  74,1  75,0  76,4  ...  77,9  78,0  77,7  77,8  78,1  78,2  79,0  79,4
28  23,3  22,6  21,3  ...  19,9  19,8  20,1  19,8  19,6  19,7  19,0  18,5
29   2,6   2,3   2,4  ...   2,2   2,2   2,1   2,4   2,3   2,1   2,0   2,0
30  90,5  89,9  89,4  ...  89,3  88,7  88,4  87,3  87,2  86,8  86,2  85,7
31   7,6   8,3   1,7  ...   9,1   9,6   9,9  10,9  11,0  11,5  12,0  12,5
32   1,9   1,8   8,9  ...   1,6   1,7   1,7   1,8   1,8   1,8   1,8   1,8
33  87,2  86,0  84,0  ...  82,0  80,6  80,9  80,2  79,5  79,4  78,4  77,3
34  11,6  12,8  14,9  ...  16,8  18,3  18,0  18,7  19,5  19,6  20,5  21,5
35   1,2   1,2   1,2  ...   1,2   1,1   1,1   1,1   1,0   1,1   1,1   1,1
36  87,6  86,4  86,3  ...  87,0  86,6  86,2  86,1  86,1  86,7  86,2  86,0
37  11,6  13,0  13,0  ...  12,3  12,7  13,2  13,3  13,3  12,7  13,3  13,5
38   0,7   0,7   0,7  ...   0,7   0,7   0,6   0,6   0,6   0,6   0,5   0,5
39  91,7  90,2  90,5  ...  89,3  89,9  89,5  90,0  89,9  89,6  89,0  90,1
40   7,2   8,6   8,5  ...   7,8   9,0   9,6   8,9   9,1   9,5  10,0   9,1
41   1,0   1,3   1,1  ...   2,8   1,1   0,9   1,0   1,0   0,9   0,9   0,8
42  91,2  89,9  88,3  ...  85,9  85,4  85,3  84,2  84,3  83,8  83,0  82,3
43   8,1   9,3  11,0  ...  13,3  13,8  13,9  15,0  14,9  15,5  16,2  16,9
44   0,7   0,7   0,7  ...   0,8   0,8   0,8   0,8   0,8   0,8   0,8   0,8
45  78,1  78,7  78,4  ...  78,9  79,3  78,7  77,4  77,6  78,0  78,0  78,6
46  21,0  20,3  20,6  ...  20,1  19,8  20,3  21,6  21,4  21,0  20,9  20,4
47   0,9   1,0   1,0  ...   1,0   0,9   1,0   1,0   1,0   1,0   1,0   1,0
48  77,1  77,1  77,3  ...  78,1  78,0  79,0  79,1  79,7  79,7  80,3  80,4
49  21,7  21,8  21,6  ...  21,0  21,0  20,0  19,9  19,4  19,4  18,8  18,6
50   1,1   1,1   1,1  ...   1,0   0,9   1,0   1,0   0,9   0,9   0,9   0,9
51  87,4  87,8  88,6  ...  88,0  88,1  88,1  88,1  88,2  88,7  88,7  87,6
52  11,7  11,3  10,6  ...  11,1  11,0  11,1  11,2  11,0  10,6  10,6  11,7
53   0,9   0,9   0,8  ...   0,8   0,8   0,7   0,8   0,8   0,7   0,7   0,8
54  91,4  91,0  91,4  ...  91,4  91,2  90,8  89,9  89,1  88,5  88,3  88,3
55   7,3   7,7   7,5  ...   7,6   7,8   8,2   9,0   9,8  10,4  10,7  10,5
56   1,3   1,3   1,1  ...   1,0   0,9   1,0   1,1   1,1   1,1   1,1   1,2
57  84,7  84,7  85,6  ...  86,5  85,5  85,3  85,1  85,8  85,6  85,3  85,4
58  13,8  13,8  13,0  ...  12,4  13,3  13,4  13,7  13,1  13,3  13,6  13,5
59   1,5   1,5   1,4  ...   1,1   1,3   1,2   1,2   1,1   1,1   1,1   1,1

    2018  2019
0   80,3  80,7
1   18,3  18,0
2    1,3   1,3
3   78,2  78,0
4   21,0  21,6
5    0,8   0,4
6   76,1  75,9
7   22,9  23,0
8    1,0   1,1
9   77,6  78,3
10  21,0  20,4
11   1,4   1,4
12  76,0  73,9
13  22,7  24,9
14   1,3   1,2
15  87,8  87,2
16  11,7  12,2
17   0,6   0,6
18  78,3  81,8
19  20,3  17,0
20   1,4   1,2
21  75,7  74,8
22  22,7  23,6
23   1,6   1,6
24  76,9  77,3
25  22,2  21,8
26   0,9   0,9
27  79,5  80,0
28  18,3  17,8
29   2,1   2,1
30  85,2  84,2
31  13,0  13,9
32   1,7   1,9
33  76,7  75,4
34  22,0  23,4
35   1,2   1,2
36  85,6  85,7
37  13,9  13,8
38   0,5   0,5
39  88,4  88,7
40  10,5  10,3
41   1,0   1,0
42  81,6  80,5
43  17,6  18,6
44   0,8   0,8
45  79,0  78,7
46  20,0  20,3
47   1,0   1,0
48  80,9  80,9
49  18,2  18,7
50   0,9   0,9
51  87,7  87,0
52  11,6  12,2
53   0,7   0,8
54  87,5  87,6
55  11,3  11,4
56   1,2   1,0
57  85,0  83,3
58  13,9  15,3
59   1,1   1,4

[60 rows x 21 columns]>

In [6819]:
df_info = pd.DataFrame({
    'datatypes': df_21_3.dtypes,
    'null_count': df_21_3.isnull().sum(),
    'unique_count': df_21_3.nunique()
})
print(df_info)

                        datatypes  null_count  unique_count
Country                    object           0            20
Previous marital status    object           0             3
2000                       object           0            47
2001                       object           0            51
2002                       object           0            56
2003                       object           0            50
2004                       object           0            50
2005                       object           0            52
2006                       object           0            49
2008                       object           0            47
2009                       object           0            50
2010                       object           0            49
2011                       object           0            49
2012                       object           0            53
2013                       object           0            49
2014                       object           0            50
2015                       object           0            50
2016                       object           0            48
2017                       object           0            47
2018                       object           0            49
2019                       object           0            52

In [6820]:
df_21_3.columns = df_21_3.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)

df_21_3.head()

,country,previous_marital_status,2000,2001,2002,2003,2004,2005,2006,2008,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Australia,Single never married,"75,9","76,1","75,5","75,6","76,2","76,9","77,3","78,2",...,"79,6","79,7","80,0","80,5","80,5","80,1","80,3","80,1","80,3","80,7"
1,Australia,Divorced,"22,0","21,8","22,4","22,3","21,8","21,3","20,9","20,2",...,"19,0","18,8","18,6","18,2","18,1","18,5","18,3","18,5","18,3","18,0"
2,Australia,Widowed,"2,1","2,1","2,1","2,1","1,9","1,8","1,8","1,7",...,"1,5","1,5","1,4","1,3","1,4","1,4","1,4","1,4","1,3","1,3"
3,Austria,Single never married,"76,6","74,7","74,1","73,7","72,9","73,1","73,9","74,8",...,"75,5","75,7","76,7","77,1","77,5","77,7","78,1","78,1","78,2","78,0"
4,Austria,Divorced,"22,2","24,2","24,7","25,2","25,9","25,7","24,9","24,2",...,"23,5","23,4","22,3","22,0","21,5","21,5","20,9","21,0","21,0","21,6"

In [6821]:
# --- Ensure id cols are strings
df_21_3["country"] = df_21_3["country"].astype(str).str.strip().str.title()
df_21_3["previous_marital_status"] = df_21_3["previous_marital_status"].astype(str).str.strip()

# --- Identify numeric columns
id_cols = {"country", "previous_marital_status"}
num_cols = [c for c in df_21_3.columns if c not in id_cols]

# --- Clean numeric cols
for c in num_cols:
    s = df_21_3[c].astype(str)

    # Normalize spaces & decimal separator
    s = (s.replace({"\xa0": "", "\u202f": ""}, regex=True)   # remove no-break/narrow spaces
           .str.replace(",", ".", regex=False))              # comma → dot

    # Keep only digits, dot, minus; collapse multiple dots
    s = (s.str.replace(r"[^\d\.\-]", "", regex=True)
           .str.replace(r"\.\.+", ".", regex=True)
           .str.replace(r"^\.$|^\s*$", "", regex=True))      # lone dot/empty → ""

    # Convert to numeric ("" → NaN)
    df_21_3[c] = pd.to_numeric(s, errors="coerce")

# --- Round numeric cols
df_21_3[num_cols] = df_21_3[num_cols].round(2)

# --- Round after numeric conversion
df_21_3[num_cols] = df_21_3[num_cols].round(2)

In [6822]:
df_21_3.head()

,country,previous_marital_status,2000,2001,2002,2003,2004,2005,2006,2008,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Australia,Single never married,75.9,76.1,75.5,75.6,76.2,76.9,77.3,78.2,...,79.6,79.7,80.0,80.5,80.5,80.1,80.3,80.1,80.3,80.7
1,Australia,Divorced,22.0,21.8,22.4,22.3,21.8,21.3,20.9,20.2,...,19.0,18.8,18.6,18.2,18.1,18.5,18.3,18.5,18.3,18.0
2,Australia,Widowed,2.1,2.1,2.1,2.1,1.9,1.8,1.8,1.7,...,1.5,1.5,1.4,1.3,1.4,1.4,1.4,1.4,1.3,1.3
3,Austria,Single never married,76.6,74.7,74.1,73.7,72.9,73.1,73.9,74.8,...,75.5,75.7,76.7,77.1,77.5,77.7,78.1,78.1,78.2,78.0
4,Austria,Divorced,22.2,24.2,24.7,25.2,25.9,25.7,24.9,24.2,...,23.5,23.4,22.3,22.0,21.5,21.5,20.9,21.0,21.0,21.6

In [6823]:
df_21_3.drop_duplicates(inplace=True)
df_21_3.dropna(inplace=True)

df_info = pd.DataFrame({
    'datatypes': df_21_3.dtypes,
    'null_count': df_21_3.isnull().sum(),
    'unique_count': df_21_3.nunique()
})
print(df_info)

                        datatypes  null_count  unique_count
country                    object           0            20
previous_marital_status    object           0             3
2000                      float64           0            47
2001                      float64           0            51
2002                      float64           0            56
2003                      float64           0            50
2004                      float64           0            50
2005                      float64           0            52
2006                      float64           0            49
2008                      float64           0            47
2009                      float64           0            50
2010                      float64           0            49
2011                      float64           0            49
2012                      float64           0            53
2013                      float64           0            49
2014                      float64           0            50
2015                      float64           0            50
2016                      float64           0            48
2017                      float64           0            47
2018                      float64           0            49
2019                      float64           0            52

In [6824]:
df_21_3.sample(10)

,country,previous_marital_status,2000,2001,2002,2003,2004,2005,2006,2008,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
51,Bulgaria,Single never married,87.5,88.1,88.9,88.1,87.8,87.4,87.8,88.6,...,88.0,88.1,88.1,88.1,88.2,88.7,88.7,87.6,87.7,87.0
8,Czechia,Widowed,1.4,1.3,1.3,1.3,1.4,1.2,1.1,1.3,...,1.2,1.1,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.1
39,Slovenia,Single never married,90.2,90.8,89.7,90.4,90.1,91.7,90.2,90.5,...,89.3,89.9,89.5,90.0,89.9,89.6,89.0,90.1,88.4,88.7
28,New Zealand,Divorced,23.9,23.5,23.5,23.5,23.4,23.3,22.6,21.3,...,19.9,19.8,20.1,19.8,19.6,19.7,19.0,18.5,18.3,17.8
45,Sweden,Single never married,78.4,76.9,77.1,77.8,77.1,78.1,78.7,78.4,...,78.9,79.3,78.7,77.4,77.6,78.0,78.0,78.6,79.0,78.7
37,Slovak Republic,Divorced,10.3,11.0,11.4,11.4,10.0,11.6,13.0,13.0,...,12.3,12.7,13.2,13.3,13.3,12.7,13.3,13.5,13.9,13.8
30,Poland,Single never married,90.2,90.4,90.4,90.4,90.7,90.5,89.9,89.4,...,89.3,88.7,88.4,87.3,87.2,86.8,86.2,85.7,85.2,84.2
20,Hungary,Widowed,1.6,1.7,1.6,1.5,1.5,1.4,1.3,1.4,...,1.4,1.5,1.4,1.3,1.5,1.3,1.3,1.4,1.4,1.2
43,Spain,Divorced,5.3,5.8,6.2,6.7,7.7,8.1,9.3,11.0,...,13.3,13.8,13.9,15.0,14.9,15.5,16.2,16.9,17.6,18.6
23,Lithuania,Widowed,2.4,2.1,1.8,2.0,1.8,1.9,2.0,1.7,...,1.6,1.6,1.6,1.6,1.6,1.4,1.6,1.6,1.6,1.6

In [6825]:
year_cols = [c for c in df_21_3.columns if re.fullmatch(r"\d{4}", str(c))]

# Wide → Long
df_21_3 = df_21_3.melt(
    id_vars=["country", "previous_marital_status"],
    value_vars=year_cols,
    var_name="year",
    value_name="value"
)

df_21_3["year"] = df_21_3["year"].astype(int)
df_21_3["value"] = pd.to_numeric(df_21_3["value"], errors="coerce")
df_21_3 = df_21_3.dropna(subset=["value"])

# Standardize
df_21_3 = df_21_3.rename(columns={"previous_marital_status": "category"})
df_21_3["sex"] = "all"
df_21_3["indicator"] = "share_of_previous_marital_status"
df_21_3["unit"] = "%"
df_21_3["source"] = "OECD"

# Final column order
df_21_3 = df_21_3[["country","year","indicator","category","sex","unit","value","source"]]

df_21_3.sample(15)

,country,year,indicator,category,sex,unit,value,source
505,Luxembourg,2009,share_of_previous_marital_status,Divorced,all,%,24.6,OECD
489,Denmark,2009,share_of_previous_marital_status,Single never married,all,%,76.6,OECD
745,Luxembourg,2013,share_of_previous_marital_status,Divorced,all,%,23.4,OECD
284,Spain,2004,share_of_previous_marital_status,Widowed,all,%,0.7,OECD
851,Denmark,2015,share_of_previous_marital_status,Widowed,all,%,1.7,OECD
33,Portugal,2000,share_of_previous_marital_status,Single never married,all,%,91.2,OECD
502,Lithuania,2009,share_of_previous_marital_status,Divorced,all,%,19.6,OECD
87,New Zealand,2001,share_of_previous_marital_status,Single never married,all,%,73.5,OECD
874,Portugal,2015,share_of_previous_marital_status,Divorced,all,%,19.6,OECD
286,Sweden,2004,share_of_previous_marital_status,Divorced,all,%,21.9,OECD
371,Denmark,2006,share_of_previous_marital_status,Widowed,all,%,1.9,OECD
147,New Zealand,2002,share_of_previous_marital_status,Single never married,all,%,73.8,OECD
266,Luxembourg,2004,share_of_previous_marital_status,Widowed,all,%,1.2,OECD
459,Slovenia,2008,share_of_previous_marital_status,Single never married,all,%,90.5,OECD
349,Switzerland,2005,share_of_previous_marital_status,Divorced,all,%,21.7,OECD

In [6826]:
#df_21_3.to_csv('../data/Cleaned/cleaned_share_of_previous_marital_status_oecd.csv', index=False)

In [6827]:
#df_21_3.to_sql('share_of_previous_marital_status_oecd', engine, if_exists= 'replace', index =  False)

In [6828]:
df_22_1 = pd.read_csv('../data/Raw/OECD/SF3_3_A_in_private_households_by_partnership_status_S1.csv')
#hauseholds_by_partnership_status_oecd
df_22_1

,Country,20+_All_Total_Living_with_a_partner(%),20+_All_Married or in a civil or registered partnership_living_with_a_partner(%),20+_All_Cohabiting_living_with_a_partner(%),20+_All_Not living with a partner(%),20/34_Total_living_with_a_partner(%),20/34_Married or in a civil or registered partnership_living_with_a_partner(%),20/34_Cohabiting_living_with_a_partner(%),Not living with a partner_Total(%),Living with at least one parent(%)
0,Australia (c),"63,79","53,59","10,20","36,21","47,06","29,41","17,65","52,94",..
1,Austria,"58,80","49,10","9,70","41,20","39,11","22,15","16,97","60,89","33,82"
2,Belgium,"62,15","53,51","8,64","37,85","45,28","29,33","15,94","54,72","31,34"
3,Canada (d),"66,89","54,46","12,43","33,11","55,34","33,55","21,79","44,66",..
4,Czech Republic,"51,17","45,39","5,79","48,83","30,78","21,32","9,46","69,22","36,20"
5,Denmark,"64,15","50,02","14,12","35,85","50,54","21,86","28,68","49,46","10,67"
6,Estonia,"53,93","37,30","16,64","46,07","45,31","17,81","27,50","54,69","26,46"
7,France,"64,14","49,41","14,72","35,86","50,42","21,89","28,53","49,58","22,08"
8,Germany,"62,61","53,91","8,69","37,39","39,53","22,15","17,39","59,74","27,54"
9,Greece,"60,23","58,52","1,71","39,77","33,13","29,24","3,90","66,87","45,43"
10,Hungary,"56,15","45,83","10,32","43,85","39,34","21,97","17,37","60,66","41,48"
11,Iceland,"59,15","46,78","12,36","40,85","36,52","17,21","19,31","63,48","29,44"
12,Ireland,"58,99","50,23","8,75","41,01","37,80","21,40","16,40","57,25","28,18"
13,Italy,"58,39","53,22","5,17","41,61","28,90","22,02","6,88","71,10","53,46"
14,Latvia,"47,87","38,55","9,32","52,13","33,13","20,71","12,41","66,87","41,78"
15,Luxembourg,"60,07","54,60","5,48","39,93","38,56","29,10","9,46","61,44","34,15"
16,Netherlands,"66,82","53,10","13,72","33,18","46,76","21,40","25,35","53,23","23,70"
17,New Zealand (e),"65,88","49,87","16,01","34,12","50,31","24,80","25,51","49,69",..
18,Norway,"60,96","46,07","14,89","39,04","41,99","18,94","23,05","58,01","25,54"
19,Poland,"57,72","55,60","2,12","42,28","37,60","34,20","3,40","62,40","45,65"
20,Portugal,"65,98","57,31","8,66","34,02","44,69","28,58","16,11","55,31","42,19"
21,Slovak Republic,"48,00","44,04","3,96","52,00","19,59","15,90","3,69","79,68","61,51"
22,Slovenia,"52,20","44,66","7,54","47,80","24,41","14,64","9,77","75,59","52,60"
23,Spain,"61,43","52,55","8,88","38,57","38,43","22,51","15,92","61,57","45,02"
24,Sweden,"62,84","43,63","19,21","37,16","46,98","17,57","29,41","53,02","21,90"
25,Switzerland,"64,15","53,46","10,69","35,85","42,43","25,40","17,03","55,00","31,44"
26,United Kingdom,"60,68","48,42","12,26","39,32","43,70","21,84","21,86","56,30","24,99"
27,United States (f),"59,50","52,40","7,10","40,50","41,90","29,75","12,15","58,11","29,68"
28,OECD-28 average,"59,81","49,84","9,97","40,19","40,34","23,45","16,89","59,34","34,65"
29,Bulgaria,"60,18","50,79","9,39","39,82","43,93","24,41","19,51","56,07","34,56"
30,Croatia,"60,08","57,19","2,89","39,92","38,60","34,09","4,51","61,40","51,26"
31,"Cyprus (g,h)","65,14","60,71","4,43","34,86","42,28","33,11","9,16","57,72","37,66"
32,Lithuania,"56,17","49,86","6,31","43,83","39,75","31,03","8,73","60,25","38,66"
33,Malta,"61,79","59,23","2,56","38,21","34,61","30,44","4,16","65,39","55,11"
34,Romania,"62,74","58,37","4,37","37,26","47,19","40,44","6,75","52,75","35,70"
35,EU average,"59,27","50,93","8,35","40,73","39,27","24,86","14,42","60,49","37,15"
36,Eurozone average,"59,15","51,10","8,05","40,85","37,87","24,08","13,79","61,77","38,93"

In [6829]:
df_info = pd.DataFrame({
    'datatypes': df_22_1.dtypes,
    'null_count': df_22_1.isnull().sum(),
    'unique_count': df_22_1.nunique()
})
print(df_info)

                                                   datatypes  null_count  \
Country                                               object           0
20+_All_Total_Living_with_a_partner(%)                object           0
20+_All_Married or in a civil or registered par...    object           0
20+_All_Cohabiting_living_with_a_partner(%)           object           0
20+_All_Not living with a partner(%)                  object           0
20/34_Total_living_with_a_partner(%)                  object           0
20/34_Married or in a civil or registered partn...    object           0
20/34_Cohabiting_living_with_a_partner(%)             object           0
Not living with a partner_Total(%)                    object           0
Living with at least one parent(%)                    object           0

                                                    unique_count
Country                                                       37
20+_All_Total_Living_with_a_partner(%)                        35
20+_All_Married or in a civil or registered par...            37
20+_All_Cohabiting_living_with_a_partner(%)                   37
20+_All_Not living with a partner(%)                          35
20/34_Total_living_with_a_partner(%)                          36
20/34_Married or in a civil or registered partn...            35
20/34_Cohabiting_living_with_a_partner(%)                     36
Not living with a partner_Total(%)                            36
Living with at least one parent(%)                            35

In [6830]:
df_22_1.columns = df_22_1.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)


df_22_1.head()

,country,20_all_total_living_with_a_partner,20_all_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,20_all_cohabiting_living_with_a_partner,20_all_not_living_with_a_partner,2034_total_living_with_a_partner,2034_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,2034_cohabiting_living_with_a_partner,not_living_with_a_partner_total,living_with_at_least_one_parent
0,Australia (c),"63,79","53,59","10,20","36,21","47,06","29,41","17,65","52,94",..
1,Austria,"58,80","49,10","9,70","41,20","39,11","22,15","16,97","60,89","33,82"
2,Belgium,"62,15","53,51","8,64","37,85","45,28","29,33","15,94","54,72","31,34"
3,Canada (d),"66,89","54,46","12,43","33,11","55,34","33,55","21,79","44,66",..
4,Czech Republic,"51,17","45,39","5,79","48,83","30,78","21,32","9,46","69,22","36,20"

In [6831]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_22_1.columns if c != "country"]

df_22_1[num_cols] = (
    df_22_1[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6832]:
df_22_1["country"] = df_22_1["country"].str.replace(r"\s*\(.*?\)", "", regex=True)
print(df_22_1["country"].unique())

['Australia' 'Austria' 'Belgium' 'Canada' 'Czech Republic' 'Denmark'
 'Estonia' 'France' 'Germany' 'Greece' 'Hungary' 'Iceland' 'Ireland'
 'Italy' 'Latvia' 'Luxembourg' 'Netherlands' 'New Zealand' 'Norway'
 'Poland' 'Portugal' 'Slovak Republic' 'Slovenia' 'Spain' 'Sweden'
 'Switzerland' 'United Kingdom' 'United States' 'OECD-28 average'
 'Bulgaria' 'Croatia' 'Cyprus' 'Lithuania' 'Malta' 'Romania' 'EU average'
 'Eurozone average']

In [6833]:
df_22_1.drop_duplicates(inplace = True)
df_22_1.dropna(inplace=True)

if "year" not in df_22_1.columns :
    df_22_1["year"] = 2021
df_22_1["unit"] = "%"
df_22_1["source"] = "OECD"  
df_22_1.sample(8)

,country,20_all_total_living_with_a_partner,20_all_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,20_all_cohabiting_living_with_a_partner,20_all_not_living_with_a_partner,2034_total_living_with_a_partner,2034_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,2034_cohabiting_living_with_a_partner,not_living_with_a_partner_total,living_with_at_least_one_parent,year,unit,source
30,Croatia,60.08,57.19,2.89,39.92,38.60,34.09,4.51,61.40,51.26,2021,%,OECD
33,Malta,61.79,59.23,2.56,38.21,34.61,30.44,4.16,65.39,55.11,2021,%,OECD
12,Ireland,58.99,50.23,8.75,41.01,37.80,21.40,16.40,57.25,28.18,2021,%,OECD
35,EU average,59.27,50.93,8.35,40.73,39.27,24.86,14.42,60.49,37.15,2021,%,OECD
13,Italy,58.39,53.22,5.17,41.61,28.90,22.02,6.88,71.10,53.46,2021,%,OECD
6,Estonia,53.93,37.30,16.64,46.07,45.31,17.81,27.50,54.69,26.46,2021,%,OECD
31,Cyprus,65.14,60.71,4.43,34.86,42.28,33.11,9.16,57.72,37.66,2021,%,OECD
32,Lithuania,56.17,49.86,6.31,43.83,39.75,31.03,8.73,60.25,38.66,2021,%,OECD

In [6834]:
df_info = pd.DataFrame({
    'datatypes': df_22_1.dtypes,
    'null_count': df_22_1.isnull().sum(),
    'unique_count': df_22_1.nunique()
})
print(df_info)

                                                   datatypes  null_count  \
country                                               object           0
20_all_total_living_with_a_partner                   float64           0
20_all_married_or_in_a_civil_or_registered_part...   float64           0
20_all_cohabiting_living_with_a_partner              float64           0
20_all_not_living_with_a_partner                     float64           0
2034_total_living_with_a_partner                     float64           0
2034_married_or_in_a_civil_or_registered_partne...   float64           0
2034_cohabiting_living_with_a_partner                float64           0
not_living_with_a_partner_total                      float64           0
living_with_at_least_one_parent                      float64           0
year                                                   int64           0
unit                                                  object           0
source                                                object           0

                                                    unique_count
country                                                       34
20_all_total_living_with_a_partner                            32
20_all_married_or_in_a_civil_or_registered_part...            34
20_all_cohabiting_living_with_a_partner                       34
20_all_not_living_with_a_partner                              32
2034_total_living_with_a_partner                              33
2034_married_or_in_a_civil_or_registered_partne...            32
2034_cohabiting_living_with_a_partner                         33
not_living_with_a_partner_total                               33
living_with_at_least_one_parent                               34
year                                                           1
unit                                                           1
source                                                         1

In [6835]:
#df_22_1.to_csv('../data/Cleaned/cleaned_households_by_partnership_status_oecd.csv', index=False)

In [6836]:
#df_22_1.to_sql('households_by_partnership_status_oecd', engine, if_exists='replace', index= False)

In [6837]:
df_22_2 = pd.read_csv('../data/Raw/OECD/SF3_3_B_ by level of educational attainment_S2.csv')
#level_of_educational_attainment
df_22_2

,Country,Low_Education_Total_living_with_a_partner(%),Low_educationMarried or in a civil or registered partnership_living_with_a_partner(%),Low_education_Cohabiting_living_with_a_partner(%),Not living with a partner_Low_education(%),Medium education_Total_Living with a partner(%),Medium education_Married or in a civil or registered partnership_Living with a partner(%),Medium education_Cohabiting_Living with a partner(%),Not living with a partner_Medium education(%),High education_Total_Living with a partner(%),High education_Married or in a civil or registered partnership_Living with a partner(%),High education_Cohabiting_Living with a partner(%),Not living with a partner_High education(%)
0,Austria,"56,81","50,49","6,32","43,19","59,27","48,73","10,54",NaN,"60,03","48,38","11,65","39,97"
1,Belgium,"62,28","56,11","6,17","37,72","60,79","49,80","10,99",NaN,"67,09","56,58","10,51","32,91"
2,Czech Republic,"40,81","36,55","4,26","59,19","53,99","47,87","6,12","46,01","57,29","50,26","7,03","42,71"
3,Estonia,"42,17","26,39","15,78","57,83","54,41","36,61","17,79","45,59","60,14","44,45","15,69","39,86"
4,France,"61,12","51,93","9,18","38,88","65,68","49,17","16,51","34,32","65,58","46,60","18,98","34,42"
5,Germany,"54,46","48,79","5,67","45,54","62,38","53,13","9,25","37,62","68,89","59,16","9,74","31,11"
6,Greece,"63,81","62,88","0,93","36,19","57,00","54,88","2,12","43,00","58,33","55,70","2,63","41,67"
7,Hungary,"50,33","40,38","9,95","49,67","57,94","46,78","11,15","42,06","59,56","51,02","8,55","40,44"
8,Iceland,"51,86","41,02","10,84","48,14","58,31","46,57","11,74","41,69","69,72","54,53","15,19","30,28"
9,Latvia,"36,27","25,92","10,35","63,73","49,32","39,54","9,78","50,68","52,91","45,39","7,52","47,09"
10,Luxembourg,"66,44","61,69","4,75","33,56","60,86","54,66","6,20","39,14","61,75","54,98","6,77","38,25"
11,Norway,"52,46","39,63","12,83","47,54","62,17","47,18","14,99","37,83","67,62","50,94","16,68","32,38"
12,Poland,"48,72","47,04","1,68","51,28","61,65","59,51","2,14","38,35","58,52","55,81","2,71","41,48"
13,Portugal,"69,60","62,12","7,48","30,40","56,32","44,88","11,45","43,68","60,43","49,53","10,91","39,57"
14,Slovenia,"51,15","45,57","5,59","48,85","51,64","43,80","7,83","48,36","55,28","45,94","9,34","44,72"
15,Spain,"63,17","56,31","6,86","36,83","58,80","47,83","10,97","41,20","59,82","48,37","11,45","40,18"
16,Sweden (c),"57,24","43,90","13,34","42,76","61,59","40,31","21,28","38,41","70,45","50,33","20,12","29,55"
17,United Kingdom,"56,64","46,81","9,83","43,36","60,90","46,69","14,21","39,10","65,01","51,97","13,04","34,99"
18,OECD-19 average,"54,74","46,86","7,88","45,26","58,50","47,66","10,84","41,69","62,13","51,11","11,03","37,87"
19,Bulgaria,"58,16","45,70","12,46","41,84","59,72","51,60","8,12","40,28","63,75","55,52","8,23","36,25"
20,Croatia,"56,18","53,83","2,36","43,82","61,86","58,87","2,99","38,14","60,58","57,21","3,38","39,42"
21,"Cyprus (d,e)","66,81","64,65","2,17","33,19","64,46","59,71","4,75","35,54","65,75","59,86","5,89","34,25"
22,Lithuania,"43,42","37,64","5,78","56,58","57,97","50,97","6,99","42,03","61,25","55,77","5,49","38,75"
23,Malta,"65,14","63,30","1,84","34,86","54,84","51,17","3,67","45,16","57,23","53,14","4,09","42,77"
24,Romania,"58,90","53,32","5,58","41,10","66,20","62,56","3,64","33,80","61,89","58,24","3,65","38,11"
25,EU average,"56,00","49,31","6,69","44,00","58,98","49,91","9,07","41,02","61,48","52,42","9,06","38,52"
26,Eurozone average,"57,40","51,11","6,29","42,60","58,18","48,92","9,26","41,82","61,13","51,69","9,45","38,87"

In [6838]:
df_info = pd.DataFrame({
    'datatypes': df_22_2.dtypes,
    'null_count': df_22_2.isnull().sum(),
    'unique_count': df_22_2.nunique()
})
print(df_info)

                                                   datatypes  null_count  \
Country                                               object           0
Low_Education_Total_living_with_a_partner(%)          object           0
Low_educationMarried or in a civil or registere...    object           0
Low_education_Cohabiting_living_with_a_partner(%)     object           0
Not living with a partner_Low_education(%)            object           0
Medium education_Total_Living with a partner(%)       object           0
Medium education_Married or in a civil or regis...    object           0
Medium education_Cohabiting_Living with a partn...    object           0
Not living with a partner_Medium education(%)         object           2
High education_Total_Living with a partner(%)         object           0
High education_Married or in a civil or registe...    object           0
High education_Cohabiting_Living with a partner(%)    object           0
Not living with a partner_High education(%)           object           0

                                                    unique_count
Country                                                       27
Low_Education_Total_living_with_a_partner(%)                  27
Low_educationMarried or in a civil or registere...            27
Low_education_Cohabiting_living_with_a_partner(%)             27
Not living with a partner_Low_education(%)                    27
Medium education_Total_Living with a partner(%)               27
Medium education_Married or in a civil or regis...            27
Medium education_Cohabiting_Living with a partn...            27
Not living with a partner_Medium education(%)                 24
High education_Total_Living with a partner(%)                 27
High education_Married or in a civil or registe...            27
High education_Cohabiting_Living with a partner(%)            27
Not living with a partner_High education(%)                   27

In [6839]:
df_22_2.columns = df_22_2.columns.str.lower() \
                .str.replace(' ', '_') \
                .str.replace('(', '') \
                .str.replace(')', '') \
                .str.replace('[^0-9a-zA-Z_]', '', regex=True)


df_22_2.head()

,country,low_education_total_living_with_a_partner,low_educationmarried_or_in_a_civil_or_registered_partnership_living_with_a_partner,low_education_cohabiting_living_with_a_partner,not_living_with_a_partner_low_education,medium_education_total_living_with_a_partner,medium_education_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,medium_education_cohabiting_living_with_a_partner,not_living_with_a_partner_medium_education,high_education_total_living_with_a_partner,high_education_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,high_education_cohabiting_living_with_a_partner,not_living_with_a_partner_high_education
0,Austria,"56,81","50,49","6,32","43,19","59,27","48,73","10,54",NaN,"60,03","48,38","11,65","39,97"
1,Belgium,"62,28","56,11","6,17","37,72","60,79","49,80","10,99",NaN,"67,09","56,58","10,51","32,91"
2,Czech Republic,"40,81","36,55","4,26","59,19","53,99","47,87","6,12","46,01","57,29","50,26","7,03","42,71"
3,Estonia,"42,17","26,39","15,78","57,83","54,41","36,61","17,79","45,59","60,14","44,45","15,69","39,86"
4,France,"61,12","51,93","9,18","38,88","65,68","49,17","16,51","34,32","65,58","46,60","18,98","34,42"

In [6840]:
# Convert all but 'country' to float (robust + compact)
num_cols = [c for c in df_22_2.columns if c != "country"]

df_22_2[num_cols] = (
    df_22_2[num_cols].astype(str)
    .replace({'\xa0': '', '\u202f': '', ',': '.'}, regex=True)   # spaces & decimal comma
    .replace(r'[^\d\.\-]', '', regex=True)                       # keep digits/dot/minus
    .replace(r'\.\.+', '.', regex=True)                          # collapse multi-dots
    .replace(r'^\.$|^\s*$', np.nan, regex=True)                  # lone dot/empty -> NaN
    .apply(pd.to_numeric, errors="coerce")
)

In [6841]:
df_22_2["country"] = df_22_2["country"].str.replace(r"\s*\(.*?\)", "", regex=True)

print(df_22_2["country"].unique())

['Austria' 'Belgium' 'Czech Republic' 'Estonia' 'France' 'Germany'
 'Greece' 'Hungary' 'Iceland' 'Latvia' 'Luxembourg' 'Norway' 'Poland'
 'Portugal' 'Slovenia' 'Spain' 'Sweden' 'United Kingdom' 'OECD-19 average'
 'Bulgaria' 'Croatia' 'Cyprus' 'Lithuania' 'Malta' 'Romania' 'EU average'
 'Eurozone average']

In [6842]:
df_22_2.drop_duplicates(inplace=True)
df_22_2.dropna(inplace=True)

In [6843]:
if "year" not in df_22_1.columns :
    df_22_2["year"] = 2021
df_22_2["unit"] = "%"
df_22_2["source"] = "OECD"    

df_22_2.sample(10)

,country,low_education_total_living_with_a_partner,low_educationmarried_or_in_a_civil_or_registered_partnership_living_with_a_partner,low_education_cohabiting_living_with_a_partner,not_living_with_a_partner_low_education,medium_education_total_living_with_a_partner,medium_education_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,medium_education_cohabiting_living_with_a_partner,not_living_with_a_partner_medium_education,high_education_total_living_with_a_partner,high_education_married_or_in_a_civil_or_registered_partnership_living_with_a_partner,high_education_cohabiting_living_with_a_partner,not_living_with_a_partner_high_education,unit,source
8,Iceland,51.86,41.02,10.84,48.14,58.31,46.57,11.74,41.69,69.72,54.53,15.19,30.28,%,OECD
10,Luxembourg,66.44,61.69,4.75,33.56,60.86,54.66,6.20,39.14,61.75,54.98,6.77,38.25,%,OECD
19,Bulgaria,58.16,45.70,12.46,41.84,59.72,51.60,8.12,40.28,63.75,55.52,8.23,36.25,%,OECD
6,Greece,63.81,62.88,0.93,36.19,57.00,54.88,2.12,43.00,58.33,55.70,2.63,41.67,%,OECD
20,Croatia,56.18,53.83,2.36,43.82,61.86,58.87,2.99,38.14,60.58,57.21,3.38,39.42,%,OECD
3,Estonia,42.17,26.39,15.78,57.83,54.41,36.61,17.79,45.59,60.14,44.45,15.69,39.86,%,OECD
2,Czech Republic,40.81,36.55,4.26,59.19,53.99,47.87,6.12,46.01,57.29,50.26,7.03,42.71,%,OECD
18,OECD-19 average,54.74,46.86,7.88,45.26,58.50,47.66,10.84,41.69,62.13,51.11,11.03,37.87,%,OECD
12,Poland,48.72,47.04,1.68,51.28,61.65,59.51,2.14,38.35,58.52,55.81,2.71,41.48,%,OECD
23,Malta,65.14,63.30,1.84,34.86,54.84,51.17,3.67,45.16,57.23,53.14,4.09,42.77,%,OECD

In [6844]:
df_info = pd.DataFrame({
    'datatypes': df_22_2.dtypes,
    'null_count': df_22_2.isnull().sum(),
    'unique_count': df_22_2.nunique()
})
print(df_info)

                                                   datatypes  null_count  \
country                                               object           0
low_education_total_living_with_a_partner            float64           0
low_educationmarried_or_in_a_civil_or_registere...   float64           0
low_education_cohabiting_living_with_a_partner       float64           0
not_living_with_a_partner_low_education              float64           0
medium_education_total_living_with_a_partner         float64           0
medium_education_married_or_in_a_civil_or_regis...   float64           0
medium_education_cohabiting_living_with_a_partner    float64           0
not_living_with_a_partner_medium_education           float64           0
high_education_total_living_with_a_partner           float64           0
high_education_married_or_in_a_civil_or_registe...   float64           0
high_education_cohabiting_living_with_a_partner      float64           0
not_living_with_a_partner_high_education             float64           0
unit                                                  object           0
source                                                object           0

                                                    unique_count
country                                                       25
low_education_total_living_with_a_partner                     25
low_educationmarried_or_in_a_civil_or_registere...            25
low_education_cohabiting_living_with_a_partner                25
not_living_with_a_partner_low_education                       25
medium_education_total_living_with_a_partner                  25
medium_education_married_or_in_a_civil_or_regis...            25
medium_education_cohabiting_living_with_a_partner             25
not_living_with_a_partner_medium_education                    24
high_education_total_living_with_a_partner                    25
high_education_married_or_in_a_civil_or_registe...            25
high_education_cohabiting_living_with_a_partner               25
not_living_with_a_partner_high_education                      25
unit                                                           1
source                                                         1

In [6845]:
#df_22_2.to_csv('../data/Cleaned/cleaned_level_of_educational_attainment_oecd.csv', index=False)

In [6846]:
#df_22_2.to_sql('level_of_educational_attainment_oecd',engine, if_exists='replace', index= False)

In [6847]:
df_6666 = pd.read_csv('../data/Raw/OECD/OECD_df_famliy_selected.csv')
df_6666

,STRUCTURE,STRUCTURE_ID,STRUCTURE_NAME,ACTION,COU,Country,SEX,Sex,IND,Indicator,...,OBS_VALUE,Observation Value,OBS_STATUS,Observation Status,UNIT_MEASURE,Unit of Measures,UNIT_MULT,Multiplier,BASE_PER,Base reference period
0,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,LVA,Latvia,TOTAL,Total,FAM3,Share of births outside of marriage (% of all ...,...,39.5,NaN,A,NaN,PC,Percentage,0,Units,NaN,NaN
1,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,GRC,Greece,TOTAL,Total,FAM3,Share of births outside of marriage (% of all ...,...,11.1,NaN,A,NaN,PC,Percentage,0,Units,NaN,NaN
2,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,CHL,Chile,TOTAL,Total,FAM3,Share of births outside of marriage (% of all ...,...,74.8,NaN,A,NaN,PC,Percentage,0,Units,NaN,NaN
3,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,NLD,Netherlands,TOTAL,Total,FAM3,Share of births outside of marriage (% of all ...,...,51.9,NaN,A,NaN,PC,Percentage,0,Units,NaN,NaN
4,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,LTU,Lithuania,TOTAL,Total,FAM3,Share of births outside of marriage (% of all ...,...,26.4,NaN,A,NaN,PC,Percentage,0,Units,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
500,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,COL,Colombia,TOTAL,Total,FAM2,Mean age of women at childbirth,...,30.4,NaN,A,NaN,YR,Years,0,Units,NaN,NaN
501,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,OAVG,OECD - Average,TOTAL,Total,FAM2,Mean age of women at childbirth,...,30.5,NaN,A,NaN,YR,Years,0,Units,NaN,NaN
502,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,OAVG,OECD - Average,TOTAL,Total,FAM2,Mean age of women at childbirth,...,30.6,NaN,A,NaN,YR,Years,0,Units,NaN,NaN
503,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,OAVG,OECD - Average,TOTAL,Total,FAM2,Mean age of women at childbirth,...,30.7,NaN,A,NaN,YR,Years,0,Units,NaN,NaN
504,DATAFLOW,OECD:DF_FAMILY(1.0),Family Database,I,OAVG,OECD - Average,TOTAL,Total,FAM2,Mean age of women at childbirth,...,30.9,NaN,A,NaN,YR,Years,0,Units,NaN,NaN